[{"id": 348350, "page": 1, "results": [{"author": "garethmb", "content": "Back in 1977 I remember going into the original Cine Capri to see “Star Wars” with some friends. I was very young but little did I know that movie would change my life and put me on the path that I am now. Over the decades that have followed I have read the books and comics, played with the toys, played the video games, and eagerly watched any new film or television show related to the franchise.\n\nThe fact that Disney has put out a new film every years since “Star Wars: The Force Awakens” is great for fans like me as those three year waits; to say nothing of the 17+ years between the Original and Prequel Trilogies were tough.\n\nThrough it all my favorite character has always been Han Solo. I do not know what it is but the brash, cocky, money loving; scoundrel who gets in and out of trouble yet does the right thing in the end has always connected with me.\nSo when news came that there would be a new movie based on the early years of the title characters I was excited but concerned as Harrison Ford is so iconic in that role I could not see how anyone could measure up.\n\nCombine that with original Directors Phil Lord and Christopher Miller being removed from the film after shooting a significant number of weeks, there was ample concern to go around.\n\nFortunately for fans, Director Ron Howard has crafted a very enjoyable film as “Han Solo: A Star Wars Story” deftly combines the action, visuals, and humor that made the films cinematic legends and in doing so introduces new characters and expands the lore of the Star Wars Universe.\n\nThe film follows a young Han (Alden Ehrenreich), who hustles to survive and get off the world of Corrilia.\n\nHan like many kids on the street pull all sorts of scams under the control of various criminals and he plots to escape with his friend Qi’ra (Emilia Clarke).\nWhen an opportunity arises, Han takes it, but finds himself in the Imperial Navy which does not bode well for a person with strong opinions and a mind of his own. \nFate steps in once again and introduces Han to Chewbacca (Joonas Suotamo), and a mentor figure in the form of a man named Beckett (Woody Harrelson).   Han attempts to prove himself to his new crew as he sees this as his way out to a better life. However with things take a turn for the worse, he must work with his new associates to clear the slate with a deadly crime boss named Dry’den Vos (Paul Bettany).  \nAs anyone who follows the series knows Han has a way of escalating a situation and this leads the crew to recruiting Lando Calrissian (Donald Glover), into the crew as they set off to pull off a risky and dangerous mission to get the much needed resources to save their lives.\n\nWhat follows is a very enjoyable film that has an appropriate amount of humor and character building as well as plenty of good action and effects which should keep fans of the series happy. The new characters were very enjoyable and added a new depth to Han as well as the Star Wars mythos but what really impressed me was that at no time did I find myself comparing Ehrenreich to Harrison Ford. He was charismatic and enjoyable in the role and I easily believed that this was Han before life, the universe, and circumstances turned him into the man we would know years later.\nGlover is uncanny with his version of Lando and he at times almost sounded like Billy Dee Williams and had many of the mannerisms of the character down His back and forth with Han was great to see and we got a much deeper understand of both the characters and their complicated history with one another.\n\nClark and Harrelson round things out well as they provide a great balance to Han. One is a mentor and one is the link to the life he had and the dreams he wants to achieve.   Ron Howard moves things along well without rushing things as while it does take a bit of time getting up to speed, it happens at a natural pace without seeming rushed. Howard also does not rely on an abundance of effects to carry the film. There are plenty of practical FX and makeup creations to make you well aware that this is a vast and diverse galaxy but he uses them and the CGI to enhance the story rather than carry it.\n\nThere are numerous nods throughout to past films as well both visual and verbal and a few great surprises along the way. It is believed that more adventures of the younger Han will be coming in the future and I cannot wait for them to arrive as this was a very fun film. Now the only hard part will be the 19 month wait for Episode IX as the five month wait from the last film already seems like ages ago and I cannot wait for more.\n\n4.5 stars out of 5", "id": "5afc39c9c3a36807270066ad", "url": "https://www.themoviedb.org/review/5afc39c9c3a36807270066ad"}, {"author": "jmquint00", "content": "Not a bad movie, but you cannot replace H. Ford. The new Solo tries to be too much like the old Solo. Also, Lando is way too cool. Fav character was L3.", "id": "5b09f2559251411d8900005e", "url": "https://www.themoviedb.org/review/5b09f2559251411d8900005e"}, {"author": "Movie Queen41", "content": "I have been a Star Wars fan since childhood. In fact, Star Wars: A New Hope was one of the first movies I ever saw in a theater. And I really enjoyed this movie. Don't believe the naysayers. There has been a lot of bad press surrounding the movie since the directors got fired and had to be replaced by Ron Howard. There was also some controversy of whether the lead actor was any good as Han Solo. The movie is not the mess we were led to believe. It works pretty well. Good action and special effects and lots of interesting alien creatures, as we would expect from a Star Wars movie. Alden Ehrenreich does a good job to make the role his own instead of doing an impression of Harrison Ford. Woody Harrelson, Phoebe Walter-Bridge, Donald Glover, and Paul Bettany also do good work in the film. Recommended for Star Wars fans.", "id": "5b0ad5609251411e6a008396", "url": "https://www.themoviedb.org/review/5b0ad5609251411e6a008396"}, {"author": "Law", "content": "Things happen because they're supposed to happen, and not because they would benefit the story. This is well-made but it feels perfunctory, fragmented, and, most importantly, entirely unnecessary. This movie is what happens when you work back from a foregone conclusion that's three decades old. Solo is tired, and it made me feel tired. It should never have been made. P.S. This is the first movie in which I didn't dislike Emilia Clarke! She's improving.", "id": "5b0b38f79251411d8900eb9a", "url": "https://www.themoviedb.org/review/5b0b38f79251411d8900eb9a"}, {"author": "Gimly", "content": "The public's backlash against _Solo_ has been **severely** diminished when compared to _The Last Jedi_, unfortunately however, so did the box office numbers. Best case scenario, this thing breaks even, and even that is looking unlikely. But I did actually quite enjoy _Solo_. It's not perfect, there are a decent number of problems I had with both the movie itself, and with its connection to the story overall, but I actually had a really good time watching _Solo_ (and seeing as I was probably the most sick I've ever been in my life when I watched it, that's saying something).\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time_.", "id": "5b91fec20e0a26609c0059e5", "url": "https://www.themoviedb.org/review/5b91fec20e0a26609c0059e5"}], "total_pages": 1, "total_results": 5}, {"id": 346910, "page": 1, "results": [{"author": "Shane", "content": "A complete waste of opportunity.  The film smacks of studio interference and bad decisions.  It starts off decent enough but at the halfway point it turns into a shambles and it does feel as if a lot of it ended up on the cutting room floor.  The music was very intrusive and some scenes were so badly lit you had no idea who was just killed or even what killed them.\r\n\r\nSome knowing nods to the earlier Predator films was a nice touch and it was good they didn't skimp on the gore and violence but all in all it's a bad movie.  Stick to Predator and Predators.", "id": "5b9d9aa40e0a2675650093ff", "url": "https://www.themoviedb.org/review/5b9d9aa40e0a2675650093ff"}, {"author": "Gimly", "content": "My mind was racing as I watched _The Predator_ in the cinema tonight. I'd heard virtually nothing good about it so my anxious brain kicked into overdrive the whole time the film was going on. As a result of that, I almost feel like I experienced three movies in that theatre. First, obviously the movie on the screen. Secondly, the awesome movie I was theorising could unfurl at the result of each new sequence and plot point, but that sadly never did. And thirdly, the inexcusably awful and franchise-ruining movie that I feared it was about to take a hard left turn into at any minute, and thankfully never did.\r\n\r\nAnd that's really my experience on _The Predator_ overall, and the reason for a stalemate \"2.5 outta 5\" review: It wasn't as good as it should have been, it wasn't as bad as it could have been. Unfortunately, when the movie I'm writing in my head alongside watching it is better than what's actually on screen, when you take into account that I'm an unimaginative, talentless hack, really doesn't cut it for a sequel to _Predator_, one of of only five movies I've ever given a perfect rating to.\r\n\r\nThe best parts of _The Predator_ are when there is an eponymous Predator on screen. So you might think, \"Oh it's not a good movie, but it's a good _Predator_ movie\", and fair enough a conclusion to draw, but no. Part of the problem is, this movie really could have been pulled off with any aliens at all. Take out the Yautja and replace them with... I dunno, the blue skinned pogo-stick people of Planet Hurfadump, and it can still play out functionally the same. See, although I enjoyed watching the Predators do their thing, there was really nothing beyond cosmetic similarities that made them the Predators we've seen in every movie preceding this one.\r\n\r\nI think possibly part of the reason for that is that every other movie with a Predator in it has been an Action Horror movie (albeit Action Horror with ever-increasing Sci-Fi elements from film to film) whereas _The Predator_ is an Action Comedy, just one with some gore. Now I don't think that taking it that route was necessarily and... abysmal failure, let's say, but was Action Comedy the **best** way to take the _Predator_ franchise? I think it's pretty clear that the answer is no.\r\n\r\nIronic that that direction is being taken by Shane Black, the man who has a history with _Predator_ purely because the crew of the first film were determined to have him to work on the script, which he refused. Now here we are more 30 years later and Shane Black finally **has** put his name on a Predator movie, and it's not even good.\r\n\r\nFuck. At least it's better than _AvP: Requiem_!", "id": "5ba3bf77c3a3683398020486", "url": "https://www.themoviedb.org/review/5ba3bf77c3a3683398020486"}], "total_pages": 1, "total_results": 2}, {"id": 439079, "page": 1, "results": [{"author": "antimony", "content": "Appallingly cliched. Slow and boring. Not even the Conjuring hype could save this film. It moves forward at a painful pace, brings nothing new to the table, and is not even scary.", "id": "5b98b7ef0e0a263db5006afb", "url": "https://www.themoviedb.org/review/5b98b7ef0e0a263db5006afb"}, {"author": "Mark Rushow", "content": "Overall I liked The Nun it was a spooky fun movie with some pretty good shots and scenes (lighting, camera angles, and such). The transitions from one scene to another was a bit off and the story overall had a more fantasy tone over the more grounded and realistic tone The Conjuring and Annabelle movies had. Much of the story felt like it was just forced to setup a shot or scene which does hurt it. It isn't a perfect movie but I'd watch it again. It is like Indiana Jones meets Silent Hill. None of the character actors felt out of place or superficial either, I really appreciate that. Everyone felt believable and natural to their roles and environment, not forced.", "id": "5b9b19530e0a2628dc00bca3", "url": "https://www.themoviedb.org/review/5b9b19530e0a2628dc00bca3"}], "total_pages": 1, "total_results": 2}, {"id": 299536, "page": 1, "results": [{"author": "Screen-Space", "content": "\"It is a bold undertaking, to readjust what is expected of the MCU/Avengers formula, and there are moments when the sheer scale and momentum match the narrative ambition...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2018/4/25/avengers-infinity-war.html", "id": "5adff809c3a3683daa00ad3d", "url": "https://www.themoviedb.org/review/5adff809c3a3683daa00ad3d"}, {"author": "furious_iz", "content": "Amazing.  Visually stunning.  So much going on, but somehow also clear and easy to understand.  A little flabby in the middle third, but given the huge cast and story to cover it is very understandable.  The highlight was the parings of characters from different stories and their interactions.\r\n\r\nIf you aren't a Marvel fan this film won't convert you, but if you have liked any of the previous films you will like this too.\r\n\r\n9/10", "id": "5ae02e1e0e0a26156900f6da", "url": "https://www.themoviedb.org/review/5ae02e1e0e0a26156900f6da"}, {"author": "Gimly", "content": "Just a very short, NO SPOILERS review I wanted to get down while it's still fresh.\r\n\r\nFor a movie with this much riding it, to come out not feeling disappointed, is a **massive** achievement. While I absolutely do love it I had some things that I felt were maybe imperfect about _Infinity War_, but my biggest concern was that it seemed like it would be absolutely meaningless to somebody who didn't put in the effort of watching the 18 movies leading up to it. You can probably assuage that fear though, because I went to see it with two people who had only seen _Black Panther_ at this point, and they both loved it, with minimal confusion.\r\n\r\nPersonally? I can't wait to see it again. This is probably the most excited I've been about the second watch of an MCU film since the first _Avengers_.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "id": "5ae0a3d20e0a26156301455e", "url": "https://www.themoviedb.org/review/5ae0a3d20e0a26156301455e"}, {"author": "Law", "content": "The third act turns on a character being an idiot. That story beat renders all that the heroes do before and after it immaterial. That moment so preoccupied me that I couldn't enjoy the rest of the story, and made it impossible to ignore the flick's other glaring flaws anymore: the villain's motive makes no sense, the glove exists only to produce plot contrivances, the score is so obvious it might as well be cue cards on screen (\"Feel sad now\") ...\r\n\r\nThe first half is some of the best action in a Disney Marvel entry yet, and the other half is so stupid that it sours the whole MCU experience.", "id": "5ae4205b0e0a266c71003206", "url": "https://www.themoviedb.org/review/5ae4205b0e0a266c71003206"}, {"author": "Ch Walid", "content": "Best MCU movie, more than that.... BEST SUPERHERO MOVIE EVER. Hands Down", "id": "5ae77ce60e0a262b9700a2df", "url": "https://www.themoviedb.org/review/5ae77ce60e0a262b9700a2df"}, {"author": "hs.rohit", "content": "Nice Movie.", "id": "5ae85089c3a368134801a38e", "url": "https://www.themoviedb.org/review/5ae85089c3a368134801a38e"}, {"author": "Movie Queen41", "content": "Massive, epic movie. I'm so happy that Marvel is stepping up their game with their villains. For too long, MCU villains have been too bland and generic. But lately, the villains have improved with Michael Keaton's Vulture, Michael B. Jordan's Killmonger, and now James Brolin's Thanos. Thanos has appeared in several other MCU films, but he seemed rather flat in those movies. Here, he's allowed to be fully developed as a character. Especially touching is his relationship with his adoptive daughter, Gamora. It's actually surprisingly tender and moving. Thanos is the actual main focus of the film, and if he failed as a character, the entire movie wouldn't have worked. So bravo, Marvel!", "id": "5ae866939251410cdc016c31", "url": "https://www.themoviedb.org/review/5ae866939251410cdc016c31"}, {"author": "jmquint00", "content": "Best Movie Ever...", "id": "5b043a7a0e0a2623ec029554", "url": "https://www.themoviedb.org/review/5b043a7a0e0a2623ec029554"}, {"author": "Wuchak", "content": "Moving ending, but easily the least of the Avengers movies\r\n\r\nRELEASED IN 2018 and directed by Anthony & Joe Russo, \"Avengers: Infinity War\" chronicles events when the Avengers team-up with several allies to defeat the cosmic despot Thanos, whose goal is to collect all six Infinity Stones to attain unimaginable power and radically solve one of the Universe’s most challenging problems.\r\n\r\nThe story focuses on Thanos, Thor and the Guardians of the Galaxy, especially Gamora, as well as Iron Man, Doctor Strange and Spider-Man. The rest of the cast members are decidedly peripheral, e.g. Black Widow, Captain America, Black Panther, Vision and Scarlet Witch.\r\n\r\nThis is easily the least of the Avengers trilogy. Not to mention \"Captain America: Civil War\" (2016) and \"Thor: Ragnarok\" (2017) are significantly more compelling and all-around entertaining. Actually, all three Thor flicks are palpably superior, as is “Iron Man 2” (2010). If you haven’t already, I encourage you to watch these movies prior to viewing “Infinity War,” as well as “Black Panther” (2018) and the two “Guardians of the Galaxy” flicks (2014/2017); otherwise you’ll likely be lost because all these movies lead up to this one.\r\n\r\n“Infinity War” is certainly an ambitious comic book movie in that it notably juggles so many super-beings, but this lack of focus isn’t conducive to suspense or great drama. It’s okay at best with overkill CGI and the big battle in the closing act with the easily slaughtered four-armed dog-creatures is curiously dull. But the film gets extra points for a bold, poignant climax, which sets up the 2019 sequel. \r\n\r\nIn any case, People giving it the top rating and calling it “the greatest superhero movie ever” need a serious reality check.\r\n\r\nTHE MOVIE RUNS 2 hours, 29 minute and was shot in New York City, Scotland and Philippines with studio work done in Pinewood Atlanta Studios in Fayetteville, Georgia. WRITERS: Christopher Markus and Stephen McFeely.\r\n\r\nGRADE: C+", "id": "5b3a6dfcc3a36845b800feee", "url": "https://www.themoviedb.org/review/5b3a6dfcc3a36845b800feee"}, {"author": "Santosh", "content": "I Love this movie.", "id": "5b72ec050e0a267ef11b5f8c", "url": "https://www.themoviedb.org/review/5b72ec050e0a267ef11b5f8c"}], "total_pages": 2, "total_results": 11}, {"id": 351286, "page": 1, "results": [{"author": "Law", "content": "I felt embarrassed to be watching this. It's an embarrassing fever dream. I abandoned it halfway through its runtime.", "id": "5b2d4c080e0a264aea001943", "url": "https://www.themoviedb.org/review/5b2d4c080e0a264aea001943"}, {"author": "Wuchak", "content": "More dinosaurs, Opie’s hot daughter, Dracula’s castle and Indiana Jones\r\n\r\n “Jurassic World: Fallen Kingdom” (2018) revolves around Claire (Bryce Dallas Howard) and Owen (Chris Pratt) leading a team back to Isla Nublar to save several species of dinosaurs after an active volcano threatens all life there. The plan is to relocate the dinosaurs to a new island sanctuary, but that’s not the way it works out.\r\n\r\nMy title blurb pretty much says it all for this fifth film in the franchise. I mention Indiana Jones because the movie has a “Raiders of the Lost Ark” (1981) vibe more so than the other movies. The reference to Dracula’s castle is due to the fact that the entire second half takes place at a cool, gothic chateau in Northern California and there’s a scene with a genetically-enhanced raptor acting like Dracula.\r\n\r\nCurvy Bryce is just stunning throughout and easily blows away any other woman in the series. Meanwhile Pratt seriously upped his game as leading action hero (I wasn’t overly impressed with him in the previous film, although I didn’t dislike him either). At the end of the day I’d have to rank this installment as my favorite, followed by the original 1993 movie and 2015’s “Jurassic World.”\r\n\r\nThe film runs 2 hours, 8 minutes and was shot in Hawaii and England/Scotland.\r\n\r\nGRADE: A-/B+", "id": "5b9f08d3925141231900fa88", "url": "https://www.themoviedb.org/review/5b9f08d3925141231900fa88"}], "total_pages": 1, "total_results": 2}, {"id": 135870, "page": 1, "results": [], "total_pages": 0, "total_results": 0}, {"id": 442249, "page": 1, "results": [], "total_pages": 0, "total_results": 0}, {"id": 400535, "page": 1, "results": [], "total_pages": 0, "total_results": 0}, {"id": 345940, "page": 1, "results": [], "total_pages": 0, "total_results": 0}, {"id": 414919, "page": 1, "results": [], "total_pages": 0, "total_results": 0}, {"id": 507569, "page": 1, "results": [], "total_pages": 0, "total_results": 0}, {"id": 383498, "page": 1, "results": [{"author": "garethmb", "content": "The Mercenary with a mouth is back with the eagerly awaited arrival of “Deadpool 2”. The films sees the generally well-meaning but highly dysfunctional Deadpool (Ryan Reynolds), back to taking out bad guys as a contract player but also managing his relationship with Vanessa (Morena Baccarin).  When an unexpected event sends his life into a freefall, Deadpool tries to find a new purpose with the help of his X-Men associates from the last film who attempt to recruit him into their organization.\nHis first mission is to defuse an angry and destructive young mutant named Russell (Julian Dennison), which takes an unexpected turn and lands them both in serious trouble.\n\nOne would think that would be enough to cause some major life changes for Deadpool but thanks to the arrival of Cable (Josh Brolin), a cyborg soldier from the future; things are about to get much more complicated and intense.\nUndaunted, Deadpool opts to form his own league of heroes and aside from Domino (Zazie Beetz); they seem to be as unlucky or dysfunctional as their leader which makes for some very hysterical consequences.\n\nWhat follows is an action and laugh-laden adventure which brings even more of what made the first film such a success to the audience as the film takes the bawdy action of the first and ups the ante thanks in large part to an expanded budget and cast.\nMy biggest concern for the film was that with an expanded budget there would be too many characters and an attempt to do far too much with the film. That did play out at times in the beginning as for me, the first film worked so well as they had to let the characters rather than the action and effects carry it and the rapid-fire arrival of so many jokes and creative profanity made repeat viewing of the film necessary to catch everything.\n\nThis time out we get elaborate action and chase sequences as well as a much larger cast. At times it seemed as if this would possibly overshadow the characters and story but Reynolds and Director David Leith never let it cross that line.\nThey also go back to the core elements in the final third of the film which really allows the film to fully connect with the tone of the original film and brings the film home to a satisfying conclusion.  What really sold the film for me was the brilliant and very inspired extended scene during the credits which allows Deadpool to “fix” various issues which perfectly captures the irreverent character and the best aspects of the series where the cast is willing to make fun of themselves as well as the larger universe in which their characters exist.\n\nI cannot wait to see what comes next as “DeadPool 2” is another fun outing for the character and something very different from most comic based movies.\n\n4 stars out of 5", "id": "5afa5a93925141414b005cf0", "url": "https://www.themoviedb.org/review/5afa5a93925141414b005cf0"}, {"author": "TobyBenson", "content": "An utterly hilarious movie, with hundreds of pop culture references. A movie that doesn't take itself seriously, creating a silly, yet sensible dynamic. A must watch!", "id": "5b15d58fc3a368534f00fde5", "url": "https://www.themoviedb.org/review/5b15d58fc3a368534f00fde5"}, {"author": "tmdb76295109", "content": "All in all, I prefer a Marvel movie that doesn't take itself seriously, but the nonstop unseriousness of Deadpool 2 can wear you down, too.", "id": "5b717f9b92514140641892de", "url": "https://www.themoviedb.org/review/5b717f9b92514140641892de"}, {"author": "Mark Rushow", "content": "Terminator + Adam Sandler = Deadpool 2. Anyone else notice that? Even Deadpool calls Cable Jon Connor but the whole movie is structured like a Terminator movie. Cable is like a combination of Jon Connor and a Terminator. All the comedy is styled just like an Adam Sandler movie. And that is it. Works pretty good oddly. It is the Terminator movie that never was. Though the director of the first Deadpool wasn't directing this movie he is actually directing the next Terminator film.", "id": "5b7259ecc3a3681899186f23", "url": "https://www.themoviedb.org/review/5b7259ecc3a3681899186f23"}, {"author": "Gimly", "content": "Takes some pretty hardcore departures from the first movie in terms of characters, but _Deadpool 2_ is still funny as Hell (maybe not quite as funny as it thinks but still, very very humorous) and Ryan Reynolds once again absolutely nails the titular role. I never loved either of these movies as much as it seems people did by and large, but I do **like** them, and that's not nothin'.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._", "id": "5b91fbdd0e0a2660990052d5", "url": "https://www.themoviedb.org/review/5b91fbdd0e0a2660990052d5"}], "total_pages": 1, "total_results": 5}, {"id": 284054, "page": 1, "results": [{"author": "Gimly", "content": "The reviews for _Black Panther_ are all essentially saying the same thing: This is a great movie because it's so different from anything we've seen before, not just in the MCU but in the superhero genre overall, the villain is fantastic and _Black Panther_ is just a new and totally innovative film. Allow me to disagree (almost) entirely. _Black Panther_ is a great film, not because it breaks the mould, but because Marvel Studios has a successful pattern and _Black Panther_ adheres to it completely. Obviously the importance of a lead who is not just black but actually African is not to be understated, we have the least white cast of any superhero movie to date and they absolutely killed it, all very important socio-political stuff, to be sure. But the bones of _Black Panther_, the plot, the script, the events, the turns, all of that, it's a carbon copy of what's worked 17 times before. It works again, don't get me wrong, _Black Panther_ truly was an experience, both important and fantastic, but to say it re-invented the wheel here, is, to me, an outright lie.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._", "id": "5a844e0fc3a36862e100c22f", "url": "https://www.themoviedb.org/review/5a844e0fc3a36862e100c22f"}, {"author": "hankster3000", "content": "Overrated and overhyped. Definitely avoid. Watch on redbox if you must.", "id": "5a87b8550e0a26535a047632", "url": "https://www.themoviedb.org/review/5a87b8550e0a26535a047632"}, {"author": "Movie Queen41", "content": "This is definitely one of Marvel's best because the story is compelling and the characters are well developed. Black Panther and his friends and family must defend themselves and their homeland of Wakanda from the clutches of Klau (Andy Serkis) and Killmonger (Michael B. Jordan). Not only is the lead actor great as T'Challa/Black Panther, but the supporting cast does a fine job as well, especially the female actors. T'Challa is surrounded by smart, strong women. Marvel seems to break its villain curse with Klau and especially Killmonger. Killmonger is very well developed and even sympathetic at times, despite his villainy. He sort of reminded me of Tom Hiddleston's Loki. The action scenes and special effects are outstanding. Highly recommended if you enjoy comic book movies.", "id": "5a8894ba0e0a2653db05d34f", "url": "https://www.themoviedb.org/review/5a8894ba0e0a2653db05d34f"}, {"author": "Crenor", "content": "Really good movie. Good story, lots of fun. This is what DC is missing.", "id": "5a8dfdcf0e0a263e6e006d75", "url": "https://www.themoviedb.org/review/5a8dfdcf0e0a263e6e006d75"}, {"author": "Per Gunnar Jonsson", "content": "It was with some hesitation that I went to see this movie. I was afraid that it would be burdened with too much political and social preaching. Especially knowing how much the movie is praised amongst certain factions in our society today. Sure enough there were indeed some of that nonsense but luckily it was much less than I feared.\r\n\r\nI actually found the movie fairly entertaining. It is far from great, certainly very far from the insane hype surrounding it, but pretty okay. It is more or less a standard issue super hero movie on a big budget. Of course this means a fairly mediocre underlying story beefed up with lots of action and special effects.\r\n\r\nThe story itself is a traditional revenge story with some black power stuff. Nothing to write home about but it works as a vehicle for the action and special effects which is what makes this movie. There are the usual nonsense and plot holes in it of course. Like Shuri claiming that Vibranium (silly name but never mind) is instable at high speeds yet they have no problem making flying ships and other fast moving stuff with it.\r\n\r\nThe characters are a wee bit disappointing as far as the main characters are concerned. I felt that the main protagonist has little in terms of charisma. Killmonger, the main bad guy, was downright disappointing. To me he looked like the stereotype of a dumb thug and mostly he behaved like one. Bloody hell could they not have found an actor that looked less…well…stupid!\r\n\r\nPersonally the character I liked best was actually Klaue which was pretty cool, insane but cool. The female warriors, which were both kick-ass and smart, and Shuri is also fairly high up on my approval list.\r\n\r\nSpecial effects! This is of course where this movie shines. Overall I think the special effects were good. The design of the various gadgets, ships etc were very nice. The rampaging rhinos in the final fight really made me laugh. I should have seen that coming. I definitely liked all the sonic effects. Obviously this movie would have been more or less null if the special effects would not have been a success.\r\n\r\nOn the whole Black Panther is a quite enjoyable special effects and action movie. Nothing more, nothing less. Some social preaching nonsense but less than I feared, hum ho story, lots of action and lots of special effects.", "id": "5a93b14b0e0a2616c602de5e", "url": "https://www.themoviedb.org/review/5a93b14b0e0a2616c602de5e"}, {"author": "OblateSphereDroid", "content": "I was really surprised how much I liked this movie.  There was so much going on; immigration concerns; the fight between saving the world and protecting your own country(sound familiar); the fear of an African country’s resources being pillaged; how best to handle the problems black people face worldwide; and many great authentic feeling cultural nods.  All this while not being heavy or preachy.  You can definitely eat popcorn to this.  The villain; Killmonger, is great.  Not great in that he is scary, though he is, but because he is more complex than some shadowy figure you should just trust is a bad guy because of visual effects or dramatic music.  \r\n\r\nThis movie isn’t just explosions and one-liners in an exotic location.  This is a great movie in general.  It’s always interesting.  There are great relationships between all the characters.  Finally; Wakanda is really a place.  It feels alive and lived in; not just impressive buildings used as a backdrop.  They did a wonderful job of worldbuilding; from the rituals, to the clothing, fancy tech, and scenery.  This movie is definitely worth a watch. \r\n\r\n☆☆☆☆-1/2\r\n\r\nI also have to add that; you get to actually see Andy Serkis!  When I saw his name I thought we was going to be some kind of CGI monster.  I’m just happy to see him get actual screen time.", "id": "5ad008f6c3a36842e4004d4d", "url": "https://www.themoviedb.org/review/5ad008f6c3a36842e4004d4d"}, {"author": "Dsnake1", "content": "The Black Panther is a fun romp, but it definitely has some issues. First, the good.\r\n\r\nThe action is fun, the emotions hit home, and the story isn't dirt-poor. \r\n\r\nWhile the CGI gets ripped on from time to time, I thought it was solid enough for a Marvel movie. The fight scenes were relatively well-choreographed, as well. The ritual combat scenes were exciting and visually appealing. The fights in Korea were also fun to see, and while I'm not a fan of car chase scenes as a whole, I did enjoy this one. It was reminiscent of a James Bond movie. \r\n\r\nIn fact, that's another appeal, at least to me. The secret technology base and the fun action scenes were a great callback to James Bond-type movies. I do think the movie would have been complemented by giving T'Challa a similar vice as Bond's, although Marvel probably wouldn't veer down that line for the seemingly morally absolute King of Wakanda.\r\n\r\nThe story, well, it's a mixed bag. Everything seemed crammed together with major emotional keys being rushed through or somewhat ignored. The concept is fine though. A long lost relative comes to challenge the new king, wins, and shows his colors, becoming something amoral. The king comes back and takes down the usurper, realizing something about themselves/their kingdom in the process. It's tired, but not so tired it damages the movie. \r\n\r\nThis is where the issues begin to rise, though. The movie is really a movie and a half or two movies crammed into one. Wakanda has a ton of wonderful mythology, but almost none of it is explained. The movie never really explains how the Wakandans used vibranium was used to make themselves wealthy. It touches on it in some exposition, but there was much more that was just glossed over. \r\n\r\nIn addition, W'Kabi became radicalized by Killmonger much too quickly for such a pivotal relationship to flip. Some of the emotional aspects of the movie fell flat because they weren't given enough screen time. \r\n\r\nDespite its flaws, Black Panther is a fun movie that adds to the Marvel Cinematic Universe. It should have been two movies, but I doubt this is the last we'll see of Wakanda.", "id": "5af0b71092514119a6000099", "url": "https://www.themoviedb.org/review/5af0b71092514119a6000099"}, {"author": "DanDare", "content": "The character of T'Challa made his debut in Captain America 3: Civil War.\r\n\r\nIn Black Panther, T'Challa returns to his homeland of Wakanda after the death of his father who has been hiding a secret about his brother who lived in the USA. He now inherits the throne after a challenge from a rival.\r\n\r\nWakanda is an african country with wealth, power and immense technology that it hides from the outside world.\r\n\r\nT'Challa's uncle wanted an uprising in the USA. Now his son Killmonger comes to Wakanda and challenges T'Challa for the throne.\r\n\r\nKillmonger wins and leads the struggle for black power.\r\n\r\nBlack Panther is a well made efficient film from Marvel who really have nailed down their formula. The box office avalanche has surprised me. It simply is not that good with a very predictable story.", "id": "5b0e0e66c3a368714d000179", "url": "https://www.themoviedb.org/review/5b0e0e66c3a368714d000179"}, {"author": "Wuchak", "content": "Overrated due to political correctness; it’s noble and has its points of interest, but it’s also kinda meh\r\n\t\r\nRELEASED IN 2018 and directed by Ryan Coogler, \"Black Panther” details events when T’Challa (Chadwick Boseman) takes over kingship of the hidden African nation Wakanda after his father passes (John Kani). The kingdom is technologically advanced due to its secret resource Vibranium, a priceless, almost magical metal. Unfortunately, T’Challa’s reign is challenged by an angry American former-black ops soldier, Erik “Killmonger” (Michael B. Jordan).\r\n\r\nWith its black director and mostly black cast (with a couple of token white dudes), “Black Panther” was overhyped and overrated upon release. Critics were apparently afraid of being called “racist” by liberal fascists if they dared to be honest and say anything negative (rolling my eyes). The movie’s likable and certainly has its points of interest, but the characters are rather dull, except for Killmonger, and the story isn’t all that involving. It’s basically a mediocre superhero movie that has some blatant Bond-isms and is set apart by its primarily black cast and African locale. It fails to rise to the entertainment level of even “Ant-Man” (2015).\r\n\r\nStill, it’s respectfully noble and the story provokes interesting questions, like isolationism vs. internationalism and African-American culture vs. Native African culture. But there’s some eye-rolling bits, like when Shuri (Letitia Wright) calls CIA agent Ross (Martin Freeman) a “colonizer,” which isn’t even accurate. Maybe it was supposed to be a joke.\r\n\r\nThe waterfall fight between the Black Panther and Killmonger was an homage to the first issue of The Black Panther series in Jungle Action: Issue #6, September, 1973. At the end of that comic’s story T'Challa and Erik fight at the top of a waterfall culminating with Killmonger throwing Black Panther over the cliff. This issue was the beginning of the \"Panther's Rage\" storyline by Don McGregor (featuring artists Billy Graham, Rich Buckler and Gil Kane), which ran for over two years in 13 issues of Jungle Action #6-18 and 209 pages, including the Epilogue. Many consider it the first graphic novel. Of course, this wasn't the first appearance of the Black Panther (who debuted in 1966), but it was the first issue where he was the starring character. \r\n\r\nAnd it was this series that provided the intriguing exposition on T’Challa, Wakanda and its citizens, visitors & enemies. It’s a travesty that McGregor, who created the characters of Killmonger & W’Kabi (Daniel Kaluuya) and conceived this exposition, wasn’t acknowledged in this movie; shameful.\r\n\r\nTHE FILM RUNS 2 hours, 14 minutes and was shot in Georgia (Atlanta, Fayetteville), South Korea (Busan) and Iguazú Waterfalls, Argentina. Ironically, nothing was shot in Africa. WRITERS: Coogler and Joe Robert Cole (and, uncredited, Don McGregor).\r\n\r\nGRADE: B-", "id": "5b2039f8c3a36814900052f3", "url": "https://www.themoviedb.org/review/5b2039f8c3a36814900052f3"}, {"author": "trinistud1", "content": "Awesome movie", "id": "5b804c62c3a3687e19012e25", "url": "https://www.themoviedb.org/review/5b804c62c3a3687e19012e25"}], "total_pages": 1, "total_results": 10}, {"id": 530442, "page": 1, "results": [], "total_pages": 0, "total_results": 0}, {"id": 353081, "page": 1, "results": [{"author": "TopKek", "content": "Some things age like fine wine and in the cinematic world the ‘Mission: Impossible’ franchise is a great example of the adage. Perhaps it has to do with the 56-year-old Tom Cruise who defies age and pushes his physical boundaries for our viewing pleasure? The answer is quite evident in ‘Fallout’ as his Ethan Hunt is as good as a caped superhero in the sixth film of the series. The story isn't all that new with its twists and turns. But ‘Fallout’ manages to build on the previous films in the series by bringing back old friends and foes, besides adding some new ones. Henry Cavill as August Walker fits right into this universe as the hammer to the scalpel that is Ethan Hunt. His presence is looming enough to fill the entire screen whenever he appears. Simon Pegg takes on the status of a series regular alongside Ving Rhames, whose Benji and Luther respectively play more than just mere sidekicks as they add comic levity and heart. Alec Baldwin and Angela Bassett also make a mark in their brief appearances but watch out for impactful turns by Rebecca Ferguson and Michelle Monaghan along the way.\r\n\r\nWriter & Director Christopher McQuarrie allows each character to shine while building on their history with each other, thus making them endearing to the audience. This only serves to up the ante when they’re in danger. McQuarrie also lets the story breathe by bringing some calm before the storm hits. Which leads to the most crucial aspect of the series, and one that McQuarrie clearly excels at in this film – the action sequences. Not only are they meticulously planned; they are executed with precision, even when the fist fights are gritty and gruesome. Rob Hardy beautifully choreographs the camerawork following these intricate set-pieces, either allowing you to take in the expanse or bringing you up close and personal when required. This is paired with a soundtrack by Lorne Balfe that lends to the tension by giving the iconic ‘Mission Impossible’ theme a sinister sense of urgency.\r\n\r\nMcQuarrie has now directed two ‘Mission: Impossible’ films; his understanding of the franchise and its characters proves to be the secret weapon of the series. The fact that the stunts are largely done with practical effects featuring the cast, and most prominently Cruise himself, sets a whole new standard for action films. ‘Mission: Impossible – Fallout’ is a great mix of plot, pacing and performances that is undeniably the best entry in the franchise, while it re-establishes Cruise’s status as an action superstar.\r\n\r\nReview by Times of India (TOI)\r\nFinal Rating - 4.0/5", "id": "5b5b3d24c3a368670c015b12", "url": "https://www.themoviedb.org/review/5b5b3d24c3a368670c015b12"}, {"author": "DanDare", "content": "Mission Impossible - Fallout is a continuation of Mission Impossible - Rogue Nation. It is directed by Christopher McQuarrie who also directed Rogue Nation and also has the return of the psycho villain Solomon Lane (Sean Harris) who the bad guys want to set free.\r\n\r\nEthan Hunt (Tom Cruise) is after the mysterious John Lark and a terrorist group called the Apostles who have stolen three plutonium grade devices and plan to set them off.\r\n\r\nHunt has to reluctantly accept a new team member. CIA operative August Walker (Henry Cavill) because the IMF team were responsible for losing the plutonium in Berlin.\r\n\r\nAs a spy thriller there is enough tension, thrills and a serpentine story with several twists.\r\n\r\nHowever the film is overlong and I felt that some of the action scenes consisted of myriad chase scenes that were stylishly done but nothing really memorable liked the Burj Khalifa climbing scene.", "id": "5b5bb15dc3a368421b00811d", "url": "https://www.themoviedb.org/review/5b5bb15dc3a368421b00811d"}, {"author": "logan1201", "content": "Excellent story line with tremendous stunts by Tom Cruise himself. This movie is worth every penny that you spend.", "id": "5b74cdbb9251411d9100612a", "url": "https://www.themoviedb.org/review/5b74cdbb9251411d9100612a"}], "total_pages": 1, "total_results": 3}, {"id": 400155, "page": 1, "results": [], "total_pages": 0, "total_results": 0}, {"id": 238636, "page": 1, "results": [{"author": "Gimly", "content": "When _The Purge_ was announced, it was a hugely promising premise, that ended up being wasted in nothing more than an answer to the horror movie question of \"why don't they just call the cops?\".\r\n\r\n_Anarchy_, however, delivers on that promise.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._", "id": "5831958d92514162cb024b14", "url": "https://www.themoviedb.org/review/5831958d92514162cb024b14"}, {"author": "mattwilde123", "content": "Inevitable sequel. Good idea though. It was interesting to see the poor deal with the night of terror this time. The acting wasn't great nor was it great the first time though. The first film did have a few good actors though. And the jump scares failed most of the time.\r\n\r\nThe last thirty minutes reminded me of the satirical class dividing futures of 'Black Mirror', ' Hostel' and 'The Hunger Games' but it lacked the interesting writing.\r\n\r\n★★½", "id": "58c17308c3a368263d00a5b7", "url": "https://www.themoviedb.org/review/58c17308c3a368263d00a5b7"}, {"author": "inaneswine", "content": "A total mess of a film. It clearly tries to expand on the bigger picture that we missed out on last time - but the fact is that past the initial frightening idea, _The Purge: Anarchy_ is an exercise in mindless bloodshed (as is the eponymous Purge itself), and lacks emotional depth or a coherent story.", "id": "5a12ebb9c3a368628f06c530", "url": "https://www.themoviedb.org/review/5a12ebb9c3a368628f06c530"}], "total_pages": 1, "total_results": 3}, {"id": 284053, "page": 1, "results": [{"author": "Gimly", "content": "_Ragnarok_ is a tough one to review completely without spoiler, so I'll keep this brief:\r\n\r\n* I was bothered by a small number of things that happened in this movie.\r\n* I was in love with a large number of things that happened in this movie.\r\n* _Thor: Ragnarok_ is not the MCU's best movie.\r\n* _Thor: Ragnarok_ is the MCU's most fun movie.\r\n* Can we **please** have a worldwide ban on putting anything that happens in the third act of your movie, in said movie's trailers?\r\nThank you for your time. 4 stars.\r\n\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._", "id": "59f09b979251416ac10169f7", "url": "https://www.themoviedb.org/review/59f09b979251416ac10169f7"}, {"author": "Movie Queen41", "content": "The Best CBM movie of 2017\r\n\r\nThe film is one of the most entertaining of the MCU films so far and a HUGE improvement over Thor: The Dark World. Cate Blanchett as the villainess Hela, the Goddess of Death, is a far better villain that TDW's lame Malekith. Kat Dennings' annoying Darcy and Natalie Portman's bland Jane are not missed at all. Instead, we get Tessa Thompson's badass Valkyrie, who can hold her own in a fight and isn't just there just as a love interest for Thor (Chris Hemsworth). Jeff Goldblum is hilarious as Grandmaster, who runs the gladiator fights on the planet Sakaar. But the real pleasure of the movie is watching the love-hate brother relationship between Thor and his adoptive brother, Loki (Tom Hiddleston). The relationship between the two men was the only redeeming feature of TDW, and it's great to see it expanded in this movie. Also great is seeing Thor buddy up with Bruce Banner/ Hulk (Mark Ruffalo). The only thing I didn't like about the movie was the fate of The Warriors Three. They deserved better than that. But otherwise, it's a great comic book movie.", "id": "5a08bdccc3a368672a006056", "url": "https://www.themoviedb.org/review/5a08bdccc3a368672a006056"}], "total_pages": 1, "total_results": 2}, {"id": 118340, "page": 1, "results": [{"author": "Binawoo", "content": "This movie was so AWESOME! I loved it all and i had a bad day before watching it but it turned it around. I love action packed movies and this was great.", "id": "53f11b7c0e0a2675b8004053", "url": "https://www.themoviedb.org/review/53f11b7c0e0a2675b8004053"}, {"author": "Andres Gomez", "content": "Really funny and with great spcial effects. Probably, one of the movies not to miss this year.", "id": "53f11c0b0e0a2675ac003e7d", "url": "https://www.themoviedb.org/review/53f11c0b0e0a2675ac003e7d"}, {"author": "Eazyryda", "content": "I ΛM GЯӨӨƬ!", "id": "53fafb790e0a267a7b006e20", "url": "https://www.themoviedb.org/review/53fafb790e0a267a7b006e20"}, {"author": "Grant English", "content": "This was a pleasant surprise of a movie, full of great humor as well as an intriguing story.  It's quick and zany at times.  Think <em>Psych</em> in space (back when Psych was funny).  The pace is quick and the story line is easy to pick up and follow.\r\n\r\nWhat makes the film work is something that early Lucas and Joss Whedon understand:  great sci-fi movies are really westerns at heart.  There is a relationship with nature, a broken, compromised hero, a deep necessity for teamwork, and the story happens OUT there in the wild.  <em>Guardians of the Galaxy</em> has ALL of this.  \r\n\r\n<em>Guardians</em> is already set up for a sequel so we will see if Marvel can continue the magic.  It's a great addition to the Marvel universe.", "id": "5459072dc3a36839ac001d55", "url": "https://www.themoviedb.org/review/5459072dc3a36839ac001d55"}, {"author": "Travis Bell", "content": "Like most of the reviews here, I agree that Guardians of the Galaxy was an absolute hoot. Guardians never takes itself too seriously which makes this movie a whole lot of fun.\r\n\r\nThe cast was perfectly chosen and even though two of the main five were CG, knowing who voiced and acted alongside them completely filled out these characters.\r\n\r\nGuardians of the Galaxy is one of those rare complete audience pleasers. Good fun for everyone!", "id": "5488c29bc3a3686f4a00004a", "url": "https://www.themoviedb.org/review/5488c29bc3a3686f4a00004a"}, {"author": "djgri", "content": "The thing about this film when I first saw it, was the incredible juxtaposition of sadness, humor and courage. Great acting! The music is superb. That Sony Walkman must be the best bit of brand advertising ever engaged by a company within a film. The film should appeal to a broad range of viewers.", "id": "59052a58c3a3684ab401343c", "url": "https://www.themoviedb.org/review/59052a58c3a3684ab401343c"}, {"author": "Per Gunnar Jonsson", "content": "This movie is more of a comedy than anything else. It is truly a comic magazine brought to life on the big screen and more focused on delivering a sequence of action scenes and laughs than anything intelligent in the form of plot or characters. I would say it is a movie for the younger audience and comic fans. Having said that I must admit that I found it rather fun to watch.\r\n\r\nThe main characters are two mostly irresponsible rascals, one dumb but likable living tree and two fanatics of which one certainly need not apply to the Mensa club. Of the five I liked Rocket and Gamora the best. Rocket is a rather likable rascal and Gamora is simply cool. Quill is sometimes just silly, Groot is more of a living prop and Drax is just too stupid.\r\n\r\nThe story is more or less just there to tie the scenes together. Unfortunately we do really not get much of a background to the Guardians of The Galaxy universe. It would have been nice to get a bit more understanding of why things are as they are etc. The return of this movie is watching the action, the special effects and the laughs. It is an action-adventure-comedy plain and simple. If you approach it as such it works reasonably well.\r\n\r\nSpeaking of special effects, they are generally well done. The designs are interesting. The shape of the bad guys spaceship is totally ludicrous of course but visually pleasing and goes with the rest of the movie’s tendency to be more of a comedy than a serious movie. The same can be said for that cool but weird net they made by interlinking fighter crafts.\r\n\r\nOn the whole an entertaining movie. I have to say that the dancing scene at the end was a wee bit too silly for me though. I have a problem understanding how a movie like this can get such a relatively high rating at IMDb but okay it was fun to watch and it is not entirely undeserved. Personally I think a 7 out of 10 is more in the right region.\r\n\r\nSHARE THIS:", "id": "5a62d0e59251410b1a005f0e", "url": "https://www.themoviedb.org/review/5a62d0e59251410b1a005f0e"}, {"author": "Gimly", "content": "**A long form review originally posted n 2014:**\r\n\r\nNow that I’ve given _Guardians_ a BluRay watch through, I feel more comfortable reviewing it. I saw it on the first day of its Australian cinematic release, but I wasn’t sure what I thought. I watched it again and still wasn’t sure, but now that it’s six months later, I am sure.\r\n\r\nI’m a massive fan of director James Gunn. Come to think of it, I’m also also a big fan of Lee Pace, Michael Rooker, Chris Pratt, Benicio Del Toro, Djimon Honsou, Bradley Cooper, Vin Diesel, Peter Serafinowicz, Alexis Denisof, Rob Zombie and Nathan Fillion, and they’re all in this. Not to mention I’m an absolute sucker for the MCU. So after hearing that a very decent chunk of the fanbase thinking that not only was this the best Marvel film of the year (going up against _Winter Soldier_ and _Days of Future Past_), but that they would then go on to say it was the best Marvel Cinematic Universe film ever, you could imagine I was very surprised to find that I actually didn’t think it was all that great.\r\n\r\nI don’t want people thinking I didn’t like it. I did. In fact I will go on record saying that it was miles away from their worst film, and if I’m being honest they handled the last 25 minutes (arguably the most important part) of the film absolutely spectacularly. But I didn’t get the magic that everyone was telling me about. How this was the film for the new generation.  I didn’t even get the sense of satisfaction that I had in Cap’s movie just a few months previous.\r\n\r\nSo many things seemed under utilised, but I don’t know what you could have cut to make room for the extra things I wanted. Which means the only way to get it is to have a longer film. It’s already two hours, and a longer movie means a bigger budget and less screenings. ie. more money going out and less money coming in. And at the end of the day Disney is a business, and they have to make their money the best way they think they can. So I understand why it wasn’t perfect for me, but that doesn’t stop me from feeling _Guardians_ is a mite overrated. Good damn movie. But overrated.\r\n\r\nPersonally I’d stick it somewhere in the middle of the MCU’s releases thus far. Leaps and bounds above _The Incredible Hulk_, _The Dark World_ and _Iron Man 2_, but not so beloved as the likes of _The Avengers_, _Winter Soldier_ or _Iron Man 1_.\r\n\r\n73%\r\n\r\n-_Gimly_", "id": "5b1676510e0a262de801570b", "url": "https://www.themoviedb.org/review/5b1676510e0a262de801570b"}], "total_pages": 1, "total_results": 8}, {"id": 177677, "page": 1, "results": [{"author": "leros", "content": "good!", "id": "55da46c8c3a36831f6005a5e", "url": "https://www.themoviedb.org/review/55da46c8c3a36831f6005a5e"}, {"author": "Frank Ochieng", "content": "Some over-stuffed blockbuster actioners boldly boast their explosive and invigorating productions with dynamic glee. Well, the ‘Mission: Impossible’ film franchise echoes this same sentiment, with flashy fifty-something star Tom Cruise still carrying that boyish exuberance that never seems to miss a beat, and can breathe a sigh of relief because the latest chapter will not disappoint in its adventurous, adrenaline-rushing skin. Yes, Cruise is back as IMF super spy stud Ethan Hunt in writer-director Christopher McQuarrie’s power-surging ‘Mission: Impossible-Rogue Nation’. Notoriously slick, ambitious, wildly impish and vastly intriguing, ‘Rogue Nation’ incorporates superb direction, writing and, of course, its no-nonsense dosage of non-stop shenanigans to fuel the audience’s escapist palates.\r\n\r\nIn actuality, ‘Rogue Nation’ is a hyper and hip throwback to the original blueprint for this kinetic movie series that took viewers by storm when it first premiered back in 1996. The minor outcry for the box office sensation that was the ‘Mission: Impossible’ big screen offering back in the late 90s was quite understandable since it did not seem to stay entirely true to the iconic 60s television series thus being dismissed as a volt-driven vanity piece for the high-strutting Cruise. Still, the cinematic ‘Mission: Impossible’ experience did not peter out but steadily built a devoted fan base that wanted to endure the high-flying hedonism of Cruise’s espionage daredevil Hunt and his band of cunning cohorts. It is definitely safe to say that the stellar ‘Mission: Impossible-Rogue Nation’ has delivered a bang for its buck in a summertime cinema hunger that thrives for such sleek, innovative spy thrillers that charm more than harm. Maybe ‘Rogue Nation’ will not let anyone forget the exploits of the legendary James Bond spy capers anytime soon but hey…Cruise’s hotshot Hunt has a colorfully distinctive way of promoting his ‘shaken, not stirred’ moments as well.\r\n\r\nSo how did the collaboration of filmmaker McQuarrie and his chance-taking lead Cruise give ‘Rogue Nation’ its deliciously sinister, overactive pulse? The fact that the overzealous stuntwork (much of it performed by Cruise with daring enthusiasm) is imaginative and the story feels smart and clever certainly has a lot to do with the magnetic appeal of ‘Rogue Nation’. Hey, the TV advertisements even give a generous peek into the pulsating platitudes that the MI universe will swallow with robust anticipation. Watch IMF agent Hunt hang on to a speedy airplane with his dear life in the balance. Watch IMF agent Hunt jump into a deadly spiral of a waterfall. Watch IMF agent Hunt race a piercingly fast motorcycle (or car…take your pick) and enjoy the road raging carnage with poetic prominence. Okay…you get the picture.\r\n\r\nThe premise in ‘Mission: Impossible-Rogue Nation’ has more bounce to it than a basketball during the NBA playoffs and that is not necessarily a bad thing to note. While Hunt continues his mission to stop the team’s latest despicable foe (Sean Harris) and end the operation of the insidious operation known as the Syndicate there are feathers being ruffled because of the federalised threats to shut down the IMF empire through the suggestion of a top-notch CIA director (Alec Baldwin). Naturally, IMF head honcho Brandt (Jeremy Renner) tries to prevent such hasty actions as his team of agents must overcome some of the controversy and confrontations from previous disastrous events that have warranted the threatening hints to shutdown his governmental outfit.\r\n\r\nCruise's Agent Ethan Hunt is leaving on a jet plane and doesn't know how long he'll be back again in the eye-popping actioner MISSION: IMPOSSIBLE-ROGUE NATION.\r\nCruise’s Agent Ethan Hunt is leaving on a jet plane and doesn’t know how long he’ll be back again in the eye-popping actioner MISSION: IMPOSSIBLE-ROGUE NATION.\r\nOne cannot say enough about the ponderous yet action-packed ‘Rogue Nation’ as this exceedingly spry and hyperactive spy caper keeps one on their anxious feet while never letting up for a gasp of air. The exotic locales, showy opera houses, heart-pounding action sequences, innovative chase scenes on wheels, over-the-top baddies, well-choreographed fist fights and, of course, Cruise’s roguish Hunt and his willingness to soak up the mischievousness and mayhem of the proceedings allows this particular ‘Mission: Impossible’ installment to resonate so soundly in its off-kilter, energetic greatness. The supporting players such as Simon Pegg’s Benji and Ving Rhames’s Luther are on hand to contribute to the landscape of the triumphant cloak-and-dagger goings-on. In particular, Rebecca Ferguson is the transfixing tart whose presence as Cruise’s enigmatic female lead is easily a scene stealer. Can she be trusted or not? Who cares? In the long run, Ferguson’s inclusion is almost mandatory just to spice up this first-rate popcorn pleaser a tad bit more. Tom Hollander (‘In the Loop’) adds some flavor in the mix as the unpredictable British Prime Minister.\r\n\r\nMcQuarrie (who worked with Cruise previously on ‘Jack Reacher’ and helmed ‘The Way Of The Gun’) had a tough act to follow in terms of trying to keep stride with prior ‘Mission: Impossible’ big names in auteurs Brian De Palma, John Woo, J.J. Abrams and Brad Bird. Indeed, that is a tall order to fill. However, as the Oscar-winner screenwriter for ‘The Usual Suspects’ McQuarrie has shown that his take on the fifth edition of the ‘Mission: Impossible’ film franchise with ‘Rogue Nation’ can easily be as defiant and defining as any of his predecessors’ intense, eye-popping outings.\r\n\r\n‘Mission: Impossible-Rogue Nation’, with its lavish set pieces and sophisticated sense of winding and grinding with the twitchy antics of Cruise leading the pack, is perhaps the closest thing to resembling the elegance and excellence of the indomitable Agent 007.\r\n\r\nMission: Impossible-Rogue Nation (2015)\r\n\r\nParamount Pictures\r\n\r\n2 hrs. 12 mins.\r\n\r\nStarring: Tom Cruise, Simon Pegg, Jeremy Renner, Ving Rhames, Sean Harris, Rebecca Ferguson, Tom Hollander, Simon McBurney and Zang Jingchu\r\n\r\nDirected and Written by: Christopher McQuarrie\r\n\r\nRating: PG-13\r\n\r\nGenre: Spy Thriller/Action-Adventure/Intrigue and Espionage\r\n\r\nCritic’s Rating: *** 1/2 stars (out of 4 stars)", "id": "56207f7092514171d4006ad6", "url": "https://www.themoviedb.org/review/56207f7092514171d4006ad6"}, {"author": "Andres Gomez", "content": "Everything you can expect from a \"Mission: Impossible\" movie. The script is not the brightest nor the freshest but works OK. Cruise, Pegg and Rhames keep the franchise afloat while Renner and Baldwin feel unneeded.\r\n\r\nGreat addition with Ferguson. She takes most of the attention in this movie.\r\n\r\nGood work from the direction.", "id": "568244c6c3a36828f5008ff1", "url": "https://www.themoviedb.org/review/568244c6c3a36828f5008ff1"}, {"author": "Gimly", "content": "So after all that, I’m pretty convinced that the _Mission: Impossible_ series just isn’t for me. That being said, how many film franchises can say that their fifth instalment was also their best? Probably just this one, and, maybe _Fast & Furious_. There’s actually a lot of parallels between those two lines of movies. \r\n\r\nPertaining specifically to _Mission: Impossible_ though, this one truly is the best of the bunch in my opinion. It has it’s most complete female role to date, in fact, you could say that of any character. This is the first film that doesn’t feel like it entirely hinges on Ethan Hunt’s input. The characters surrounding him are actual people with their own personalities and ideas. And maybe it’s just that I’ve watched him do it five times in the past three days, but honestly I even sort of bought Tom Cruise in an action role this time around. \r\n\r\nCrazy.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._", "id": "57b40f23c3a368184a001bd9", "url": "https://www.themoviedb.org/review/57b40f23c3a368184a001bd9"}], "total_pages": 1, "total_results": 4}]