[
    {
        "id": 419704,
        "page": 1,
        "results": [
            {
                "author": "SWITCH.",
                "content": "‘Ad Astra’ is about as art house as Hollywood cinema gets; disguising a metaphysical drama as an action-packed sci-fi adventure is a clever move for James Gray. While not perfect, it’s consistently entertaining whilst offering an introspective investigation on how parents influence their children. While a journey to the outer realms of our solar system, ‘Ad Astra’ is also an exploration of the human heart.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-ad-astra-a-luscious-and-meticulous-space-drama",
                "id": "5d7f61efc54304001096a5ef",
                "url": "https://www.themoviedb.org/review/5d7f61efc54304001096a5ef"
            },
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nI love sci-fi space movies, especially when these depict the cosmos in such a visually stunning manner as Ad Astra does. It’s one of those films where the visuals elevate whatever narrative is being told. If you don’t get goosebumps or get excited with the opening sequence of this movie, then it might not be the film you’re looking for. From the quiet but powerful sound design to the impressive cinematography, James Gray delivers a visually captivating story with an outstanding protagonist. Brad Pitt is definitely getting tons of nominations this awards season (let’s not forget his amazing role in Once Upon a Time in Hollywood).\r\n\r\nHis subtle yet incredibly emotional performance shows an astonishing range. He carries the whole screenplay in his shoulders, and I don’t mind that at all. There’s a lot of narration, and here’s where I transition to the most divisive aspect of the movie: it’s a slow-burn. Now, there’s no problem with a film being deliberately slow. In fact, some of my favorite movies of all-time aren’t fast-paced. They cherish their story and make the audience feel interested in what they’re experiencing. Ad Astra isn’t an action flick or a comedy, it’s a character-driven drama, so most of the runtime is devoted to developing Roy.\r\n\r\nThat said, don’t go in with expectations of feeling entertained all the time. Some moments aren’t supposed to excite you or leave you jaw-dropped. Some sequences are just meant to make you feel immersed by the environment, be lost in space (IMAX is the mandatory way of watching this feature). Don’t expect the film to make an 80-day trip to some planet end in two cuts and 20 seconds. Gray purposefully establishes a slow pace. Obviously, general audiences don’t usually enjoy this type of flicks, but if you’re able to manage your expectations realistically, you’re one step closer to not feel bored throughout the runtime.\r\n\r\nThe first act is the one that captures everyone’s attention. It doesn’t waste time on Earth, it goes through what’s happening pretty quickly, and it possesses 90% of the heavy action (including one of the best opening sequences of the year). Sound has a significant impact on how Gray films his sequences, and it’s unbelievable how well-shot the chasing scenes on the Moon are. Scientifically speaking, this is no Interstellar where you simply have to accept some mind-blowing yet unjustified stuff. Ad Astra doesn’t have a single scene where one might think “this completely takes me out of the movie, I can’t accept that this is possible in some fictional future”. This is a huge compliment to a space film containing several launches, lunar bases, and (very) long space journeys.\r\n\r\nHowever, the remaining two acts focus intensely on Pitt’s character, slowing down the main plot. Like I wrote above, there’s a lot of development through Roy’s thoughts. Extensive narration is almost always an issue, even when the narrator is Brad Pitt. Some monologues do indeed develop the character or explain what he’s feeling, but some tend to fall into the philosophical side that doesn’t always carry a meaningful or interesting message. Using everyday language, sometimes it’s a bit boring… Additionally, the ending might be a letdown for a lot of people. Tommy Lee Jones (H. Clifford McBride) doesn’t have a lot of screentime, and I can’t really delve into details about his storyline, but his character’s relationship with Roy doesn’t exactly serve as a fantastic payoff.\r\n\r\nMax Richter’s score is one of 2019’s best, and I hope it gets recognized by every award show. It definitely helps the experience to be more enthralling. The lack of sound in space is also powerful in its own way. Beautifully-edited, but with a continuously slow pace that doesn’t change from the moment the second act begins. However, the story of Ad Astra is vastly superior to, for example, Gray’s The Lost City of Z, which I genuinely disliked. This space adventure is visually more exciting, its story is more engaging, and its protagonist is more compelling than everything else in Gray’s previous installment. Finally, it’s one of those movies that watching at a film theater (mainly IMAX) or at home, makes a massive difference. You’ll never feel as entertained or captivated at home, so make sure to check this one at the best possible screen near you.\r\n\r\nAll in all, Ad Astra is yet another display case for Brad Pitt’s chances at winning an Oscar. With a subtle yet powerful performance, Pitt carries the whole story to safe harbor with tremendous help from the eyegasmic visuals. Technically, it’s one of 2019’s closest movies to being perfect. Very well-shot, well-edited, with an immersive score, and gorgeous cinematography. However, it’s a slow-burn that doesn’t always work as such. Narration is the go-to method to develop Pitt’s character, and while it works most of the time, it slows down the main plot, becoming a tad boring during a few moments. The ending isn’t the impactful payoff that the film needed, and the incredible supporting cast is under-utilized. In the end, it’s still a great movie and one that should be seen at the biggest and best screen possible, so go see it for yourself!\r\n\r\nRating: B+",
                "id": "5d8382069e458602269604e4",
                "url": "https://www.themoviedb.org/review/5d8382069e458602269604e4"
            },
            {
                "author": "Stephen Campbell",
                "content": "**_Despite some utterly absurd diversions (chase scene! horror scene! shoot-out scene!), this is a quality science-fiction narrative, suggesting the answers we seek in the stars are actually found within_**\r\n\r\n>_macte nova virtute, puer, sic itur ad astra,\r\ndis genite et geniture deos._\r\n\r\n- Publius Vergilius Maro; _Aeneis_ (29-19 BC)\r\n\r\n>_N = R∗ · fp · ne · fl · fi · fc · L_\r\n\r\n>_where:_\r\n\r\n>_N = The number of civilisations in the Milky Way whose electromagnetic emissions are detectable (i.e. which are on our current past light cone)._\r\n\r\n>_R∗ = The average rate of the formation of stars._\r\n\r\n>_fp = The fraction of stars with planetary systems._\r\n\r\n>_ne = The average number of planets, per star with planetary systems, with an environment suitable for life._\r\n\r\n>_fl = The fraction of planets with an environment suitable for life on which life actually appears._\r\n\r\n>_fi = The fraction of planets on which life actually appears on which intelligent life emerges._\r\n\r\n>_fc = The fraction of planets on which intelligent life emerges that develop a technology capable of releasing detectable signs of their existence into space._\r\n\r\n>_L = The length of time such intelligent life release detectable signals into space._\r\n\r\n- The Drake Equation; Frank Drake (1961)\r\n\r\n>In Drake's original hypothesis, the proposed values were:\r\n\r\n>R∗ = 1 yr−1 (1 star formed per year, a very conservative estimate)\r\n\r\n>fp = 0.2 to 0.5 (one fifth to one half of all stars formed will have planetary systems)\r\n\r\n>ne = 1 to 5 (stars with planetary systems will have between 1 and 5 planets with an environment suitable for life)\r\n\r\n>fl = 1 (100% of planets with an environment suitable for life will develop life)\r\n\r\n>fi = 1 (100% of planets which develop life will develop intelligent life)\r\n\r\n>fc = 0.1 to 0.2 (one tenth to one fifth of planets which develop intelligent life will develop life capable of releasing detectable signs of their existence into space)\r\n\r\n>L = 1,000 to 100,000,000 years\r\n\r\n>This gives N as a range between 20 and 50,000,000, although Drake asserted that, given the uncertainties involved, the more likely range was that N ≈ L, hence there are between 1,000 and 100,000,000 intelligent civilisations in the Milky Way with whom communication should be possible.\r\n\r\n>_We're searching for intelligent life-forms that have also evolved conscious self-awareness. We're searching for conscious, intelligent life-forms that have both the available resources and the need to manipulate raw materials into tools. We're searching for intelligent, conscious, tool-making beings that have developed a language we're capable of understanding. We're searching for intelligent conscious, tool-making, communicative beings that live in social groups (so they can reap the benefits of civilization) and that develop the tools of science and mathematics._\r\n\r\n>_We're searching for ourselves..._\r\n\r\n- Stephen Webb; _If the Universe Is Teeming with Aliens … Where Is Everybody?: Fifty Solutions to the Fermi Paradox and the Problem of Extraterrestrial Life_ (2002)\r\n\r\nA short while ago, Pella Kågerman and Hugo Lilja's mesmerising _Aniara_ (2018) pondered the insignificance of mankind when considered against the infinity of space and time. An esoteric science-fiction film in the tradition of Stanley Kubrick's _2001: A Space Odyssey_ (1968) and Andrei Tarkovsky's _Solyaris_ (1972), it attempted, amongst other things, to convey the sense of near-inconceivable vastness that must be attendant to any self-respecting pseudo-realist discussion of the universe, and to convey the psychological ramifications of what it must feel like to be lost in such a vastness. This is the lineage into which _Ad Astra_ wishes to step, but for me, it has more in common with Danny Boyle's excellent _Sunshine_ (2007) and Christoper Nolan's enjoyable but flawed _Interstellar_ (2014); irrespective of its themes and tropes, it remains fundamentally a mainstream Hollywood movie. And whilst such a status can certainly hold advantages for a filmmaker (primarily in terms of budget and casting), so too are there major pitfalls in having to toe the line of commerciality and cater to demands for crowd-pleasing material, demands which often don't jibe with esoteric content. In the case of _Sunshine_, this took the form of a relatively sudden genre shift into horror that Boyle doesn't fully pull off, and in the case of _Interstellar_, it's an unnecessary third-act twist that's (paradoxically) as predictable as it is nonsensical. And so we have _Ad Astra_, where it's in the form of an overly convenient resolution and some of the most ludicrous narrative diversions I've seen since the sojourn to Canto Bight in the Rian Johnson abomination that was _Star Wars: The Last Jedi_ (2017), diversions which seem to belong in a different film entirely, so tonally unrelated are they to the more existential material surrounding them (space pirates! enraged simians! knife-fight/shoot-out!). Which is not to say, for one second, that I disliked the film – I didn't; even if the narrative never manages to get beyond the \"_Heart of Darkness_ in space\" template and the script relies far, far too heavily on a sub-Terrence Malick voiceover. The craft on display is exceptional and the story is thought-provoking and generally entertaining, with a terrific central performance, and some spectacular visuals (especially in the IMAX format). But it all could have been so much better.\r\n\r\nSet at an unspecified point in the near future (an opening legend informs us, rather generically, that it's \"_a time of hope and conflict_\"), space travel has become routine, with the moon not unlike any major city on Earth, although there are territorial disputes and marauding pirates are a constant threat. Mars too has been colonised, although it's not yet open to the public. As the film begins, we meet SpaceCom's Maj. Roy McBride (Brad Pitt), who is working on repairs to the International Space Antenna – a massive communications array that juts miles into the sky from the surface of the Earth. When a huge explosion causes him to fall from the antenna, he remains unnaturally calm as he plummets to Earth, and is able to land relatively unscathed. In a debriefing, he's told the explosion was just one result of a series of energy surges that originated near Neptune and which have left much of Earth and the moon without power. 29 years previously, Roy's father, H. Clifford McBride (Tommy Lee Jones), left Earth as the leader of the Lima Project, a mission aimed at establishing contact with whatever alien civilisations may be elsewhere in the galaxy. Needing to get far enough from the Sun's solar interference to send out adequate communications, the Lima team travelled to the same region near Neptune from which the surges are now emanating. However, 16 years into the mission, all contact was lost. SpaceCom presumed the crew dead, but now they fear that Clifford may be behind the surges, and with an antimatter power core at his disposal, if he has become unhinged, he could create a chain reaction that would eradicate all life in the galaxy (it's best not to dwell too much on the script's fundamental misrepresentation of how matter and antimatter interact). However, all attempts at communication have failed, and so Roy's highly classified mission is simple – travel to a secure long-range communications base on Mars and record a (prewritten) message for Clifford in the hopes he might respond. And, of course, it's no spoiler to say that the mission doesn't exactly go smoothly.\r\n\r\n_Ad Astra_, which is written by James Gray and Ethan Gross, and directed by Gray (_The Yards_; _We Own the Night_; _The Immigrant_; _The Lost City of Z_), wastes no time in tying us rigidly to Roy's perspective; it opens with a POV shot from inside his helmet, and the first words we hear are him speaking in voiceover. This sets up the narrative to come, as Roy remains the sole focaliser throughout – we see and hear what he sees and hears, we know what he knows, we learn things as he learns then, and we never experience anything with which he is not directly involved. Such rigid focalisation can lend itself to some very subtle moments. For example, as Roy thinks back to a time before his marriage broke up, there is a shot of him sitting on a bed in a darkened room. Barely visible behind him, lying down, is his then-wife Eve (a thankless and largely wordless performance by a blink-and-you-miss-her Liv Tyler). As the camera moves in on him, Eve fades out of the image – she disappears without him noticing, which sounds like it should be horribly on the nose, but because it's dark, because she was out of focus to begin with, and because by the time she disappears, Roy has come to occupy almost the entire frame, it makes the moment easy to miss, and rather poignant – he quite literally doesn't notice his wife phasing herself out of his life because of his obsession with his career (his focus on work is something he shares with Percy Fawcett (Charlie Hunnam) in Gray's masterpiece, the criminally overlooked _Lost City of Z_, although to be fair to Fawcett, Roy's single-mindedness at the expense of all else makes Fawcett look like husband-of-the-year material).\r\n\r\nThe fact that the film is set amongst the stars, but remains always tied to Roy's perception allows Gray to fashion a narrative that's both massive in scope yet emotionally intimate (in this sense, he one-ups Kubrick, whose _2001_ has all the grandeur and awe imaginable but is relatively detached from and uninterested in its characters' psychologies). Gray is aided immensely in this by cinematographer Hoyte van Hoytema (_The Fighter_; _Her_; _Interstellar_; _Dunkirk_), arguably the finest currently active DoP not named Emmanuel Lubezki. Shot on 35mm film, van Hoytema's gorgeous photography effortlessly captures the overwhelming scale of the milieu, but also frequently shoots Pitt in tight close-ups that afford the actor little room to hide his emotions (which become more and more externalised as the film progresses).\r\n\r\nSpeaking of emotions, depending on your perspective, Pitt's portrayal of Roy is either one of the film's most laudable aspects or one of its most alienating. Initially played as emotionally closed off, if not necessarily shut down (he tells us in VO, \"_I've been trained to compartmentalise my emotions_\"), he's depicted as cold and distant. This stoicism, however, slowly starts to erode as his mission begins to go wrong, although there are a few early hints that all is not well - his fixation on the breakup of his marriage, for example, or his observation of the crew of the _Cepheus_ (which takes him from the moon to Mars), \"_they seem at ease with themselves. What must that be like?_\". His emotional state becomes more and more tempestuous as we move closer to the finale, until, rather suddenly (and rather unrealistically), he manages to steady himself in time for the _dénouement_. Pitt's performance is such that one viewer might praise it for shunning emotional grandstanding even as another might criticise it as too taciturn. Personally, I'm very much in the former camp; I think it's a terrifically modulated and minimalist performance in which Pitt uses the lack of outward emotion to inform the character's emotional beats. For example, Roy doesn't have a huge amount of dialogue (aside from that accursed VO) and for long stretches, he doesn't even have anyone to act against, so Pitt has to rely to a large extent on subtlety and nuanced gesture to convey emotion, which he does exceptionally well. Having said that, however, I can certainly understand why some might find the performance too cold – Roy is definitely not your typical Hollywood protagonist, and the problem is that if you're not impressed by Pitt, I'd imagine it must be very difficult to get into the film at all as he's in literally every scene.\r\n\r\nThematically, on the most basic of levels, _Ad Astra_ is the story of two men obsessed with their profession to the detriment of all else - a theme brought to perfection in the work of Michael Mann. Such a theme is not unusual in Gray's films, receiving its most thorough exploration in Percy Fawcett and Henry Costin (Robert Pattinson) in _The Lost City of Z_. Additionally, like most of Gray's films, _Ad Astra_ is heavily androcentric, with neither Liv Tyler nor Ruth Negga (as the administer of the SpaceCom base on Mars) given much to do. In this sense, it's a study of masculinity, much as were its most obvious narrative influences – Joseph Conrad's _Heart of Darkness_ (1899) and Francis Ford Coppola's Conrad-adaptation, _Apocalypse Now_ (1979). In the reformulation of the narrative template, Roy is Charles Marlow (Cpt. Benjamin L. Willard in the film), whilst Clifford is Kurtz. In the original, Marlow, a merchant seaman, must locate revered ivory trader Kurtz, who has established himself as a demigod at a trading post on the Congo River. In the film, set at the tail-end of the Vietnam War, US Army captain Willard (Martin Sheen) must travel from South Vietnam into Cambodia to track down Col. Walter E. Kurtz (Marlon Brando), a once-legendary but now renegade Army Special Forces officer who, in all probability, has gone insane. The narrative parallels are obvious enough – a conflicted man sent to find a brilliant and pioneering man who has gone off-grid and who must be stopped, with the journey proving to be as much about travelling into the self as reaching a specific geographical destination. All three narratives also feature a roughly similar relationship between the two characters whereby the man searching deeply admires the man for whom he is searching.\r\n\r\nOf course, _Ad Astra_ is also an esoteric science fiction film that looks at issues such as humanity's place in the galaxy and the search for intelligent life. An especially interesting theme that comes up when Roy is on the moon is commercialism and humanity's tendency to taint anything we touch. The commercialism of space travel is introduced when Roy takes a Virgin America shuttle to the moon, whilst an exterior wide shot of a lunar tourist base shows signs for, amongst others, Applebee's, DHL, and Subway. And since the moon is now so like Earth, thus it has become blighted by many of the same issues as Earth; crime, political division, materialism - the grandeur of space travel infected with the mundanities of Earth. This point is driven home by the references to territorial disputes and the problem of marauders, which is significant enough for Roy to need a military escort from the base to the _Cepheus_. And if all this wasn't enough to get the point across, in VO, we hear Roy lament how sickened Clifford would be with what the moon has become, pointing out it's now simply a \"_re-creation of what we're running from on Earth. We're world eaters_\". All of which helps create the impression of a future that's reasonably familiar and relatively plausible, given current technologies. Indeed, the lived-in nature of the film's environment is superbly realised by production designer Kevin Thompson (_Birth_; _The Adjustment Bureau_; _Okja_), whose discoloured sets and gritty textures are as far from the more glossy end of science fiction as you could imagine.\r\n\r\nHowever, for all these positives, some significant problems detract from the whole. For me, there were three main flaws; 1) a poorly written and hugely distracting voiceover upon which Gray relies far too heavily, 2) three ludicrous action scenes that accomplish nothing and which feel like they're from another movie entirely, and 3) an anti-climactic and overly neat dénouement.\r\n\r\nTo look first at those three scenes, although they all occur in the first half of the film (with two in the first act), to describe them in any detail would constitute a spoiler, so I'll just give a very basic overview – the first is a chase scene involving moon buggies, the second is something more suited to Paul W.S. Anderson's hugely underrated _Event Horizon_ (1997), and the third is a shoot-out/knife fight, which is the most narratively justified of the three, but still a ridiculously over-the-top scene for a film of this nature. Imagine if in _2001_, instead of attempting to outwit HAL 9000, Dave Bowman (Keir Dullea) had pulled out a shotgun and engaged in a running battle with androids controlled by the AI. Ridiculous? Of course. The three scenes in _Ad Astra_ are only slightly less so. The third at least does have a narrative point insofar as it serves as the springboard for the entire second half of the movie, but it's still a monumentally silly way for Gray and Gross to advance the plot when there were far more organic ways to do so. The first two scenes, however, serve no such purpose – remove them from the film, and you'd have to change virtually nothing in the surrounding material - they're that disconnected and irrelevant, right out of the Rian Johnson school of narrative construction. They lead nowhere, reveal nothing about the character or his psychology, and have no connection to the esoteric themes found elsewhere. You know the French plantation scene in _Apocalypse Now Redux_? They make that scene look pivotal. I really can't over-emphasise how much they pulled me out of the film and detracted from the excellent work elsewhere.\r\n\r\nAs for the other two issues (the VO and the ending), obviously, I can't say much of anything about the finale without spoilers, so all I'll say is that I'm led to believe the ending as it exists now was a reshoot after test audiences responded poorly to the original (and far superior) ending – look it up online; the originally scripted ending made a lot more sense and was as thematically fascinating as it was existentially audacious (sheesh, test audiences, am I right?). \r\n\r\nIn terms of the VO, good lord, it's bad. I can count on one hand the number of times VO has been done well in film – there's the hard-boiled noir films of the 40s and 50s, the Michael Herr-written narration of _Apocalypse Now_, the work of Terrence Malick, Andrew Dominick's _The Assassination of Jesse James by the Coward Robert Ford_ (2007), and...well, that's about it really. The VO is obviously intended to function in much the same way as Willard's in _Apocalypse Now_, providing some factual info, but also probing the soul of the character. However, the problem is that most of the time, the voice is describing something we can see plain as day on the screen. Pitt's performance is strong enough that the VO is unnecessary. You know the way the best films show rather than tell and the worst tell rather than show? _Ad Astra_ does both, and it's hugely distracting – you think \"_I don't know why he saved my life_\" ruins the end of the original version of Ridley Scott's _Blade Runner_ (1982)? I lost count of the number of times Roy's derivative interior monologue undermined the power of the moment. By the half-way stage of the film, I was sick of his cod-philosophical ramblings that aspire to portentousness, but end up coming across as someone trying and failing to imitate Malick.\r\n\r\nWith all that said, however, it's a testament to the story the film tells that despite these significant hurdles, I still enjoyed it. Pitt's performance is excellent, and Gray, who has yet to make a bad film, is his accomplished self. The storyline is interesting, and what it says about man's place in the universe, particularly whether or not we're alone, is unexpected and fascinating. The original ending was infinitely superior, the VO is a huge misstep, and the action detours are ludicrous, but this is still an entertaining movie. It's not a patch on _Lost City of Z_, but the manner in which Gray juxtaposes an intimate tone with such massive themes is really impressive. In essence, _Ad Astra_ is a fable about the importance of transient human connection, played out against the backdrop of the infinite, and despite some not insignificant problems, it's well worth checking out.",
                "id": "5d9e02057f05400037ab4d04",
                "url": "https://www.themoviedb.org/review/5d9e02057f05400037ab4d04"
            },
            {
                "author": "Gimly",
                "content": "I like quiet moments in big action/sci-fi type movies. The family sitdown at Avengers Tower in _Age of Ultron_ is probably the best part of that movie. The contemplative moments of John Wick are what make that character who he is. What is a little more odd, however, is when a quiet, reflective drama, is broken up by moments of big action/sci-fi type sequences. _Ad Astra_ is certainly the latter. The majority of _Ad Astra's_ runtime is taken up by Brad Pitt narrating environmental cosmic shots, or having quiet conversations about his father, or his mood. Then suddenly! Space pirates! It's unusual, and I don't know that it really works. _Ad Astra_ is something different, and if that's all you're looking for, by all means, give it a chance, but I don't know if I'd personally call it very good. \r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._",
                "id": "5e083f7aeda4b700142e147f",
                "url": "https://www.themoviedb.org/review/5e083f7aeda4b700142e147f"
            },
            {
                "author": "The Movie Diorama",
                "content": "Ad Astra galactically depicts sorrow, proving that no one can hear you cry in space. For the past few years, dramas set in the expansive dangers of space have been my bread and butter. Devouring them during my annual breakfast as I purposefully starve myself for the taste of space traversal. Every year, the likes 'Arrival', 'Blade Runner 2049', 'First Man', 'Interstellar' and my all-time favourite film 'Gravity', have secured scores ranging from outstanding to perfect. Whilst Ad Astra may be tilting towards the former adjective, it's still irrefutably one of the best films of the year thanks to Gray's understanding, yet again, of what makes a character study captivating. After unearthing the possibility that his missing father may still be alive, his astronaut son travels across the Solar System in search for him and to unravel a mysterious power surge phenomenon that threatens humanity's survival.\r\n\r\nImmediately, one thing I need to brush off my chest is the horrendous marketing. This is not a sci-fi blockbuster. There is limited \"action\". And if you're wanting the next 'Star Wars' or 'Avatar', then remove yourself from the cinema and watch mind-numbing nonsense like 'Angel Has Fallen' instead. This is a James Gray extravaganza. A meticulously woven character study, harnessing melancholia to challenge an existential crisis. Thematically, Ad Astra's premise bolsters a plethora of metaphorical imagery that divulges into the empirical purpose of humanity. Majestic planets emitting every prismatic shade available, yet emanating no emotional connectivity. The vacuous expansivity of space, marking humanity's reflection on life as a mere speck of stardust. Worldly hostility reaching the depths of our galaxy, hyperbolising the \"world-eating\" philosophy of our own self-destruction as a species. The obsession to venture forth. Departing love, hate and grief. Welcoming nothingness.\r\n\r\nGray's space-opera is a sorrowful tale, intently focusing on the pressures of a son following in the footsteps of his acclaimed father. A patriarch of inspiration to many. Allowing a tangible tense bond to illuminate the stars with despair and anguish. Pitt's universally nuanced performance brings forward stoic mannerisms that allow McBride to feel these emotions. Minor glitches that break character, such as slamming the wall in frustration, showcase the purity of humanity within him.\r\n\r\nGray encompasses the plot around McBride. The lunar pirate raid, mayday rescue and crew brawl scenes, whilst inserting mainstream tendencies into a contemporary drama, were emblems of McBride's emotions. Fear, rage and desperation respectively. A series of gestures that, again, hark back to humanity's endurance. The mildly engaging supporting cast, ranging from Jones, Sutherland and Negga, acting as stability for McBride. Stepping stones allowing him to find his father, as if fate was dictating his alignment. Narration, shifting between inner thoughts to exposition, was overused and irked me with its basic functionality. Hoytema's cinematography could've elicited these unnecessary lines of dialogue from his beautiful imagery. And beautiful just doesn't do it justice.\r\n\r\nImmediately, from the iridescent opening shot, Hoytema takes hold. Utilising colours and shadows to produce the incarnation of life, what it means to see. The blue of Neptune, the red of Mars. Clashing tonalities resembling McBride's emotions. Accompanied by Richter's euphoric score and the almost '2001' production design, and Ad Astra is technically a masterful piece of art. Gray's conclusion is teetering on the edge of underwhelming, for me atleast, with its rushed journey home that dissipated the simmering sorrow built exquisitely beforehand. The ending I personally would've desired, would be the ending no one wanted (but that's life I guess...).\r\n\r\nRegardless, the small criticisms here and there are subject to change upon an inevitable rewatch. Gray is fast becoming one of my favourite directors. He is a man who understands character. He acknowledges the obsession of man. Amalgamating life's wondrously challenging hurdles into singular expressive characters. Ad Astra's meditative and resonant pacing, whilst is sure to put many viewers off, ensures that loss and grief are captured wherever a soul may be. At home or in deep space. It never vanishes.",
                "id": "5e206465b3316b0013032124",
                "url": "https://www.themoviedb.org/review/5e206465b3316b0013032124"
            },
            {
                "author": "materialism",
                "content": "* Meh.",
                "id": "5e2371a0cf4b8b0014f44796",
                "url": "https://www.themoviedb.org/review/5e2371a0cf4b8b0014f44796"
            },
            {
                "author": "Matthew Brady",
                "content": "“Work hard, play later.”\r\n\r\nOnce a year ever since ‘Gravity’ was released, we seem to get new stories about the voyage of space where certain characters “do not go gentle into that good night.”\r\n\r\nI wasn’t wowed over the trailers for Ad Astra, because when you work at a cinema and spent most of your day watching trailers, well trust me when I say this didn’t stand out from the rest. I originally thought it was about saving the world or something like that. For what it didn’t advertise was a slow burn sci-fi movie that’s on the same level as ‘Blade Runner 2049’ and the emotional side as ‘First Man’. A personal story told through a first person narrative about unresolved issues from past relationship.\r\n\r\nBasically an art house movie with a huge budget.\r\n\r\n‘Ad Astra’ was pretty good. After only seeing it once, I feel that this will grow on me overtime and so far it has. A mixture of both ‘2001: A Space Odyssey’ and Terrence Malick movies. While not as great as those two comparisons, but while watching I couldn’t help to be reminded of those two.\r\n\r\nThere's some beautiful and impressive shots through out the movie, especially when the movie constantly shows you the entire scale of space and planets through the characters journey. The colors adds to environment that oozes with style and has a tranquil feel to it. I think that’s where the Blade Runner vibes really come in. Brilliant cinematography by Hoyte Van Hoytema.\r\n\r\nBrad Pitt was terrific as the silent astronaut with tangled mood swings. It’s not an explosive performance, just simple enough for it to be effective. Any other actor would’ve gone big for no other reasons than being overly dramatic and it makes sense for his character to be closed off; similar to Ryan Gosling in ‘First Man’, where his emotional health comes last. You learn very little about his character, as most of his backstory is only in the background for you to piece together the puzzle.\r\n\r\nThe score was mystical and often eerie at times which helped ties in with the unknown aspects of space. The visual effects are excellent and nearly photo realistic at times - something you come to expect by now with space movies.\r\n\r\nI wasn’t too sure about the narration at first, because it was very off putting and a cheap way for the character to express himself. However it sorta grew on me after awhile and some of it was almost rambling with Roy questioning every decision he made.\r\n\r\nNow for the issues:\r\n\r\nI have no idea why Liv Tyler was in this movie, because she literally does nothing and could have easily been cut out. It felt like a re shoot for some reason.\r\n\r\nRemember when I said the visual effects are photo realistic ‘at times’, but that isn’t always the case with certain scenes. There’s a deranged chimpanzee that pops up and it looks really phoney. I think that entire scene could been cut out. I’ve brought up twice about cutting scenes, because I believe if this movie went back to the editing room one more time, then my score would be a lot higher.\r\n\r\nThere’s a ridiculously and almost laughable scene where Roy (Brad Pitt) steaks into a spaceship that he’s not suppose to be on, and all the astronauts on board go into a frenzy and accidentally start kill themselves while trying to cease Roy. No joke. Roy doesn't even do anything as he never intended to hurt them. It was cheap way of making Roy isolated for the rest of the movie. A few years ago I remember reading a horrifying incident that happened to astronaut Luca Parmitano where he reported water inside of his space suit helmet, and nearly become the first astronaut to drown in space. However, Luca remained calm throughout the whole incident despite the odds of him dying being high, but in the end he survived. So it’s really strange seeing these trained astronauts freaking out because came on board.\r\n\r\nOverall rating: Out of the whole spectacle, I find the meaning of the movie the most striking. The themes of family, love and abandonment plays a major role in the story. The whole idea of “working hard and playing later” comes with a cost, which is the less time we spend with our loved ones and abandoning everything to pursuit something better out there when in reality the best things in life are right here. When you discover nothing there’s no turning back and no finding your way back. I’ve been thinking about it for awhile now after seeing the movie.\r\n\r\nNever underestimate James Gray as a storyteller.",
                "id": "5e2f26a0fd140b00196bf3b0",
                "url": "https://www.themoviedb.org/review/5e2f26a0fd140b00196bf3b0"
            }
        ],
        "total_pages": 1,
        "total_results": 7
    },
    {
        "id": 495764,
        "page": 1,
        "results": [
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nSince Wonder Woman that the DCEU has not missed a beat. Even though the latter is still my favorite of the universe, I have mostly a positive opinion about Justice League, Aquaman, and Shazam! Yes, these are not the greatest comic-book movies of all-time, but I would be lying if I denied that I was entertained. Birds of Prey follows the same path: it's fun, action-heavy, and it boasts a phenomenal cast. It has some issues regarding the actual plot and a few characters, but I'll get there.\r\n\r\nFirst of all, let me get the mandatory compliments to Margot Robbie's performance out of the way. If there's a DC character better than Harley Quinn for Robbie to portray, please let me know, because I think she's absolutely perfect as a lunatic, over-the-top psychiatrist-turned-psychopath. Suicide Squad might be a total mess, but I doubt anyone denies how Robbie fits seamlessly into the Harley persona. From her looks to the way she speaks and from her physical movement to her facial expressions, there's just no better casting.\r\n\r\nShe embodies the whole film's chaotic vibe and even contributes to the (very) colorful set design. However, she's not the only one who delivers a spectacular performance. Jurnee Smollett-Bell offers a surprisingly captivating display as Dinah Lance / Black Canary. Even though Harley Quinn is the main character, I found myself caring a lot about Dinah. Her way of living suits the character's personality like a glove, and she's undoubtedly the best-written secondary character of the movie. Unfortunately, I can't say the same about the others, and this is one of my biggest issues.\r\n\r\nIt's a film packed with cliches and attempts of making the characters aware of those cliches, which is also, well, something pretty overused. What's more generic? Having the bad guy telling the hero their masterplan or having the hero stating how the bad guy is incredibly dumb by thinking of doing that? At first, I laughed, and I thought it was funny the way Christina Hodson was avoiding to write straight-up cliche characters by making everyone else aware of the way these talk or move.\r\n\r\nBut the whole \"I know you're cliche, so you can get away with saying or doing cliche things\" only works for a couple of scenes, not an entire movie. This is why I wasn't able to connect with Renee Montoya or care about her narrative at all. Mary Elizabeth Winstead is one of my favorite actresses, but she has the least screentime of the entire cast. I never criticize a film for not giving an actor/actress I like a more important role (unlike other people, I believe it would be unfair to do so). Still, I do complain if I think a particular character should have been given more screentime, which is the case of Huntress.\r\n\r\nI find her backstory way more exciting and emotionally investing than Rosie Perez's character, but sadly Huntress' personal story serves only as a not-that-surprising third act twist. There are several past-present transitions in the storytelling, most work, but some feel extremely abrupt. Nevertheless, Winstead is outstanding every single time she's on camera! Ewan Mcgregor offers a good performance as the villain, but he leads me to my other major issue: the central plot. Trivia time: a MacGuffin is an object, device, or event necessary to the narrative and the motivation of the characters, but insignificant, unimportant, or irrelevant in itself.\r\n\r\nThe thread that connects every single character is based on one of the most overused MacGuffins ever. Now, don't get me wrong: a MacGuffin is NOT a synonym of bad writing or of a bad plot! It's merely something that leads to nothing. Having in mind that Birds of Prey is a character-driven movie, a plot centered around a MacGuffin is not unusual. As long as every character works, the primary story can simply be a passenger (Quentin Tarantino's Once Upon a Time in Hollywood applies this method). However, in Birds of Prey, not every character has an interesting story...\r\n\r\nBasically, Christina Hodson's screenplay isn't exactly bad, but it isn't great too. Just like the film, it has its ups and downs, and I saved some of the ups for last because I do want to end this review on a positive note. Finally, a DCEU movie where the action isn't overwhelmed with CGI, but with detailed choreography and long takes instead! Thank you, Cathy Yan, for bringing some of the best action sequences in this universe. Even if the third act gets a little sloppy due to the amount of characters, it's still a very satisfying ending. The score beautifully accompanies the action, and the visuals are truly gorgeous to look at. The comedy bits are on-point, I laughed quite often, but my final remark goes to a topic I rarely address...\r\n\r\nBirds of Prey is a filmmaking lesson on how to produce an incredibly diverse movie without it feeling forced or unnatural. Only AFTER leaving the theater, I acknowledged the fact that the cast and characters are from various races, cultures, and have different sexual preferences. Why? Because this film doesn't waste its runtime by having its characters mention how black, white, Latinas, Chinese, gay, or whatever they are. They simply are what they are, and we all have eyes to see them. Congrats to Yan, Hodson, and everyone else who decided to treat the characters as if they're humans like every one of us.\r\n\r\nIn the end, Birds of Prey (and the ridiculously long subtitle) continues DCEU's streak of (at least) good movies since Wonder Woman came out. With a phenomenal cast led by an outstanding Margot Robbie as Harley Quinn, Cathy Yan delivers some of the best action of the entire universe in a genuinely entertaining superhero flick. A colorful, chaotic, and fun vibe is present throughout the whole runtime, as well as a pretty neat score. However, Christina Hodson's screenplay lacks creativity. The main plot revolves around the most overused MacGuffin ever, and some characters are straight-up taken from the book of cliches. It's a generic comic-book film with a formulaic narrative, but one that possesses enough fun and entertainment to overlook the typical story.\r\n\r\nRating: B-",
                "id": "5e3df0ce98f1f100140de70c",
                "url": "https://www.themoviedb.org/review/5e3df0ce98f1f100140de70c"
            }
        ],
        "total_pages": 1,
        "total_results": 1
    },
    {
        "id": 448119,
        "page": 1,
        "results": [],
        "total_pages": 0,
        "total_results": 0
    },
    {
        "id": 515001,
        "page": 1,
        "results": [
            {
                "author": "SWITCH.",
                "content": "Through his use of music and uncanny ability to find humour and heart in the darkest of moments, Taika Waititi has created an everlasting story that gives the power back to the persecuted and hope to the lost. ‘Jojo Rabbit’ will make you cry from laughter, cry from emotional pain, and cry with hope. It is simply stunning in all its facets, and a truly remarkable and unexpected film.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-jojo-rabbit-taika-waititi-strikes-comedy-gold-again-with-adolf-hitler",
                "id": "5df5cf7065686e001883d652",
                "url": "https://www.themoviedb.org/review/5df5cf7065686e001883d652"
            },
            {
                "author": "Gimly",
                "content": "Manages to somehow be one of the most raw and confronting looks at various aspects of WWII I've ever seen, and yet also often genuinely very funny. I'm not sure if that's really something that you should do... But Taika did anyway, and I loved it.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._",
                "id": "5e0c64f0a84ff70015347cbb",
                "url": "https://www.themoviedb.org/review/5e0c64f0a84ff70015347cbb"
            },
            {
                "author": "dutchdutch",
                "content": "Funny, light-hearted and delightful, Jojo Rabbit is a charming, and at times poetic, celebration of friendship, romance and peace, and a cheerful ode to our capability, and bravery, to save and love beyond boundaries.",
                "id": "5e1c4bfcd5dbc20017f3827b",
                "url": "https://www.themoviedb.org/review/5e1c4bfcd5dbc20017f3827b"
            },
            {
                "author": "Stephen Campbell",
                "content": "**_A hilarious piece of political satire that isn't afraid to be serious_**\r\n\r\n>_The great danger of lying is not that lies are untruths, and thus unreal, but that they become real in other people's minds._\r\n\r\n- Christine Leunens; _Caging Skies_ (2004)\r\n\r\nWe live in dangerous times. In this era of political regression, racists, xenophobes, neo-Nazis, white supremacists, white separatists, and fascists, once confined to the periphery of civilised society, have wormed their way back into the cultural mainstream, preaching hate and intolerance under the guise of terms such as \"nationalism\" and \"patriotism\". Meanwhile, politicians validate such groups by doing precisely nothing to curtail them and refusing to condemn them (\"_very fine people on both sides_\" and so forth). Far-right political parties have gained worrying footholds in numerous European countries, running on populist platforms of Islamophobia and anti-immigration, playing on peoples' fears of the Other, exploiting the dearth of facts in sociopolitical discourse, and trading in disinformation (and the less said about the current administrations in the US and UK, the better). Anti-establishment political rage is on the increase, as hordes of people disavow traditional centrism; think of Brexit, the election of Donald Trump, the _Movimento 5 Stelle_ in Italy, the _Alternative für Deutschland_ in Germany. Scholars and sociocultural anthropologists have posited that hateful right-wing ideologies are more validated now than at any time since the rise of fascism in places such as Italy in 1922 and Spain in 1936. And the best known example of this kind of fascist thinking, of course, is the Third Reich in Germany, beginning with the rise to power of Adolf Hitler in 1933.\r\n\r\nAnd so, it's entirely fitting that a film set in this very _milieu_, which argues that love, tolerance, and kindness can defeat hateful indoctrination, has come along at this precise moment; because although this is a film set in Germany in 1945, it's really about the here and now. Based loosely on the 2004 novel _Caging Skies_ by Christine Leunens, _Jojo Rabbit_ is a political satire written and directed by New Zealand filmmaker (and Polynesian Jew) Taika Waititi (_Eagle vs Shark_; _What We Do in the Shadows_; _Hunt for the Wilderpeople_; _Thor: Ragnarok_). Courting significant controversy when it was announced (a comedy about Nazis? For shame. Especially when one considers that the novel is deadly serious) and sharply dividing critics upon release, the film has proven a significant hit with audiences, and has just scored an impressive six Academy Award nominations, including Best Picture.\r\n\r\nPositing that the first casualty of indoctrination is objective truth, Waititi follows in the footsteps of filmmakers such as Charlie Chaplin (_The Great Dictator_), Mel Brooks (_The Producers_), Roberto Benigni (_La vita è bella_), and even Quentin Tarantino (_Inglorious Basterds_), in attempting to defang Nazi ideology by rendering it utterly absurd and mercilessly exposing it to mockery. Marketed as an \"_anti-hate satire_\", the film has no easy task – to use Nazism as the (mostly) humorous background to what is essentially a _bildungsroman_, without it seeming exploitative or dismissive of the real suffering endured by real people. And Waititi manages this tricky balancing act exceptionally well. The satire and slapstick elements are as funny as anything in his filmography, and the film's more serious moments (of which there are several) arrive like an absolute gut-punch. This could have gone wrong in so many ways – if it wasn't funny, if the emotionality felt contrived, if the serious moments seemed manipulative, if the whole thing just came across as disrespectful and in bad taste – but Waititi navigates these dangerous waters magnificently. _Jojo Rabbit_ is, in fact, that rarest of films – a comedy where the serious moments feel completely earned and a drama with something important to say where the comedy enhances the seriousness.\r\n\r\n_Großdeutsches Reich_, 1945. The European war is all but over. Germany's army has been pushed back to the homeland and allied forces are approaching from multiple directions. However, the propaganda machine continues to ensure that the populace are relatively unaware that _Der Führer_ is on the brink of total defeat. In the fictional town of Falkenhem, ten-year-old Jojo Betzler (an astonishing debut by Roman Griffin Davis) lives with his whimsical mother Rosie (Scarlett Johansson doing probably the best work of her career). His father, he believes, is fighting on the Italian Front, whilst his older sister Inge recently died of influenza. And, oh yeah, his imaginary best friend is none other than Hitler himself (a ludicrously over the top Waititi), or at least Jojo's childlike conception of Hitler. Believing absolutely in his duty to the state, Jojo and his actual flesh-and-blood friend Yorki (a hilarious Archie Yates) attend a camp for the _Deutsches Jungvolk_ branch of the _Hitlerjugend_. The camp is run by the cynical Cpt. Klenzendorf (a powerful performance by Sam Rockwell that was outrageously ignored by the Academy), who was forced to leave the front line upon losing an eye. Helping him manage the camp are his effeminate second-in-command Finkel (Alfie Allen) and the completely insane Fräulein Rahm (Rebel Wilson), who claims to have given birth to eighteen blond-haired blue-eyed _übermenschen_ who are now fighting on the front. When Jojo is told by some older boys that to prove he has what it takes to be a soldier, he has to kill a rabbit, he refuses to do so, earning the moniker Jojo Rabbit. However, determined to show his fellow students what he's made of, he barges into a _Stielhandgranate_ exercise, tossing a grenade against a tree, which then explodes a few feet away from him, leaving him with a limp and a scarred face, and forcing him to return home in disgrace. As Jojo recovers, Rosie persuades Klenzendorf, who was demoted after the incident, to give him some work, and so he's employed to distribute propaganda around town. Life is dull but straightforward. That is until he learns his mother has been hiding a young Jewish girl, Elsa Korr (a nuanced performance from Thomasin McKenzie), in a crawlspace behind the wall of Inge's room. However, as every German youth knows, Jews are mind-reading demons who must be exterminated. So why would his mother be harbouring one, and, more importantly, what does Jojo do now that he knows?\r\n\r\nPerhaps _Jojo Rabbit_'s most laudable component is how well Waititi balances the disparate tones, which is a hell of a lot better than Benigni did. The film mixes slapstick humour, caricature, satire, dramatic irony, and hope, but never does it seem like its ignoring or trivialising real suffering. When the comedy is dropped and Waititi gets serious, the tonal shifts pack a shocking punch, and it's _because_ they're so well integrated into the overarching comic structure – if you take away the humour and the satirical edge, the film's darker elements simply don't work as well – it's the contrast that makes each element all the more powerful. Waititi's tonal intentions are indicated right from the beginning, as stock footage of German children performing 'Heil Hitlers' is scored (unashamedly anachronistically) by the German version of The Beatles' \"I Want to Hold Your Hand\" (1963). Also crucially important to the film's tonal qualities are the bright, colourful palette employed by director of photography Mihai Mălaimare, Jr. (_The Master_; _A Walk Among the Tombstones_; _The Hate U Give_) and the whimsical production design by Waititi's regular designer, Ra Vincent. Together, they speak to the fact that this is Jojo's worldview rather than objective reality, with the look of the film reminding me a great deal of Wes Anderson's _The Grand Budapest Hotel_ (2014). It sure doesn't look like any World War II movie you're ever likely to have seen.\r\n\r\nThematically, the film examines multiple issues; the devotion of motherhood, the importance of kindness in defeating indoctrination, the disconnect between an unchallenged and rigidly reinforced ideology and a far more nuanced and complex reality, the predetermined attitudinal stance towards the Other, the clash between doing what one knows to be right and what one is expected to do, the fact that good people can be found even in the worst of circumstances. Klenzendorf's arc is especially telling in this respect. Introduced as a hyperbolic caricature, the source of some of the film's biggest early laughs, as things progress, we realise there's considerably more to his character than initially thought, and he commands what's easily the most moving scene in the whole film. This is Jojo's story, however, with much of the runtime concerned with his attempts to rationalise the cognitive dissonance between what he's been taught and what he can see with his own eyes. Rosie is rightly worried that the indoctrination Jojo has known his entire life has effectively brainwashed him – he's so passionately loyal to Nazi ideology, when he found out his grandfather didn't have blond hair, it took him three weeks to get over it.\r\n\r\nOf course, as mentioned, although set in 1945, _Jojo Rabbit_ is really about the here and now, although it's more than a little upsetting that its depiction of illogical hate is so timely. Essentially, the film mocks extremism, people who hate based on ethnicity or religion, with Jojo's belief that Jews are demonic figures capable of powerful magic standing in for people who believe all Muslims are terrorists or all Mexicans are rapists. In this sense, the film isn't about Nazis at all; their role is more allegorical. Rather it's partly about the role adults play in inculcating children into hate and partly about exposing the power of propaganda to subvert truth. But so too is it about rising above such ideology, no matter how ingrained it might be, a path that values personal relationships with persecuted minorities, which in turn reveal the individualistic humanity behind the political cliché. And although all of this is presented humorously, it never becomes didactic or monolithically preachy – Waititi balances his tones so well, the political undercurrent remains always subtle.\r\n\r\nIf I were to criticise any element of the film, it would be that Waititi undeniably glosses over some of the more horrific atrocities carried out during the War. The Nazis in the film are, by design, cartoonish, but that is done so as to render them as easily dismissed figures to be scorned. The reality, of course, was far, far darker. I've seen some critics point to this as evidence that the film is crass and manipulative, and although I disagree with that assessment, it certainly wouldn't have hurt to have at least one fully indoctrinated Nazi who isn't a figure of fun – even the Gestapo is exposed to ridicule, with the character of Deertz (an admittedly hilarious Stephen Merchant cameo) presented as more concerned with empty pop-cultural signifiers than carrying out the actions of the real Gestapo. In this sense, the film doesn't represent the awful truth, but it never claims to; this isn't a reality-based examination of Nazism, nor does it try to be.\r\n\r\nOnly two weeks into 2020, and I already have a possible film of the year. _Jojo Rabbit_ is beautiful, emotional, heartfelt, and devastating, but mostly hilarious and always hopeful. It's an extraordinarily sweet film without ever becoming saccharine, as Waititi strikes a perfect balance between comedy, tragedy, and drama. It's a very funny World War II film which imparts a vital message for our confused and divided world of today – if we let them, love will always trump hate, hope will always light a way through the darkness.",
                "id": "5e21335e397df0001697591e",
                "url": "https://www.themoviedb.org/review/5e21335e397df0001697591e"
            },
            {
                "author": "Matthew Brady",
                "content": "\"Your mother took me in. She's kind. She treats me like a person.\"\r\n\r\nTaika Waititi is on a roll recently and rightfully so, because he's got a great comedic vision.\r\n\r\n'Jojo Rabbit' is a World War II satire that's both hilarious and surprisingly tragic. Joy, terror, love, hate all in one movie. Waititi knows how far to take a joke and how humor can put on light on ugly issues. While absurd looking on the surface, but on a deeper look it's something unique. \r\n\r\nNewcomers Roman Griffin Davis and Thomasin McKenzie take center stage upon the big cast. Their comedic timing, emotional range and overall performances are nothing short than impressive. Also Archie Yates is like the adorable child version of Nick Frost.\r\n\r\nSpeaking of big name stars. Scarlett Johansson is having a fantastic year and she once again delivers a wonderful performance. Sam Rockwell is amazing in pretty much anything he's in and here is no different. Rockwell playing a closeted homosexual Nazi is hysterical, and yet meaningful when you look at it more thoughtfully. \r\n\r\nThe weakest actor upon the cast has to be Rebel Wilson. I really didn't buy her as this character. I thought she's just doing her usual comedic traits like in every other movie, which I'm not a fan of. \r\n\r\nNot only is Taika Waititi directing and writing, but also starring as Jojo's imaginary friend of his very own idol... Adolf Hitler. Apparently Waititi didn't have to research playing Hitler, because he thought Adolf was 'a f**ing c***'. Anywhere, the concept itself is really bizarre and really fascinating. While silly and entertaining, but could've been left out, in my opinion. There was a point where he completely disappears from the movie to later reappear during the finale.\r\n\r\nAt times I feel like it tries hard to be like a Wes Anderson movie, in terms of staging, quirky humor, and overall setting. Influence is one thing, but it came a point when it wasn't being it's own thing.\r\n\r\nOverall rating: Criticisms aside, I had an absolute blast. Endearing and highly vocal. I'm glad a movie like this exist.",
                "id": "5e2f2887ac8e6b0011bcc3e9",
                "url": "https://www.themoviedb.org/review/5e2f2887ac8e6b0011bcc3e9"
            },
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nTaika Waititi delivers one of those films I absolutely love for the exact same reasons some people deeply hate it. His seamless balance between comedy and war drama makes Jojo Rabbit a thought-provoking yet hilarious depiction of how ridiculous Hitler’s followers were. Roman Griffin Davis offers one of the best young performances of the millenium, and the rest of the cast is pitch-perfect. There’s a lot of laughs, but also a lot of heart. Still, be warned: if you’re easily offended, this movie isn’t suited for you. Either go in with an open mind or don’t go in.\r\n\r\nRating: A-",
                "id": "5e3aad5543250f0015c7091b",
                "url": "https://www.themoviedb.org/review/5e3aad5543250f0015c7091b"
            }
        ],
        "total_pages": 1,
        "total_results": 6
    },
    {
        "id": 496243,
        "page": 1,
        "results": [
            {
                "author": "SWITCH.",
                "content": "What makes ‘Parasite’ so satisfying is that it commits neither error. It’s an engrossing, stylish and near perfect movie, and its underlying themes go beyond merely pointing out class exploitation to challenge the logic of capital. Though he is often juggling a mosaic of characters, themes and social issues, Bong never eschews his anarchic impulses and dark humour. It’s a movie that should be seen as widely as possible, if only so that Bong Joon-ho gets more chances to make movies for modern audiences that badly need them.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-parasite-a-bloodthirsty-and-very-funny-look-at-class-warfare\r\n\r\nHead to https://www.maketheswitch.com.au/sff for more Sydney Film Festival reviews.",
                "id": "5d060140c3a36832f220dedd",
                "url": "https://www.themoviedb.org/review/5d060140c3a36832f220dedd"
            },
            {
                "author": "Sheldon Nylander",
                "content": "The working class and down on their luck Kim family struggle to make ends meet. When a friend of the son, Ki-Woo’s, who is an English tutor for the daughter in the wealthy Park family, has to leave his position, he recommends Ki-Woo for the job. Now having an \"in\" with the wealthy family, the Kims begin plotting the downfall of the current household servants and inserting themselves into those vacant positions, making them all gainfully employed and with money finally flowing into the household. But not everything is as it seems in the Park house or with their previous servants.\r\n\r\nThis movie starts out as a comedy and quickly goes into social commentary, pointing out the differences between the poor working class family and the wealthy privileged family. The differences are ones that get commonly pointed out with the well-to-do having what usually gets termed as first-world-problems, while the poor family is literally trying to survive and save meager possessions in a flood. It doesn’t shy away or try to be subtle about it, but interestingly enough, we don’t feel beaten over the head with it either, which is a major change from the ham-fisted approach taken by most filmmakers. Couching this in a comedy is a good approach, as well, as the audience’s guard is let down and we become more receptive to the ideas.\r\n\r\nHowever, I do say it’s MOSTLY a comedy. The third act takes a dark, dark turn, and the contrast, not to mention general disdain and even indifference, between the classes becomes much more severe. This gets into some hard territory, and characters that we’ve found quirky and even come to like in some ways show very different sides of themselves. At the same time, it doesn’t feel unexpected, almost like we could tell that this was under the surface all the time and tried to ignore it, but aren’t surprised by it when it does show up. This is some masterful characterization!\r\n\r\nAnother aspect of note is that this film is rich in allegory and metaphor. It’s a smart film, yet at the same time the filmmakers are not condescending about it. They give the audience credit for being able to understand the symbolism and don’t spoon feed you everything, which is a refreshing change from the usual head-beating most filmmakers go for. At the same time, they understand that not every audience member will understand or immediately pick up on every symbol, but they have crafted this so carefully and so perfectly that you don’t have to understand each and every one. That understanding merely enriches the experience, but isn’t essential to it.\r\n\r\nThis film has gotten some recognition, and deservedly so. It is rich, intelligent, and polished to a degree that we sadly don’t see as often as we should nowadays, showing the filmmakers are masters of their craft. This is easily one of the best films I’ve seen in 2019. Highly recommended!",
                "id": "5daaf2d59661fc001241a1d8",
                "url": "https://www.themoviedb.org/review/5daaf2d59661fc001241a1d8"
            },
            {
                "author": "Saru",
                "content": "This is VERY HIGHLY OVERRATED. \r\nThe most part of the movie is foul-playing, most of those scenes seem to have been copied from the 1999/old Vijay’s movie: Minsaara Kannan [IMDB: https://www.imdb.com/title/tt7562630/?ref_=nv_sr_srsg_2], (Warning: This again might be a copy of some other movie as well]. \r\n“Morse code” has been used in a much better way in 2017 Ajith’s film: Vivegam [IMDB:https://www.imdb.com/title/tt6878378/?ref_=nv_sr_srsg_0] [Letterboxd: https://letterboxd.com/film/vivegam/]\r\nI just don’t understand what makes this movie so special that it has been appraised so highly. It is not even 10% of the Tamil movies at this level/standard.\r\nPeople who’re praising this movie must start watching Tamil movies instead of Korean, there are so many gems that have gone unnoticed.\r\nThere is really nothing special in this movie that stands out. \r\nCannot digest that an average movie like this has got so much limelight. Btw: Where does this kinda BS trend start off?",
                "id": "5e1b2ab13520e8001735adfa",
                "url": "https://www.themoviedb.org/review/5e1b2ab13520e8001735adfa"
            },
            {
                "author": "tmdb39513728",
                "content": "errbnb\r\n\r\nNews that Adam McCay is collaborating with Bong Joon Ho to retool Parasite as a Netflix series makes me positively giddy. Parasite is easily the best movie I've seen since the Big Short. Joon Ho's compelling ease of execution alongside the effortless lure of the plot's trappings had me hooked in an instant. I would have been happy watching this family fold pizza boxes for two hours. The story, like the family, takes on a life of its own, rapidly elevating to a setup impossible to sustain. The Bunuelesque occupy-the-rich scheme gleefully, blissfully ascends to lofty heights only, inevitably, to hit the fatal fan. The poor buggers ultimately find themselves literally chin deep in their own sh*t. The hotsy-totsy aristocrats, meanwhile, host a lovely garden party that flips into a tragic Shakespearean bloodbath. It's all fun and games till someone loses a daughter. (Note to the rich: Check the references of new hires and think twice before inviting riffraff to your afternoon functions). Decades in the making, the implosion of a middle income buffer and a widening disparity between social classes make Parasite a must-see for all income brackets. You don't have to be rich or detest or envy the rich to enjoy this instant classic. But please, whatever you do, don't try this a home, folks. Never combine the rich and poor without safety goggles or outside the confines of a controlled and supervised laboratory setting.",
                "id": "5e299d081685da0011e2cd24",
                "url": "https://www.themoviedb.org/review/5e299d081685da0011e2cd24"
            },
            {
                "author": "Matthew Brady",
                "content": "\"You know what kind of plan that never fails? No plan. No plan at all. You know why? Because life cannot be planned.\"\r\n\r\n'Parasite' is absolutely fantastic. I'm still buzzing how good this movie is. Unpredictable and nuts. You know, this summer I was starting to get a little worn out with the endless sequels, remakes and soulless crash grabs, so I find it refreshing we get movies like this once awhile.\r\n\r\nI admire Bong Joon-Ho as a director, especially his Korean movies. Not to say I dislike his English language films like 'Snowpiercer' and 'Okja', but in my personal opinion those don't match the same quality as his Korean movies and there isn't a sex pest trying to control his work. Anywhere, Bong Joon-Ho is one of the best working directors alive and 'Parasite' proves it.\r\n\r\nThe movie perfectly blends drama and comedy so effortlessly, it basically breaks the impossible. And the comedy is actually hilarious and well written with the execution being sold on the actors. The thing I love so much is how funny, thrilling and intense the movie can be, hijacking all senses and emotions all wrapped into one - only a few directors can pull something this unique.\r\n\r\nThe performances from everyone was brilliant and there's so much depth to each character, they make the movie as captivating as it is. The cinematography was beautiful, the music was remarkable, and the movie says so much it's the reason why I was engaged throughout.\r\n\r\nI highly recommend people to avoid knowing anything before going in, because trust me it will add to your experience.\r\n\r\nOverall rating: Finally, a breath of fresh air. My second favorite movie of this year.",
                "id": "5e2f27e0c56d2d00134e8e40",
                "url": "https://www.themoviedb.org/review/5e2f27e0c56d2d00134e8e40"
            }
        ],
        "total_pages": 1,
        "total_results": 5
    },
    {
        "id": 530915,
        "page": 1,
        "results": [
            {
                "author": "SWITCH.",
                "content": "I really wanted to give this film five stars, but there is a curious introspection that prevents me from calling it perfection. Nevertheless, ‘1917’ is a brilliant piece of art, and clearly a personal project for Sam Mendes. Blending groundbreaking technology with detailed production components, it's sure to entertain audiences and garner respect from critics for its execution. Just don’t say I didn’t warn you when the Oscar nominations come out.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-1917-sam-mendes-personal-war-story",
                "id": "5df0c1f60257640018582fd5",
                "url": "https://www.themoviedb.org/review/5df0c1f60257640018582fd5"
            },
            {
                "author": "Lenny/Mosko",
                "content": "Without a doubt, cinematically this is a visual tour de force. The one-shot approach becomes a distraction, at times, especially when one ponders \"how did they do that?\", but generally not enough to take away the wow factor.\r\n\r\nThe story, and dialogue, not to mention logic are the real problems that take this movie from great, to merely good.\r\n\r\nThe initial concept of sending two men on an imperitive mission to save 1600 men is ludicrous in itself, especially in a war where men were gassed and gunned down by the thousands. Sending only two of them into unknown situations, in no-man's-land was illogical.\r\n\r\nThen there was the fact the hero seems to never get shot by enemy soldiers, despite being in dead-duck situations. When he does get injured, his wounds seem to magically heal and disappear instantly. Director Sam Mendes must have never had the concussive effects of explosions explained to him, because while some fall from explosions, the heroes seem immune to physics.\r\n\r\nThe most ludicrous scene involves booby-trapped explosives, and a collapsed ton of rocks leaving not only no visible injuries, but no effects at all on clothing or hearing. But there was dust in the eyes.\r\n\r\nThere are many more scenes involving lack of logic, or credibility. \r\n\r\nOver-all, the movie is worth it for the cinematography, attention to detail, costumes and acting, but the trite story, and credibilty problems drag it down from what it should, and could have been.",
                "id": "5e1e99815c071b0013630cce",
                "url": "https://www.themoviedb.org/review/5e1e99815c071b0013630cce"
            },
            {
                "author": "Luis_989",
                "content": "Finally yesterday I was able to experience 1917 and I ended up doing it at IMAX, something I didn't plan on, but after seeing it there, I can say this film deserves to be seen and heard in an IMAX room to remember why movies still need to be lived on a big screen.\r\n\r\nThe visual odyssey of Sam Mendes and Roger Deakins is an incredible journey. Yes, the story is very thin but that's something that made 1917 a somewhat different film\r\nIt's not a war epic, nor does it try to be one. It's kind of a lone wolf war story, though at the beginning it wasn't like that, and that's good because despite everything that happens, the film doesn't lose that sense of camaraderie at the task that remains after the loss.\r\n\r\n1917 is a story of survival and that although it could not be considered completely original, that's totally the least of its problems because after all the experience is just spectacular.\r\n\r\nI admit the film has certain rhythm dropouts that I didn't like, especially the scene where Schofield loses consciousness, but at that point we are given the extraordinary night sequence, so my discomfort ended up disappearing.\r\n\r\n1917 is not a perfect film, but it's a reminder of how wonderful is to enjoy a film as they should be, even if it's a film that deals with the horrors of war.\r\n\r\nThis is the kind of film that should be lived and experienced that way, otherwise it loses its resonance, so if you have the chance to see 1917 at a big screen do it.",
                "id": "5e2371c4eb09320016f817b6",
                "url": "https://www.themoviedb.org/review/5e2371c4eb09320016f817b6"
            },
            {
                "author": "Stephen Campbell",
                "content": "**_Although partly a technical showcase rather than a story, it's still a terrific Great War movie_**\r\n\r\n>_In the newspapers you read: \"Peacefully they rest on the spot where they have bled and suffered, while the guns roar over their graves, taking vengeance for their heroic death\". And it doesn't occur to anybody that the enemy is also firing; that the shells plunge into the hero's grave; that his bones are mingled with the filth which they scatter to the four winds – and that, after a few weeks, the morass closes over the last resting-place of the soldier._\r\n\r\n- Kanonier Gerhard Gürtler (Königlich Bayerisches 3. Feldartillerie-Regiment Prinz Leopold)\r\n\r\n>_Bent double, like old beggars under sacks,_\r\n\r\n>_Knock-kneed, coughing like hags, we cursed through sludge,_\r\n\r\n>_Till on the haunting flares we turned our backs,_\r\n\r\n>_And towards our distant rest began to trudge._\r\n\r\n>_Men marched asleep. Many had lost their boots,_\r\n\r\n>_But limped on, blood-shod. All went lame; all blind;_\r\n\r\n>_Drunk with fatigue; deaf even to the hoots_\r\n\r\n>_Of gas-shells dropping softly behind._\r\n\r\n- Wilfred Owen; \"Dulce et Decorum Est\" (1921)\r\n\r\n>_No tactical or strategic gain was made on the Somme front that was worth the cost in lives. Even had the British and French achieved their breakthrough on the Somme, the Germans had plenty of room to manoeuvre and, unlike the French at Verdun, no national interest in staying where they were. During the winter of 1916-17, the Germans simply withdrew to the Hindenburg Line, east of the Somme battlefield, and it all had to be done again._\r\n\r\n- Robin Neillands; _Attrition: The Great War on the Western Front – 1916_ (2001)\r\n\r\n>_In the Somme valley, the back of language broke. It could no longer carry its former meanings. World War I changed the life of words and images in art, radically and forever. It brought our culture into the age of mass-produced, industrialised death. This, at first, was indescribable._\r\n\r\n- Robert Hughes; _The Shock of the New_ (2004)\r\n\r\nMy paternal grandfather fought during the Great War. Corporal Edward J. Campbell was with the 9th Battalion of the Royal Dublin Fusiliers, 48th Brigade, 16th (Irish) Division and took part in the capture of Ginchy on September 9, 1916 during the Battle of the Somme. My dad was born in 1933, and in all the years that came afterwards – even when he himself joined the RAF – his father never spoke about those years.\r\n\r\nThe Great War broke men in ways the likes of which had never been seen before, and perhaps have never been seen since. It exposed men to psychological horrors inconceivable to most people today. The nature of trench warfare and the concomitant use of artillery on a scale beyond anything in human history did such things to men's minds that even thousands of those who returned never really left the battlefields. We've all seen \"Shell shocked soldier, 1916\", one of the most haunting photographs ever taken, and the picture it paints is a disturbingly vivid one. But what makes the Great War, the so-called \"war to end all wars\", so much worse than it had to be was that it pitted old school tactics against modern weaponry. Generals on both sides believed the war could be won, as others had been, by sending wave after wave of men \"over the top\" in an attempt to overwhelm enemy positions. However, such tactics failed to take into account advancements in weaponry, with combatants defending their trenches with miles of machine-gun emplacements and fields of landmines, reinforced with the war's most successful killer – endless artillery barrages. The technology had advanced. The tactics had not. Which led to the nine-month stalemate of the Battle of Verdun (February 21 to December 18, 1916), during which the Germans lost 143,000 men and the French lost 163,000. Which led to the first day of the Somme (July 1, 1916), when the British suffered nearly 20,000 loses in less than 12 hours. Which led to the unimaginable slaughter of the hell-come-to-Earth that was the Third Battle of Ypres, better known today as Passchendaele (July 31 to November 10, 1917), where at least 400,000 men died, maybe as many as twice that.\r\n\r\nEvery soul who fought in those battles is gone now. The last surviving combat veteran, Chief Petty Officer Claude Choules, who joined the Royal Navy in 1915, aged just 14, died at the age of 110 in 2011. And unlike conflicts such as World War II or Vietnam, The Great War has largely dropped from the popular consciousness. Not just the reasons why it was fought, but the conditions in which it was fought. Even celebrated films such as Lewis Milestone's _All Quiet on the Western Front_ (1930) or Stanley Kubrick's _Paths of Glory_ (1957) aren't all that well known. And that's one of the reasons that films like 1917 are important – they ensure we don't forget.\r\n\r\nWritten by Sam Mendes and Krysty Wilson-Cairns, _1917_ is very loosely based on stories told to Mendes by his grandfather Alfred Hubert Mendes, who was a front line messenger during the war, and who, at 5'4\", was able to use the low-lying No Man's Land mist as cover without having to stoop or crawl, and thus was much faster compared to other messengers. The film is directed by Mendes (_American Beauty_; _Revolutionary Road_; _Skyfall_), and unless you've been living under a rock, you'll know that it's done in such a way as to give the impression that it all takes place in two single shots (the marketing material says one shot, but it's two – there's a cut-to-black time-jump about midway through the film where no attempt is made to hide the transition). In reality, of course, there are a lot more than two shots (the longest single shot was just over 8 minutes), but the edits have been digitally 'hidden', much like Alejandro González Iñárritu's _Birdman or (The Unexpected Virtue of Ignorance)_ (2014) or Erik Poppe's _Utøya 22. Juli_ (2018). Working with legendary cinematographer Roger Deakins (_Kundun_; _No Country for Old Men_; _The Assassination of Jesse James by the Coward Robert Ford_; _The Reader_; _Blade Runner 2049_), Mendes wanted the film to be the most immersive war movie ever put on screen, with the story designed to take place in real-time so as to ensure the importance/relevance of the single-shot aesthetic. And although I have some issues with it, and I certainly don't think it's the greatest war movie ever made, by and large, I think Mendes has made an exceptional film, one in which form and content are unusually tightly matched, with the style extremely effective at delivering the story in a thematically justified manner.\r\n\r\nApril 6, 1917; the Western Front. Two young British Lance Corporals, Will Schofield (George MacKay), a veteran of the Somme, and the younger, more idealistic Tom Blake (Dean-Charles Chapman) are summoned to a meeting with General Erinmore (Colin Firth). Recently, German forces have fallen back, and Colonel Mackenzie (Benedict Cumberbatch) of the 2nd Battalion, Devonshire Regiment believes that if he attacks now, he will break the line and turn the tide of the war. However, he's unaware that the retreat is a tactical gambit – the Germans have fallen back to the heavily fortified Hindenburg Line and are lying in wait. With communication lines cut, Schofield and Blake, who has a brother in the 2nd, are given a simple but dangerous mission – to physically carry an order from Erinmore to Mackenzie calling off the following morning's attack, a mission which will involve them crossing into No Man's Land and traversing the Germans' former position. If they fail, 1,600 soldiers will be slaughtered. Mackenzie is six miles away. They have ten hours.\r\n\r\nSo, the film's big selling point is its aesthetic design. The use of the single-shot format is such a noticeable and idiosyncratic type of form that whenever it's used, it automatically places pressure on the content, which must justify why the film is shot this way, why it would lose something inherently thematic if shot conventionally. If the content can't do that, in other words, if the content can't justify the form, the form becomes gimmicky, drawing attention to itself. Think of, for example, Alfred Hitchcock's _Rope_ (1948), which was edited to look like one shot, or Sebastian Schipper's _Victoria_ (2015), which was legitimately one shot. Very little in either film justifies the stylistic design – shoot them conventionally and they're still broadly the same film thematically. Compare this with genuine one-shot films such as Mike Figgis's _Timecode_ (2000) or Alexander Sokurov's _Russkij Kovcheg_ (2002), and edited one-shot films such as Gustavo Hernández's _La casa muda_ (2010) or the aforementioned _Utøya 22. Juli_. Whether it's the spiralling nature of events in _Timecode_, the elegant cause-and-effect historical sweep of _Russkij Kovcheg_, or the real-time pressure and escalation of _La casa muda_ and _Utøya 22. Juli_ these films tie form to content in such a way that they become indistinguishable – form _is_ content, content _is_ form. And I think Mendes achieves like synergy.\r\n\r\nIs the one-shot effect distracting? At first, yes, it is a little, especially if you're playing the game of trying to spot where editor Lee Smith (_Master and Commander: The Far Side of the World_; _Elysium_; _Interstellar_) has hidden the transitions. But after sussing two edits in the first twenty minutes, I stopped looking, because I realised I was just pulling myself out of the film unnecessarily. In essence, once you go with the aesthetic on its own terms, you forget about trying to spot the edits and asking yourself, \"_how did they do that_\", instead of letting the cinematography do exactly what it's supposed to do – immerse you. This is a film that wants to try to convey what it was like to live and fight in those trenches, with Mendes stating, \"_I wanted people to understand how difficult it was for these men. And the nature of that is behind everything_\". And, it does about as good a job as any war film I can think of in evoking the psychical reality, if not necessarily the psychological (more on that in a moment).\r\n\r\nGenerally speaking, the majority of the film is shot in one of two ways – either the camera is behind Schofield and Blake, following their path, or it's in front of them, facing back towards them as they 'follow' its path. There are some minor deviations from this (a few drone shots, some side-on footage etc), but irrespective of that, the film never for one second leaves their presence. And because the two men are almost perpetually in motion, it means that the camera is almost perpetually in motion, lending not only a tremendous fluidity to the blocking, framing, and movement, but so too a natural motivation – if they're walking along a trench, we're walking along a trench; if they're moving stealthily through a bombed-out town, we're moving stealthily through a bombed-out town. Almost everything the camera does is because one or both of the protagonists are doing the same thing, further emphasising the correlation between form and content.\r\n\r\nThe opening scene serves as a superb introduction not just to the visual design, but to the reasons for employing that visual design and the effectiveness of doing so. The film starts with a shot of a daffodil field, before pulling back and revealing Schofield and Blake taking a break against a tree before being summoned to the meeting with Erinmore. They rouse themselves and begin walking, first past more resting soldiers, then a camp where food and laundry are being prepared, then down a ramp into the trenches, the bucolic opening moments giving way to barbed wire and dirt. Geographically, it's a short walk, but thematically, it covers considerable ground. In a film that's all about scale and scope, this sequence perfectly encapsulates one of the main thematic reasons behind the single-shot – to accurately convey the importance of geospatial relations. We see the tactile transition from Edenic to hellish because we're moving in real-time through the _milieu_ with the characters; we see the boundary between peace and war because the characters walk along that boundary. You shoot this opening sequence conventionally, and you undercut this sense considerably.\r\n\r\nAlong slightly more conventional lines, one also has to commend the work of production designer Dennis Gassner (_Bugsy_; _Waterworld_; _Into the Woods_). Every location is visually unique – from a German bunker to an abandoned farmhouse to the bombed-out remnants of Écoust-Saint-Mein, and every location feels authentic and lived in. His design of No Man's Land is especially laudable, not just in terms of the expected mess of barbed wire and debris, but in the use and positioning of dead bodies, dead animals, and semi-destroyed machinery, with the whole thing having an almost post-nuclear desolation feel. Indeed, the film's No Man's Land is designed thematically. Mendes has said, \"_the first World War starts with literally horses and carriages, and ends with tanks_\", and this is mirrored in Gassner's designs. When the men first crawl into No Man's Land, they immediately encounter a rotting fly-covered horse carcass. Gradually, however, the battlefield becomes more mechanised, until they eventually pass through a German artillery position.\r\n\r\nAlso in a slightly more conventional sense, one has to mention Deakins work during the nighttime scenes in Écoust-Saint-Mein. The entire village has been reduced to nothing but the shells of buildings, and as we pass through the town, the only source of light is from the flares arching through the sky, which create very hard shadows in constant motion. The whole thing is almost otherworldly, and as the garish light traverses the sky, it's as if the ground itself is in motion, almost liquid-like, with the protagonists desperately trying to time their movements to ensure they stay hidden in the constantly shifting shadows. It might be a little too aesthetically beautiful for a film aiming for such gritty realism, but for aspiring cinematographers, you won't find a better study in how to compose an image using light and shadow.\r\n\r\nThematically, by its very nature, _1917_ is far more focused on the micro than the macro – you might learn something about life on the front, but you'll learn nothing about the politics behind the conflict, or even a sense of who's winning. Partly because of this, the film avoids, for the most part, the overwrought patriotism found in so many American World War II movies, the kind of cartoonish jingoism that made Steven Spielberg's _Saving Private Ryan_ (1998) so obnoxious. Indeed, it's relatively unimportant which side the protagonists are even on – their mission could have come from any of the combatants. Their nationality is largely anonymous, which is not something you can usually say of a war film, but which does illustrate just how irrelevant lofty political issues were at ground level, with everyone simply trying to survive as best they can.\r\n\r\nOn the other hand, however, because the film is so tightly focused, you shouldn't expect too much psychological insight. If you're anticipating an existential treatise along the lines of Terrence Malick's _The Thin Red Line_ (1998), you'll be severely disappointed. Malick's masterpiece is, for my money, the greatest war picture ever made precisely because it subverts at every moment what a war picture is supposed to be. It's about the war within rather than the war without, about nature's indifference to humanity's self-destruction, about the damage war does not to the mind or the body, but the soul. _1917_ is nowhere near this kind of thematic complexity, it's not even playing the same game, but I would value its simple individualised insights above something like the empty temporal trickery of Christopher Nolan's _Dunkirk_ (2017), which leans far too heavily into the \"keep a stiff upper lip chaps\" style of British filmmaking for my liking.\r\n\r\nIn terms of problems. I've seen some critics argue that the one-shot structure is a gimmick which draws attention to itself, and thus, rather than being immersive actually has the opposite effect. I admit that the film does take a little getting used to, but you soon settle into its rhythms (or lack thereof). I would agree that the story is paper-thin, but that's pretty much by design. One criticism I did have, however, is how well-groomed Scholfield and Blake constantly are, each with a perfect set of teeth. One only need watch Peter Jackson's _They Shall Not Grow Old_ (2018) to see how unrealistic this is. Indeed, for most of the runtime, the duo look like they've just stepped out of the makeup trailer, and it's glaring enough on a couple of occasions to pull you out of things.\r\n\r\nAll things considered though, I thoroughly enjoyed _1917_. I thought the single-shot strategy worked exceptionally well, and even if the film is weak from a character/storyline/theme perspective, it didn't really matter when the form and content are this well matched. This could have become an empty technical exercise predicated on nothing, but Mendes hasn't allowed that to happen, and instead, it's a war film that does justice to its subject. The more one knows about the Great War, the more one realises that it was hell on Earth. _1917_ doesn't make us feel what that hell was like. Because no film, no art form, can do that. But it's a damn good approximation.",
                "id": "5e28f6959638640019ab1d5b",
                "url": "https://www.themoviedb.org/review/5e28f6959638640019ab1d5b"
            },
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nLet me just take a deep breath... Wait, one more... Uff, I have no idea how I survived this IMAX screening of 1917. Usually, I don't delve deep into technical stuff since most people don't know or don't care about these attributes, but it's impossible not to address Roger Deakins' cinematography. It's not the first time a film has been edited to appear as \"one shot\" (a continuous take), but it never fails to impress me.\r\n\r\nAlejandro G. Iñárritu's Birdman, Silent House starring Elizabeth Olsen, or the famous Rope from the one and only Alfred Hitchcock... all produce the same trick. Even Mr. Robot and The Haunting of Hill House have brought us two phenomenal \"one shot\" episodes, edited as well with the so-called \"stitches,\" meaning that the actual cuts are made to look invisible to the viewer, hence giving that feeling that it's all just one continuous take. Cuts are often applied when a random character is passing in front of the camera; when the latter \"pans\" (movement similar to a head-turn) over a wall or an object that occupies the whole screen; or when the characters are simply going through a dark area.\r\n\r\nSam Mendes, Roger Deakins, and Lee Smith (editor) all work together to deliver the most immersive war movie (probably) ever. Yes, it has a simple premise, and the main narrative is basic, but the remarkable technical achievement elevates this film so freaking much. Even if you don't know the slightest thing about filmmaking or how movies are made, it's impossible to watch this film and not think \"something feels different about this one.\" This is a movie meant to be watched at the biggest, best screen possible. Watching 1917 at home on a TV or a laptop is not going to work at all.\r\n\r\nThroughout the whole runtime, I felt like I was there with Schofield and Blake. It feels like we are a third soldier going with them on a vital mission to save thousands of lives. I believe 1917 is the best \"one shot\" film to date (I've been using the quote signs for a reason, don't mistake it for an actual one shot movie), with Birdman as a close second. If the latter deals with a lot more dialogue and acting, the former has dozens of nail-biting sequences featuring shootouts, explosions, and a lot of running/walking/swimming through mud, dead corpses, blood, and way too many nasty rats.\r\n\r\nI really have no words to describe Roger Deakins' cinematography. It's not merely a film, it's a whole experience. It's not just another cool technical achievement. It's the entire foundation of 1917, and the main reason why so many people are rushing to the theater. However, a lot of people are completely ignoring Lee Smith's work. Don't forget, this isn't an actual one shot movie. If it's been edited to look like one continuous take, and if it actually does appear to be a single take, then the editor should get as much recognition as everyone else. Yes, he doesn't have to work with thousands of cuts (I counted 14, but I'm sure there's more), but they still exist, and he has to make sure no one feels them. And he did so perfectly.\r\n\r\nMy last paragraph concerning the technical aspects has to go to Sam Mendes and Thomas Newman. As the director, Mendes is able to deliver precisely what he envisioned and seamlessly coordinate his actors. Not only has he directed my favorite Bond film (Skyfall), but he also offers one of my favorite war movies of all-time. As for Newman, I just wish that Joker had been released in another year because 1917's score is fantastic. Hildur Guðnadóttir is likely taking the Oscar for Best Original Score, but if Thomas Newman takes it, I'll still be delighted.\r\n\r\nA lot of comparisons are being made with Christopher Nolan's Dunkirk. They're similar films regarding the fact that their main goal is to provide the most immersive war experience. Story and character-wise, both movies don't really develop that much. Nolan's film is loved by most critics and audiences all around the world, but one common complaint about it is the lack of character building. I didn't mind that at all because the movie never actually tried to make their characters important. They were just soldiers caught in the worst of situations, similar to 1917. However, I do think the latter does a better job of making us care for the protagonists.\r\n\r\nGeorge MacKay and Dean-Charles Chapman's characters have small arcs, but they exist. In the beginning, Blake is the emotional-driven character, while Schofield seems to be the rational one. We, as the audience, care about the mission first, but as time goes by, we learn about their personal traits and motivations. By the end of the film, I was crying. Both play off of each other really well, but it's their dialogue that impresses me the most. What seems to be just a random talk while strolling through an open field of grass, it truly isn't. If it's not meaningful at the time, it's going to be. The acting is more physical than anything, and both deliver outstanding performances.\r\n\r\nI would say I love 1917 as much as I love Dunkirk. I might be tempted to choose the former due to the \"recency effect,\" but there's one small aspect that negatively affects both. Their replay value is not as high as other films since their technical achievements don't work as well on a regular TV in the comfort of our own home. You will never feel or understand that \"immersive experience\" that everyone talks about. You won't know what made people to be blown away. You won't love it as much as everyone else. So, please, do NOT miss 1917 in theaters!\r\n\r\nSam Mendes, Roger Deakins, and Lee Smith. Director, director of photography, editor. Three key filmmaking roles in the creation of one of the best WWI movies of all-time. Edited to look like one continuous shot, 1917 is a mind-blowing technical achievement, elevated by Deakins' always jaw-dropping cinematography, Thomas Newman emotionally powerful score, Mendes impeccable directing, and Smith's seamless editing. George MacKay and Dean-Charles Chapman deliver outstanding (physical) performances, but it's the astonishing filmmaking that steals the spotlight. Production design, costume design, sound, you name it. Everything is absolutely perfect. It's meant to be seen at the biggest screen near you since this is an incredibly immersive experience that you won't get at home. It's going straight into my Top10: Best Movies of 2019, and I hope you'll love it as much as I do.\r\n\r\nRating: A",
                "id": "5e2c813e1685da0011e6f0bf",
                "url": "https://www.themoviedb.org/review/5e2c813e1685da0011e6f0bf"
            }
        ],
        "total_pages": 1,
        "total_results": 5
    },
    {
        "id": 475557,
        "page": 1,
        "results": [
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nObviously, Joker is one of my most anticipated movies of 2019. I mean, how couldn't it be?! Besides belonging to the superhero genre, DC has been on a streak of great films within its universe, so an isolated installment definitely excites me, especially about one of the evilest villains ever. It's by far one of the less comic-book-y flicks of the century. It doesn't follow the generic origin story formula, it avoids any cliches associated with the genre, and it's the type of movie that's becoming more and more rare nowadays. It's a character study like we haven't seen in a long time.\r\n\r\nI'll simply begin with the person that elevates the entire thing: Joaquin Phoenix. Now, if there's something I'm not going to do is compare his performance with Heath Ledger's. That's the number one mistake people are going to keep making forever. First of all, The Dark Knight and Joker couldn't be more distinct films, even if they belong to the same genre (despite Joker being unique, it's still about a famous comic-book villain). Then, despite Phoenix and Ledger portraying the same \"version\" of the clown (crazy, sadistic psychopath), the former is 90% Arthur Fleck while the latter is 100% Joker, throughout each of their movies. Finally, Phoenix is the sole protagonist of this feature, while Ledger had the best live-action Batman sharing the spotlight.\r\n\r\nIn conclusion, it's both unfair, and a bit unreasonable to compare both interpretations since their roles have a different impact on the narrative, as well as each film being entirely different. In the end, both are impressive. However, let's switch to Phoenix since he's the star of this show … He has 2019's best performance, by far! With a strong marketing campaign, I'm sure he'll get that Oscar. I hope so! It's so well-deserved. Todd Phillips and Scott Silver developed a brilliant screenplay, but Phoenix elevates it to a whole other level.\r\n\r\nThroughout the entire runtime, I felt weird. Perturbed. Even uncomfortable with what I was watching and consequently feeling. It's a dark, brutal, violent, emotionally powerful origin of a villain who I feel disturbingly empathetic towards. Phoenix makes the story work due to its remarkably captivating display of someone who's mentally ill. Arthur Fleck slowly becoming crazier is due to how society behaves and not due to some chemical pool that transforms his skin white and hair green (nothing wrong with this, but I know which origin story I prefer). \"The world is getting crazier out there\", and it becomes excruciatingly painful to deal with it, especially when so much is going on with Arthur’s personal life, and most of it he doesn't even realize because he tries to hide everything behind a smile.\r\n\r\nIt's a screenplay filled with narrative twists that not only pack a punch of surprise but leave you feeling extremely upset. The last act is one of the best in the last few years. If the second act is an enormous build-up, the last one is a terrific payoff. I can't remember the last movie I saw where I loved 100% every single narrative decision. I wouldn't do any of the big moments differently. There are so many excellent references hidden in plain sight that comic-book fans (and fans of the TDK trilogy as well) will love just like I did. In the ending, there's one pivotal moment in particular that serves as the absolute climax … I got chills all over my body. They couldn't have done that scene more perfect. I only have one tiny nitpick with the way some scenes feel repetitive since they neither move the plot forward or give us anything new. Some of these still help to create tension, some feel like they're just… there.\r\n\r\nA Best Picture and Best Actor nominations seem to be on its way, but these are not the only achievements that deserve to be recognized. The original score by Hildur Guðnadóttir is incredibly addictive, so much that I'm listening to it while writing this review. It definitely helps to generate tremendous build-up, and it elevates the sinister environment of Gotham City. Lawrence Sher's cinematography is utterly stunning. The underexposure of some scenes is glorious. Sher paints the screen with so many gorgeous shots, especially with his close-ups on Phoenix, where the latter is able to shine. Jeff Groth is also impeccable in the editing room. There are several long takes with Phoenix just giving his all and letting all his emotions out (or keeping them all contained), which is always something I deeply appreciate since it helps with the flow of the narrative.\r\n\r\nRegarding the film's controversy surrounding its messages and the incentive to violence, I really don't know what to say. It's ridiculous. I remember those times when going into the movie theater was a surreal experience. It was the number one place for people to forget about their lives, jobs, everything. Joker is a fictional story! It's the origin of one of the worst psychopaths in the history of comic-books and cinema. If people expected to leave the theater \"happy\" or \"joyful\", then at least one of the film's message is right: society really is getting crazier. Have people forgotten who Joker is? What could you possibly expect from his origin story?!\r\n\r\nNowadays, no one knows how to behave (social media is the primary source for spreading hate). No one respects the fellow citizen or even the world itself. More and more people only look at their own bellies. Political agendas are everywhere. New extreme movements are created every other year. Social hypersensibility is exponentially growing. The same way some people will hate this movie for not being able (or simply not wanting) to accept that they feel empathy towards a murderer, people all around the world behave like their actions don't reflect on another person's life and on their own planet. If people get ruthlessly violent because they watched Joker, how can someone complain that the film's message is bad when it's eventually true?\r\n\r\nAll in all, Joker is one of the best movies of the year, and it's definitely on my Top3 at the date of this review. Joaquin Phoenix delivers my favorite male performance of 2019, by elevating a script about the origin of one of the evilest villains ever. The way he gradually becomes more insane is worthy of study, but it's how he's able to make the audience create empathy towards a psychopath that leaves me disturbingly captivated. Todd Phillips produces a character-study filled with an astonishingly tense build-up and one of the most chill-inducing payoffs of the last few years. With every single narrative decision nailed perfectly, Hildur Guðnadóttir's score and Lawrence Sher's cinematography stand out. The lack of restraint in showing the unmerciful violence (physical and mental) that society inflicts on one another is what makes us feel unsettled. Because we know it's mostly true, and we refuse to accept it. It's not a film about the Joker. It's a very realistic portrayal of someone (anyone!) who can become someone like him. And it's disturbingly brilliant!\r\n\r\nPS: Robert DeNiro (Murray Franklin) and Zazie Beetz (Sophie Dumond) are also great. Phoenix's performance is so mesmerizing that I almost forgot there were other actors in the movie.\r\n\r\nRating: A",
                "id": "5d975abdae26be001abe129b",
                "url": "https://www.themoviedb.org/review/5d975abdae26be001abe129b"
            },
            {
                "author": "solstafir7",
                "content": "Joker. The character that has existed since 1940, has become so heavy with so many different portrayals, different origins, that it feels impossible for any mortal man alive to impersonate the scattered personalities. It is an insurmountable task for any director to digest it all and still produce one more.\r\n\r\nTodd Phillips had a crazy challenge. He brought in one of the best actors alive to lift it with him, Joaquin Phoenix. Together, they have built a mass-market masterpiece which is just above the crop. It is appropriately crazy and completely focussed on the central character. The narrator goes close to the shores of that craziness, wets his feet but remains dry to tell this story. It is like those news reporters which go closer to the burning amazon, but it is impossible to step in the fumes. In no way, Joker is telling his story. Instead, his story is told to us and there are pillars of sanity (like the detectives, asylum clerk etc.) which remain steadfast to give a strong anchor to the audience. This dilutes the effect of the film.\r\n\r\nWith the copious amount of material on Joker already, I wished to consider this film as a standalone character study vaguely inspired by the batman universe. But this is not entirely possible. I was forced to think about it on two levels. With Batman and Without Batman. \r\n\r\nWith Batman, The Joker is on the home turf. There have been many renditions of Joker, and Heath Ledger's portrayal is still vivid in my mind. I knew that Arthur here will go on to become someone who is going to say, “‎Introduce a little anarchy. Upset the established order, and everything becomes chaos. I'm an agent of chaos...”. When I was thinking Joker in the context of Batman, I could not keep Ledger's joker too far away. I was searching for a path for Arthur to go from the mentally unstable to the calculating anarchist. I was left searching for that path when the movie ended. To remain as the crown prince of crime, and to justify the title of the greatest adversary of Batman, just mental instability isn't good enough. He needs to be much more intelligent, much more cunning. These traits are often visible early, In the case of Arthur, I could not find that complete foundation upon which the later psyche can stand. This reminded me of Cameron Monaghan's Jerome Valeska. The joker of my understanding is somewhere between the cruelty of Jerome and pitiable delusions of Arthur. Also, the iconic Batman moment was not needed in this. I kept feeling that Joker is trying to stand with the support of Batman's tale as a clutch. A safety net enforced by the producers.\r\n\r\nOn the other hand, if I consider this movie as a standalone tale, then it was a bit more satisfying. There are tearjerker movies where nothing good ever happens with the protagonist. A series of bad lucks, or difficulties keep blocking a normal life. He is most definitely poor, has a sub-optimal family background, has a medical affliction which is unique and provides a foundation of the pity I felt. This is not very far from Rani Mukharjee's Hichki if you only consider the medical condition. Rani's Naina had Tourette syndrome while Joaquin's Arthur suffers from pseudobulbar affect. The setting and genre make the two films vastly different. More often than not, I have noticed these disorders lift a lot of burden from the narrative. In the case of Joker, couple his disorder with usually being in the wrong place at the wrong time, you have a travesty of human life. Add to that, an unstable parent, amplify it with the volatile societal conditions, you have a perfect decoction of what Joker is made of. As a tale of its own, it works. The delivery is great thanks to the spectacular performance. It also helps to increase the awareness of mental health. But when you strip off all the Batman context, it remains a well-acted and averagely written tale. \r\n\r\nUnfortunately, this is a single film, and I felt it is torn between these two polarising treatments. It wants to find its ground, which it finds. But that ground is far from being sensational. It remains somewhat indecisive. It can not be well soaked in Batman lore like James Gordon's tale, Gotham is. I am considering Gotham because both Gotham and Joker do not feature Batman, but they both have Bruce. Gotham understands its lore and fully embraces it but Joker does not want to. At the same time, as a tale of the psychologically troubled protagonist, Joker tries to play safe with the aim to please audience en-mass. I kept thinking about American Psycho and The Machinist. (Coincidently, both star ex-Batman Christian Bale). Those two take you in the psyche of the protagonist. Those take you inside the burning Amazon and not stand at a safe distance. Joker does not aim to do so. \r\n\r\nI am not at all qualified to talk about the acting performances. Joaquin Phoenix is in every frame and the way he waltzes between emotions is terrifyingly amazing. The Tai Chi to calm himself down, the menacing stare when finally becomes the Joker, those are chilling. He lives the character to the best of his abilities. Regrettably, he does not have the same level of writing support which Heath Ledger had and so due to no fault of his own, Joaquin could not topple Heath Ledger's portrayal of the crown prince of crime.\r\n\r\nIf I consider Todd Philips's entire resume, this was a genre shift for him. He knew very well that the biggest trump card is Joaquin Phoenix, so he takes no risk. He keeps him in focus, almost always all the setting and cinematography works for him. The only exception being Robert De Niro. Robert is allowed to carry his scenes quite independently. I think Todd Philips relied on both these giants to carry their parts. Sadly, I had gone to a theatre which had a bad print or screen so I think I will have to watch it again sometimes to enjoy the cinematography.\r\n\r\nI realised, I kept writing a lot and this is already over a thousand words. If you are here and reading still, I must say thank you. To summarise, The Joker worked for me and I enjoyed it, but I would not consider it the best depication of the iconic villain from comic books. The best may yet come.",
                "id": "5dac3463174a870019a7c547",
                "url": "https://www.themoviedb.org/review/5dac3463174a870019a7c547"
            },
            {
                "author": "ikomrad",
                "content": "The Joker is similar to the DC Joker character but is not a criminal genius. The movie was a great depiction of how a person who has been mistreated, lied to, and ignored, totally lacking access to human compassion, can snap. The acting is top notch, and it puts a spotlight on the importance of mental health in modern times.",
                "id": "5db52049d40d4c0014fd08bc",
                "url": "https://www.themoviedb.org/review/5db52049d40d4c0014fd08bc"
            },
            {
                "author": "Sheldon Nylander",
                "content": "Okay, this film has already been so widely debated that I’m not sure what I can really add to the conversation. So, I’ll just give my thoughts.\r\n\r\n“Joker” is a fairly basic character study of Arthur Fleck, a mentally ill man who feels increasingly marginalized by an uncaring and brutal society in Gotham City. To start, the characters, except for Arthur himself, are pretty flat. They seem to have little purpose other than to further Arthur’s story. This includes Thomas Wayne, who in other media is portrayed as a man of many dimensions, wealthy but caring, and instilling these values in his son Bruce. Here, he is portrayed as much more uncaring and elitist. Which gives much less of an impact in the inevitable alley scene we see in everything remotely related to Batman. More on this in a minute. It’s important to the point.\r\n\r\nArthur suffers a condition that makes him burst into laughter at inappropriate times. He also has other unspecified mental illnesses. We’re never given the specifics. This is actually a little troubling because of the general depiction of mental illness. It almost seems like they are saying that if someone is mentally ill then they are a ticking time bomb and it’s only a matter of time before they go off. This is not a good look.\r\n\r\nAfter a series of events, Arthur begins spiraling downward, but at the same time realizes how much influence he can have over other people, an aspect of the Joker that isn’t often explored. And this is where the characters other than Arthur being rather flat comes into play.\r\n\r\nThere’s more than one indication that we are actually witnessing these events through Arthur’s eyes. And this creates a brilliant depiction of a narcissistic personality. The only character that gets fully fleshed out is Arthur himself, but he can’t or won’t connect with other people to see their depth. As such, we get to see narcissism from the inside, no connection to others and in fact seeing them as pawns in his own schemes. It’s subtle and definitely not in your face, but if you look carefully, the hints are there.\r\n\r\nThose who fear that \"Joker\" would glorify incel violence or otherwise can rest a little easier, but as I mentioned, the film isn't without its troubling portrayals. It does vilify the mentally ill, which creates a whole host of other issues. The movie swings wildly between \"excellent\" and just \"okay,\" and sometimes even \"meh.\" As such, it gets a recommendation, but only a mild one.",
                "id": "5dd9cdd528723c0014588c1f",
                "url": "https://www.themoviedb.org/review/5dd9cdd528723c0014588c1f"
            },
            {
                "author": "Leno",
                "content": "*A Masterpiece*.\r\n\r\nThe movie shows the escalating events that made Arthur become the Joker. Initially an inoffensive poor and sick man, Arthur suffered a tide of unfortunate events that pushed him closer and closer to the edge. \r\n\r\nIgnored and despised by everyone, sick and alone in the world, and neglected by the State, Arthur becomes progressively more violent until he breaks.\r\n\r\nMuch more than one more Super-hero movie, *Joker* uses well-known characters to promote the reflection on the \"ignored\" ones. At least, ignored until they become a Joker.",
                "id": "5de278e63faba000150b67f4",
                "url": "https://www.themoviedb.org/review/5de278e63faba000150b67f4"
            },
            {
                "author": "Wuchak",
                "content": "***Not fun, but absorbing, artistic and tragic***\r\n\r\nA mentally troubled middle-aged clown (Joaquin Phoenix) who lives with his mother (Frances Conroy) in Gotham City goes from not good to worse when he finally realizes his true identity. Robert DeNiro plays a talk show host and Zazie Beetz the friendly girl down the hall. Brett Cullen is on hand as Thomas Wayne, Bruce’s rich father.   \r\n\r\n\"Joker\" (2019) is an arty, slow-burn character study of the popular DC Comics’ villain, but it’s more of a psychological crime drama/thriller and tragedy than a superhero flick (or, in this case, supervillain). The movie’s captivating from the get-go and practically everything works for a broodingly superb cinematic experience. \r\n\r\nThere are several amusing bits, but this ain’t a fun flick. It’s heavy and tragic. But what’s the message? Simply that this is how a quirky man who wanted to make people laugh became The Joker. He’s a little reminiscent of the clown in Steve Gerber’s “Night of the Laughing Dead” in Man-Thing #5 (1974).     \r\n\r\nThe movie runs 2 hours, 2 minutes, and was shot in New York City (Bronx, Harlem, Manhattan) and nearby New Jersey (Jersey City & Newark).  \r\n\r\nGRADE: A-/A",
                "id": "5df59eaad1a89300197854b5",
                "url": "https://www.themoviedb.org/review/5df59eaad1a89300197854b5"
            },
            {
                "author": "JPV852",
                "content": "_Joker_ is a tour-de-force of a movie, not quite like anything I've seen, maybe since Taxi Driver. At its core it's a movie about the breaking point of a broken man, wrapped under the banner of a comic book movie that, take out the Waynes, works on its own.\r\nJoaquin Phoenix truly gives a transformative performance (not unlike Heath Ledger) and will say is deserving of an Academy Award. The supporting cast all did well, though, and it is a small role, Zazie Beetz was great and De Niro had his moments, particularly at the end.\r\n\r\nGot to hand it to Todd Phillips, between this and the good, albeit flawed, War Dogs, has proven to be more than those Hangover movies.\r\n\r\nNo, this isn't a feel-good movie and while it does sit at the top of my 2019 list, not entirely sure when I'd revisit. **4.75/5**",
                "id": "5e0e888768188800145829f8",
                "url": "https://www.themoviedb.org/review/5e0e888768188800145829f8"
            },
            {
                "author": "Matthew Brady",
                "content": "the ‘Hangover 2 & 3’, the two most uncomfortable comedies he’s ever directed that felt more crime drama than anything funny. There’s also some dark humor in ‘Joker’ that involves a door chain. It’s silly, yet absolutely terrifying with the given context. A complete departure from his other work and that’s why I think it’s one of his best. I honestly think he made something so unique and meaningful. Seriously, I do.\r\n\r\nThe score by Hildur Guðnadóttir helped set the tone tremendously. A melancholy tone with a chaotic twist. A representation of Arthur slowly drowning in his own misery and pain. A little fun fact: The score for the film were written based on the script even before the actual filming of the movie started, which I think is the best way to do it, if you ask me. Someone to imagine movie by songs and incorporate their interpretation through music.\r\n\r\nThe cinematography was gorgeous and there’s a handful of shots that has imprinted into my memory. Lawrence Sher does an excellent job off showing the decaying Gotham city and the sewer waste look of the city. Bright neon lights with striking colors that manage to make the most run down of places look pretty.\r\n\r\nI like how they actually gave Thomas Wayne a character rather than “guy gets shot in alleyway”. He’s portrayed as a ruthless man with blunt ways of saving Gotham City. However he loves his wife and son, so his unforgiving attitude was all for the shake of keeping his loved ones safe. He’s also a massive movie buff where he often goes to watch the classics on the big screen. So it’s an interesting take on the character viewed in somebody’s else perspective.\r\n\r\nThere’s a scene where Arthur goes to watch a comedy standup show to take notes on a comedians act. Every time a joke is told and everyone laughs, his face is frozen in place with an unsure grin while his eyes look around the room wondering why everyone’s laughing, but when the laughter dies down he jumps to live with a delayed laugh. It’s moments like that are simple, yet says a lot about him. Basically showing how disconnected he is with humor and everyone else.\r\n\r\nNow lets talk about the controversy that's been surrounding this movie:\r\n\r\nThis is one of the most ludicrous controversy in recent memory. The movie will not cause or inspire violence, but shows why violence happens. I mean, there probably has been incidents when somebody committed a horrendous crime because their were influenced by a movie or a game. However, it’s he/she that should be brought into question, not the creators. Maybe this movie could inspire people to think twice about how they treat others. Why not think about the positives? If “Joker” is going to be responsible for violence and mass shootings, then so is every other movie with any form of violence ever. If people really care about how violence is portrayed in movies, then Rob Zombies ‘3 From Hell’ should also receive the same attention. Just imagine ‘Natural Born Killers’ times 100, but I guess it’s not mainstream enough for any of that. And sure, there’s some brutal and raw approach to violence in ‘Joker’, but we all have seen worst. ‘Deadpool’ is more graphic than this. It's not the directors duty to teach morals to the viewer. People will never learn to stop pointing fingers at things to blame and actually do something about it! People often understandment how much power their got.\r\n\r\nAnywhere, sorry about that folks, just had to get that off my chest. Go and check it out.\r\n\r\nOverall rating: “Send in the clowns” ⇠ you’ve gotta sing that like Frank Sinatra.",
                "id": "5e2f26e44ca676001249c3c2",
                "url": "https://www.themoviedb.org/review/5e2f26e44ca676001249c3c2"
            },
            {
                "author": "lamachat",
                "content": "It is intersting to analyze this movie in a context of global increase of violent social movements against the Establishment. Joker succeed in making me accept a violent reactions without really explicit political fundation.",
                "id": "5e31cc72c56d2d001851772a",
                "url": "https://www.themoviedb.org/review/5e31cc72c56d2d001851772a"
            }
        ],
        "total_pages": 1,
        "total_results": 9
    },
    {
        "id": 546554,
        "page": 1,
        "results": [
            {
                "author": "SWITCH.",
                "content": "This is a crime thriller that’s been a long time in the making. Mystery fans rejoice: ‘Knives Out’ is an impeccable cinematic achievement, laced with sardonic wit, division and conflict, and of course a perplexing puzzle. This is easily one of the most fun films of 2019 - it’s both a brilliant piece of entertainment and beautifully crafted enigma. Sit back, relax, and try to crack the code.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-knives-out-a-whodunnit-worthy-of-agatha-christies-hercule-poirot",
                "id": "5ddbc870aad9c20012c232bd",
                "url": "https://www.themoviedb.org/review/5ddbc870aad9c20012c232bd"
            },
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nKnives Out has been shown in numerous festivals, and it received massive acclaim in literally every single one of them. Therefore, its hype grew more and more until its wide release date. Before the film, I can’t deny that I was indeed affected by the whole “a whodunnit like you haven’t seen in years.” I went into the theater with high expectations, not only due to the festival praise but due to its jaw-dropping cast. It’s uncommon to possess such a renowned ensemble and deliver a “bad” movie, especially when Rian Johnson is writing and directing it (yes, I like The Last Jedi, and even if I didn’t, he did other stuff, you know?). It’s one of those films everyone knows it’s going to be appreciated by a considerable part of the world.\r\n\r\nEven the genre itself is a very welcome type of cinema entertainment in regards to both critics and the general public. So, does it live up to its hype, or it fails to reach such high expectations? Knives Out is one of the best movies of the year, as well as one of the best mystery-suspense stories of the millennium (everyone is doing the whole “best X of the decade,” I’m going one step beyond). This is a film I know I’m going to rewatch countless times throughout the next years. Usually, when it comes to whodunnits, people are misled into thinking that from the moment they know who “did it,” the movie loses its interest. This is rarely true, and Rian Johnson succeeds because he doesn’t need the ultimate reveal to deliver a great story.\r\n\r\nThis screenplay is definitely getting tons of nominations and wins during the awards season. Every little line of dialogue means something. Every single character says or does something impactful to the narrative (except for Jaeden Martell’s). It’s been half-a-day since I’ve seen it, and for every question that my brain comes up with, there’s an answer lying on someone’s words or actions. It’s such an intricate, complex, extremely subtle script. One with so many tiny, little details that it’s impossible to catch them all on a first viewing.\r\n\r\nI genuinely love the first act, even if it’s the one where I have a minor issue. Rian Johnson doesn’t waste time and puts us directly in the crime scene, interviewing each and every member of the family. It’s through these interrogatories that he cleverly introduces the suspects, developing them solely through masterfully written dialogue, and outstanding performances. For example, with a single sentence and a particular body/face expression, Toni Collette instantly creates a profile of Joni, her character. Rian plays with character-types and cliches in such an intelligent manner. He makes us think a particular character follows a specific cliche, then it doesn’t, then it does again…\r\n\r\nThat’s one of the reasons I couldn’t figure out the mystery until the last act reveal. Every time I was close to indeed follow the right path, new developments arise, meant to mislead, confuse, and create doubts. Some people feel better with themselves if they solve the case before the film. They feel “intellectually superior” just because they found out before everyone else. First of all, I prefer being fooled and end up blown away by an unexpected conclusion than solving the whole thing way before time’s up and end up disappointed and bored. Then, honestly, anyone who says, “I guessed it,” there’s a 99% chance that they’re either lying or not answering correctly to the question “who killed Harlan?” If you’ve seen the movie, you’ll understand what I’m trying to express.\r\n\r\n(I don’t want to sound presumptuous or hypocritical. I’m not trying to say, “I couldn’t figure it out, so no one can.” Please, if you haven’t seen the film, judge the previous paragraph after your viewing.)\r\n\r\nThroughout the second and third acts, loose ends start to tie up, ending up with a brilliantly delivered reveal. From the marvelous cinematography (with those classic close-ups when a character is about to say something meaningful or tell a story through their imagination or memory) to the remarkable editing, the team behind Rian Johnson did a phenomenal job. The suspense is held at high levels, and it reaches limit-breaking points with Marta Cabrera’s (Ana de Armas) narrative. Armas and Daniel Craig deliver the standout performances, with Chris Evans (Ransom) following right behind. Literally, everyone else offers excellent displays, and help carry a story filled with mystery, but also with a lot of humor.\r\n\r\nHowever, I have to emphasize how astonishing Ana de Armas and Daniel Craig are. Ana might be a bit unknown to most people. I’ve been supporting her ever since Blade Runner 2049, so I’m ecstatic that she finally got a major role in a big movie, especially within an ensemble of actors with legendary careers. Craig, who could have just delivered a slight variation of the character he’s been playing for years, instead offers a unique take on the Detective role. Just like Evans, both have been playing iconic characters for years, so it’s sort of an extra joke to everyone who watched Captain America and James Bond for the past decade or so.\r\n\r\nMy only minor issue has nothing to do with the political undertone and the social messages Rian Johnson puts in this film. Honestly, I love that aspect of it. It’s like Rian knew some people would complain about it, so he made sure to have a couple of characters (Jaeden Martell’s Jacob and Katherine Langford’s Meg) somewhat resembling the so-called snowflakes and all that. No, my issue is related to some excessive exposition regarding the first act’s interrogatories. It’s great that every character gets their own motivations, but it feels like each confrontation with the detectives went on for a bit too long. Some pieces of the mystery might be a bit hard to believe that they would occur, but these are all nitpicks in a remarkable movie.\r\n\r\nIn the end, Rian Johnson is able to bounce back from the divisive The Last Jedi with one of the best whodunnits I’ve ever seen, Knives Out. Rian proves that not only he’s a talented filmmaker but also a phenomenal screenwriter. With a renowned and impressive ensemble cast, Daniel Craig and Ana de Armas are standouts within all of the other outstanding performances, Chris Evans being right behind. With one of the best screenplays of the year, the mystery at its center keeps everyone extremely captivated until the very end, even if you guess “who did it” beforehand. Masterfully written dialogue, remarkable editing, and great use of classic cinematography techniques. It’s an entertaining story with tremendous replay value and significant political/social layers that only elevate the already complex yet subtle narrative. Don’t miss it!\r\n\r\nRating: A",
                "id": "5de52e200cd44600123b777e",
                "url": "https://www.themoviedb.org/review/5de52e200cd44600123b777e"
            },
            {
                "author": "Gimly",
                "content": "I did not think that _Last Jedi_ was a very good movie, but I have always been a fan of Rian Johnson. And honestly? _Knives Out_ is a strong contender for his best work yet. I have never seen a whodunnit like this before. Seeing this in a theatre was the poppy-poppy-paper of movie-going experiences, because I so enjoyed that. \r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._",
                "id": "5e0765984c1d9a0013e1cec8",
                "url": "https://www.themoviedb.org/review/5e0765984c1d9a0013e1cec8"
            },
            {
                "author": "Matthew Brady",
                "content": "“This case is like a donut\r\nwith a hole\r\nin the middle of a donut hole.\r\nActually,\r\nit's a donut within a donut's hole.”\r\n\r\n‘Knives Out’ subverted my expectations...in a good way. A smartly written whodunit movie that manages to be both humorous and classy. The kind of murder mystery that never fails to entertain. Pleasing both cinephiles and mainstream audiences. Perfectly balance, as all things should be. It basically pulls a Hitchcock on us.\r\n\r\nRian Johnson is a great director, but at times has silly ideas. On the other hand, when given the right material I think he’s a great director and writer. He’s also a clever man, but never came off as annoying. The dialogue was so sharply written that I could tell the cast loved every minute of soaking up and delivering these lines. The cinematography was nothing short but beautiful and will often linger in rooms of the house which helps the audience immerse in the overall setting.\r\n\r\nOne of the tightest scripts of the year with raw humor and a satisfying mystery/comedy.\r\n\r\nThe cast is stellar, but the main stand outs for me were Daniel Craig, Ana de Armas, and Chris Evans. I loved Daniel Craig’s Southern drawl which I didn’t expect at first, but I was amazed of how far he went for it. Often times it reminded me of Frank Underwood from ‘House of Cards’. He plays detective Benoit Blanc, AKA CSI: KFC. At one point during the movie he delivers one of the funniest monologues in the entire movie, which was brilliantly delivered by Craig. He should seriously try out more comedy roles.\r\n\r\nDose anyone remember when Ana de Armas starred in Eli Roth’s ‘Knock Knock’? Well look at her now. She was absolutely excellent in this movie. The running joke throughout the entire movie is her character can’t lie and whenever she dose, she vomits on the spot. How ironic, yet I love the comedic irony behind it.\r\n\r\nChris Evans plays a spoiled child with a slimy grin during the worst situations. The over privilege black sheep of the family. This is very against type for Evans, especially when his character hates dogs, which I would imagine being difficult for Evans since he’s a dog lover in real life. Also the different sweaters he wears in every scenes was impeccable.\r\n\r\nThe rest of the cast manage to shine individually in this crowded movie. Although at times some of them felt like background wall paper compared to others. However that never takes away from what else ‘Knives Out’ has to offer.\r\n\r\nToni Collette dose a great impression of Gwyneth Paltrow. Michael Shannon plays a wimpy son to a crime-writer Harlan Thrombey (Christopher Plummer). Despite the small screen time, Plummer is still charming as always. While Jamie Lee Curtis and her character brings the dramatic elements into play. She’s uninterested in the humorous quarrel during the grim situation, as early on she reminds everyone that her father just died.\r\n\r\nJudging it as a whodunit mystery, the pay off itself is slick. The events leading to the death are revealed early into the movie, and instead Johnson remains steps ahead from the audience. There’s an underlining social commentary beneath the foul play. The themes of privilege and underprivileged with the sour taste of bitterness throughout. Nothing deep or new, but at least is trying to say something rather than being one thing.\r\n\r\nOverall rating: My House. My Rules. My Coffee!!!",
                "id": "5e2f2c3f98f1f1000ffd1ab3",
                "url": "https://www.themoviedb.org/review/5e2f2c3f98f1f1000ffd1ab3"
            }
        ],
        "total_pages": 1,
        "total_results": 4
    },
    {
        "id": 38700,
        "page": 1,
        "results": [
            {
                "author": "SWITCH.",
                "content": "The list of what's wrong with 'Bad Boys For Life' is long and varied, but it's not all bad. There were some good lines, and the scenes where Mike and Marcus were together obviously shine in an otherwise dull film. Fans will also go nuts when a character from a previous 'Bad Boys' film makes a return cameo appearance. Look - 'Bad Boys 2' was one of those rare films where the sequel was better than the original, so there were a lot of high hopes riding on #3, especially given the exceptionally long period between drinks. But I'm afraid all those expectations have been crushed, and what's left is a mediocre offering that will go down as the third best 'Bad Boys' film... possibly until 'Bad Boys 4' arrives.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-bad-boys-for-life-whatcha-gonna-do-when-theres-nothing-new",
                "id": "5e1f061b5c071b001663faeb",
                "url": "https://www.themoviedb.org/review/5e1f061b5c071b001663faeb"
            },
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nI was never a big fan of the Bad Boys films. Firstly, I'm not too fond of Michael Bay as a director (as a producer, he's fine). The way he directs his action sequences is incredibly choppy, filled with questionable CGI, very hard to follow, and we all know his passion for exploding everything. Oh, and I can't forget about the constant product placement (amazing how in a brutal explosion, everything is destroyed except a gorgeous-looking Audi car that remains intact). Secondly, the storytelling always felt extremely generic and unsurprising. So, obviously, my expectations weren't very high…\r\n\r\nMaybe that's why I enjoyed Bad Boys For Life way more than I anticipated. This movie should be a lesson to the Fast and Furious franchise. To make a mindless entertaining action flick, the lighthearted tone has to be well-established from the get-go. Despite the fact that the third act deals with absurd emotional twists worthy of a Mexican soap opera, the screenwriters are able to find just the right amount of harmless fun. I didn't watch a single clip before the film, and ten minutes in, I acknowledged that its goal was to simply be entertaining without taking itself too seriously.\r\n\r\nAdil El Arbi and Bilall Fallah balance the more dramatic family issues with the ludicrous action very well. The latter sequences are much better than Bay's. The car chases, even when containing a few too many cuts, are relatively easy to follow, and they pack that necessary adrenaline rush. There are a few surprising shootouts that are filmed to make them look like one take, which definitely brings something pretty uncommon to this kind of formulaic action movies. Technically, I think both directors did an excellent job, especially considering that this was their debut feature film.\r\n\r\nHowever, the story brings everything down. I believe Mexican soap operas might have better scripts. The dialogue reaches such a cringe-worthy level. Every essential plot information is given either through lazy character interactions or by that magical computer that every generic action movie possesses with which the main characters can basically know everything about everyone at the click of a few buttons. The comedy is quite hit-and-miss to me, a lot of the jokes didn't land, but some did make me chuckle. Overall, the screenplay is as cliche as it could be, and that last shot… I hate it. In the end, it's the cast who saves the boring narrative.\r\n\r\nWill Smith and Martin Lawrence share fantastic chemistry, and their banter is always entertaining to watch, even if it isn't as hilarious as it could be. I liked Lawrence more than Smith, maybe due to the non-action, family comedy bits that worked seamlessly. Nevertheless, it's dumb fun, and it's plainly visible that the actors had a blast shooting this movie. The whole cast transfer the joy that they had on set to the screen, and it's pretty noticeable. Watching Alexander Ludwig (Dorn) outside Vikings is always a pleasure (I so wish that he gets more important roles in the future), and the whole AMMO team (Vannesa Hudgens, Charles Melton, Paola Nunez) is all compelling enough, even if the characters are two-dimensional.\r\n\r\nIt's simple: whether you enjoy the Bad Boys saga or not, this is undoubtedly the best installment of the franchise. If you go to the film theater with basic expectations of having fun, Bad Boys For Life gives you that, so I recommend it. It's a pure popcorn-entertainment action flick with recognizable actors who all share great chemistry. With Michael Bay out of the director helm, Adil El Arbi and Bilall Fallah deliver surprisingly good action sequences, considering this is their debut feature film. The formulaic, cliche, soap opera story is straight-up ridiculous at some points, and it carries such an aura of predictability that when it tries to introduce an emotional twist, it merely becomes absurd. The last shot feels like a call to Hollywood to make more sequels, which sort of ruins the whole \"Bad Boys one last time\" tagline… I'm extremely undecided on which side this review should fall, so I'll base my decision on the answer to the following question: \"Am I going to (want to) see this movie again or another sequel?\" Honestly… no.\r\n\r\nRating: C+",
                "id": "5e2099dc0102c900163d1076",
                "url": "https://www.themoviedb.org/review/5e2099dc0102c900163d1076"
            }
        ],
        "total_pages": 1,
        "total_results": 2
    },
    {
        "id": 449924,
        "page": 1,
        "results": [],
        "total_pages": 0,
        "total_results": 0
    },
    {
        "id": 359724,
        "page": 1,
        "results": [
            {
                "author": "SWITCH.",
                "content": "A biography on American underdogs from a blue-collar industry with notable actors, an impressive production team, and an inspiring story; did someone say Oscars? Whatever its intent, ‘Ford v Ferrari’ is an impressive biopic that rarely strays from its path. A melding of entertainment and creativity, this should be considered both a commercial and critical success. Fire up your engine and race to the cinema to catch this film that everyone’s sure to be talking about.\r\n- Charlie David Page\r\n\r\nRead Charlie's full article...\r\nhttps://www.maketheswitch.com.au/article/review-ford-v-ferrari-a-racing-biopic-thats-right-on-track",
                "id": "5dc6954a99259c001380a087",
                "url": "https://www.themoviedb.org/review/5dc6954a99259c001380a087"
            },
            {
                "author": "Stephen Campbell",
                "content": "_**I'd have preferred to see Michael Mann's version, but this is an impressive and heartfelt study of friendship and triumph**_\r\n\r\n>_Next year, Ferrari's ass is mine._ \r\n\r\n- Carroll Shelby, after losing to Ferrari in the 1964 World Sports Car Championship\r\n\r\n>_To take control of this materialised energy, to draw the reins over this monster with its steel muscles and fiery heart - there is something in the idea which appeals to an almost universal sense, the love of power._\r\n\r\n- A.J. Baime; _Go Like Hell: Ford, Ferrari, and Their Battle for Speed and Glory at Le Mans_ (2009)\r\n\r\nIn 2015, a long-gestating project was announced as entering pre-production – based on Brock Yates's 1991 book _Enzo Ferrari: The Man, the Cars, the Races_, the film was tentatively called _Enzo Ferrari_ and was to be written, produced, and directed by Michael Mann (_Heat_; _The Insider_; _Ali_). A long-time racing fan, Mann had been trying to bring Ferrari's story to the screen since the book was published (in 1992 it was reported that Robert De Niro was circling the role and Mann would begin shooting right after he completed work on _The Last of the Mohicans_), but in 2015, things seemed to finally be moving ahead. Christian Bale was cast as Ferrari and Noomi Rapace as his mistress, Lina Lardi. And then, nothing. Time passed and no more was heard until 2017, when it was announced that Bale had dropped out and been replaced by Hugh Jackman. And again, nothing. In the meantime, a different film was greenlighted – an adaptation of A.J. Baime's 2009 book, _Go Like Hell: Ford, Ferrari, and Their Battle for Speed and Glory at Le Mans_. Set to star Tom Cruise and Brad Pitt, it was to be written by Jason Keller (_Machine Gun Preacher_; _Mirror Mirror_; _Escape Plan_) and directed by Joseph Kosinski (_Tron: Legacy_; _Oblivion_; _Only the Brave_). That version of the project never got off the ground, but in 2018, it was announced that James Mangold (_Cop Land_; _Girl, Interrupted_; _Logan_) had signed on as director, working from a new version of Keller's script, written by Jez Butterworth and John-Henry Butterworth (_Fair Game_; _Edge of Tomorrow_; _Get On Up_). Rather confusingly, none other than Christian Bale is in the cast, although not as Ferrari, whilst Mann himself is credited as an executive producer. Is this (at least in part) the remnants of his own film? Is his credit related to nothing more than rights, or was he actively involved in making the movie? Will we still see his _Enzo Ferrari_ at some point?\r\n\r\n_Le Mans '66_ (released in North American with the equally generic title of _Ford v Ferrari_) is an excellently made but unadventurous movie. Mangold is a fine director, but he's no Mann, nowhere near, and the film did, to a certain extent, just leave me pondering what kind of kinetic brilliance Mann would have brought to bear on similar material. In contrast, to Mann's body of work, _Le Mans '66_ could never be accused of breaking any new ground or trying anything especially original – it hits all the beats, it hits them well, but it never strays from the formula. Much as Mann's _Ali_ (2001) was a boxing movie on the surface only, being far more interested in politics and institutional racism, Mangold's film isn't really about motor cars – it's about friendship, male pride, personal integrity, sticking it to the Man, art v commerce, individuals v corporations; it is, in essence, a thematically broad and aesthetically anonymous pre-_auteur_ theory audience-pleaser made with the technology and aesthetic sensibilities of modernity. And whilst the individual parts may be unsatisfactorily safe and familiar, the whole is unexpectedly accomplished and immensely enjoyable.\r\n\r\nThe film begins in 1959 as Carroll Shelby (Matt Damon) wins that year's 24 Hours of Le Mans in an Aston Martin DBR1/300. However, shortly after the victory, he's told he has a heart condition and must stop racing. The film then jumps to 1963, as Ken Miles (Christian Bale), a brilliant but volatile and unpredictable driver, is running a sports car repair garage in LA, but the venture is failing (mainly because he continuously berates his customers for one thing or another). The British-born Miles has a reputation as one of the best drivers in the world, and is renowned for his almost supernatural ability to identify problems in test cars after only one or two laps. However, because of his personality, no one will hire him. Meanwhile, Ford Motor Company Vice President and General Manager Lee Iacocca (Jon Bernthal) suggests that Henry Ford II (a superb Tracy Letts, who steals every scene he's in) buy the cash-strapped Ferrari N.V., speculating that Ford's involvement in international racing may go some way to countering the company's reputation for making boring and unattractive family cars (in essence, he hopes the purchase will give the company more street cred). Enzo Ferrari (Remo Girone), however, turns down the deal in favour of a counter-offer by Fiat Automobiles, which is more lucrative and allows him to retain ownership of Scuderia Ferrari (Ferrari's racing division). He also calls Ford II fat. Enraged, Ford II determines to build a car capable of winning Le Mans, a race which has been dominated by Ferrari for years, winning in 1958, 1960, 1961, 1962, and 1963. Iacocca reaches out to Shelby, the last non-Ferrari driver to have won the event, and asks him to design a car which can beat any Ferrari. Shelby and his engineering partner Phil Remington (Ray McKinnon) get to work but soon Shelby explains to Iacocca and Ford II that they will need a great driver as well as a well-designed car. And so he reaches out to Miles, who comes on board, but immediately clashes with the Ford executives, particularly Senior Executive Vice President Leo Beebe (Josh Lucas). Nevertheless, Shelby, Remington, and Miles press on developing the GT40, a car capable of reaching speeds of 135 mph, if only it didn't keep breaking down.\r\n\r\n_Le Mans '66_ is somewhat similar to Damien Chazelle's _First Man_ (2018), insofar as it uses the grandiose moments of history to tell an intimate story. Whereas Chazelle used the Apollo Program as the background against which to examine a failing marriage, Mangold uses the determination to win Le Mans '66 as the background against which to examine issues such as friendship and the clash between gifted individuals for whom success is its own reward and corporations who don't see value in anything unless it's monetarily successful. Indeed, the argument could be made that the film is actually a commentary on the Hollywood studio system, with Shelby and Miles representing independent filmmakers who love the craft and see the medium as an art-form, whilst the Ford executives represent the studio, always more concerned with the bottom dollar than artistic integrity, always getting in the way of the people who, if left alone to work, could produce something spectacular.\r\n\r\nThe film is also extremely funny in places, especially in a scene where Shelby shows up at Miles's house, and the two get into a fight on the street. Miles's wife Mollie (an underused Caitriona Balfe) emerges from the house, looks at the two men fighting, goes back inside, and remerges with a garden chair, a drink, and a copy of _Better Living_. She then sits down to watch the action. It's a hilarious moment, but it's one with great thematic importance – this is very much an androcentric world (Mollie is virtually the only female in the entire film), but for this brief moment, the audience is allowed to pull back and laugh at the utter ridiculousness of competitive maleness – boys will be clichéd boys, always trying to outdo each other, and getting all worked up over something as pointless as a fast car.\r\n\r\nThis thematic focus, however, is not to say the film ignores the intricacies of racing; on the contrary, there's a huge amount of techno-babble concerning vectors, aerodynamics, the mathematics of torque, the torsion of metal, and the ins and outs of physics. Additionally, although thematically, the focus isn't on the races themselves, there's no denying that the aesthetic design of these scenes is exemplary, albeit familiar. Mann would have done wonders here, but Mangold, cinematographer Phedon Papamichael (_The Ides of March_; _This Is 40_; _Nebraska_), and sound designers David Giammarco (_The Amazing Spider-Man 2_; _The Dark Tower_; _The Predator_) and Jay Wilkinson (_Furious 6_; _Man of Steel_; _Alpha_) have crafted some truly intense moments. For the most part, Mangold and Papamichael avoid any objective shots (for example, there are no overheads giving us a good vantage of the entire race), and there are very few shots showing us something that Miles is unable to see. The scenes aren't shot in the first-person, but our vision is anchored to his. This, of course, contributes to a subjective focalisation and creates the sense of being in the car with him, which brings a default level of intensity, as well as giving the viewer a perfect vantage point from which to see just how fast these guys are going and how difficult what they do actually is.\r\n\r\nIs there a Mann influence on the racing scenes? Absolutely; if you're familiar with how Mann often shoots cars in motion (the camera affixed to the side of the car, with the screen virtually split in two – the side of the car taking up one half, the approaching road taking up the other), you simply can't help but notice the similar positioning of Papamichael's camera. Are they the best racing scenes ever put on film? No; you can find those in Lee H. Katzin's _Le Mans_ (1971), which intercuts footage shot during the real 1970 event with material staged for the film, lending the whole thing an unprecedented intensity that has yet to be topped. However, _Le Mans '66_ makes a hell of an effort, and that can only be commended.\r\n\r\nIn terms of problems, there are only two of any significance. The first concerns just how safe and rudimentary the film is. Aesthetically, although the race scenes are kinetic and exciting, there isn't anything new or inventive in them; thematically, the film doesn't say anything we haven't heard before; and structurally, it walks a very well-worn path – chances are that everything that you think might happen in _Le Mans '66_ does happen. This is your basic underdog story, and it adheres rigidly to that template. The character of Beebe is a good example of just how rigidly. In essence, he's a poorly written token villain because you can't have an underdog story without a token villain (usually in the form of bureaucratic interference). In this case, when Mangold feels the need to inject some conflict into proceedings, Beebe will pop up to throw a wrench into the works. His motivation? Apart from some brief references to how he doesn't think Miles is a \"_Ford man_\", his antipathy is never explained – the character is a Swiss army knife villain who can be used for multiple purposes, a one-size-fits-all token bad guy without an iota of nuance or interiority. The second problem concerns Shelby himself, who is disappointingly one-dimensional (at best), as we learn absolutely nothing about his personal life – for example, the film makes no reference to the fact that by 1963 he was on wife number three (of seven!). Who is the film's Carroll Shelby, and why should non-racing fans care about him? We never get an answer – he's Matt Damon wearing a Stetson and speaking with a Texas drawl. And that's about all the character development he gets.\r\n\r\nAlthough these issues are significant in isolation, the thing about _Le Mans '66_ is that it's so well made, it rises above the clichéd and overly-familiar nature of many of the individual scenes, resulting in a whole that is very much more than the sum of its parts. A film about friendship and integrity rather than racing, it doesn't take any risks, nor does it bend any rules. Indeed it does nothing that could be labelled innovative. For all that, however, I couldn't help but enjoy it. It won't surprise you, it probably won't move you, it certainly won't change your life, but the storytelling is clear and refined, and the journey is one well worth taking.",
                "id": "5de333560cd446001437702b",
                "url": "https://www.themoviedb.org/review/5de333560cd446001437702b"
            },
            {
                "author": "msbreviews",
                "content": "I never expected a sports film, let alone one based on a true story, to impress me so damn much. James Mangold offers one of the best, if not the best sports movie ever. With award-worthy performances from both Christian Bale and Matt Damon, Ford v Ferrari (aka Le Mans ‘66) has characters so exceptionally-written and so emotionally compelling that I felt like crying by the end of the film. The races are riveting and entertaining, but it’s the beautiful screenplay that gets me. Definitely, one of the movies of the year!\r\n\r\nRating: A+",
                "id": "5e0a04ae4b9bae0012d623a4",
                "url": "https://www.themoviedb.org/review/5e0a04ae4b9bae0012d623a4"
            }
        ],
        "total_pages": 1,
        "total_results": 3
    },
    {
        "id": 290859,
        "page": 1,
        "results": [
            {
                "author": "SWITCH.",
                "content": "Leaving ‘Terminator: Dark Fate’, I never felt like they managed to save the franchise, nor overwhelmingly glad this movie exists. It’s an adequate addition in a messy franchise that never reaches the heights of the first two films but is just above the three films before it, and because of this a lot of people will like it much more than they should. It’s not the ‘Halloween’ or even the ‘X-Men: Days of Future Past’ of the 'Terminator' franchise; it’s a fine follow up, and sadly nothing more.\r\n- Chris dos Santos\r\n\r\nRead Chris' full article...\r\nhttps://www.maketheswitch.com.au/article/review-terminator-dark-fate-say-hasta-la-vista-you-wont-want-to-be-back",
                "id": "5db78f7ad2c0c100181681bb",
                "url": "https://www.themoviedb.org/review/5db78f7ad2c0c100181681bb"
            },
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nWhen it comes to the Terminator franchise, I share the same opinion as most people. The 1984’s original became a cult classic, and it’s one of the most influential sci-fi/action films of all-time. Terminator 2: Judgment Day is one of the (very) few sequels to such a beloved movie that actually improves on its predecessor, standing as the number one film of the saga, quality- and entertainment-wise. James Cameron left the franchise, and suddenly it all went down the sewer. While Terminator 3: Rise of the Machines is still tolerable, Salvation is absolutely terrible, and the reboot, Genisys, failed to change the saga’s history compellingly. So, obviously, even with the return of Cameron to the production team, my expectations were moderately low.\r\n\r\nThat said, Dark Fate is the best Terminator installment since T2 … which is not saying much. The last two flicks have great casts (from Christian Bale to Emilia Clarke), but their scripts are baffling bad. This time around, the cast has amazing chemistry, and their characters have better dialogue, but it comes at a cost. The last three movies possess stories that are not as captivating or entertaining (or even rational) as the first two films. Dark Fate has a much better screenplay, but again it comes at a cost. What cost is this? Basically, it repeats the exact same bits as The Terminator.\r\n\r\nAn extremely thin line exists between paying homage to a movie and blatantly copying it. Tim Miller’s team of screenwriters walk that line, stumbling to both sides several times along the way. Some scenes are indeed wonderful nods to the saga’s first two installments, but a lot of other moments (too many, to be honest) are pretty much a copy-paste version of a significant plot point or character development arc from one of those films. In case you’re wondering, this is the reason behind some of the “hate” from both critics and fans all over the world. Nowadays, people are harsher with this sort of homages, and the previously mentioned line is getting thinner and thinner.\r\n\r\nAnother reason for the divisive opinions is the opening sequence. Don’t worry, I won’t spoil. They simply make a sudden and surprising narrative decision that takes some of T2’s emotional impact, at least without first clarifying why they made such a call. Therefore, I gave the movie a chance to develop its idea, but it doesn’t. It just goes with it, and it never returns to this initial moment. Having this in mind, I understand if people instantly decided to hate the film based on just that very first scene…. Because it really doesn’t have any justification besides “well, we need a story”.\r\n\r\nDark Fate’s screenplay is emotionally resonant, and it’s also packed with (mostly) well-directed action sequences, but it resembles the 1984’s original plot too much. There’s even a direct line from Sarah Connor saying that a particular character is the equivalent of her son, John. This unnecessary and lazy exposition is surprisingly not as used as I expected it to be, but when it occurs, it’s like they chose the lamest, silliest, worse possible moments to place it. However, I can’t deny I actually had fun with the movie.\r\n\r\nWith a much better script than the last films, the cast was able to not only shine in a few scenes, but their incredible chemistry allowed for outstanding moments. Seeing Linda Hamilton portray Sarah Connor once again is a delight to my eyes, and Arnold Schwarzenegger is an awesome badass with hilarious lines. These two are phenomenal! Nevertheless, Mackenzie Davis steals the show as the enhanced soldier, Grace, especially regarding the action scenes. I don’t think Natalia Reyes offered what her character needed since she’s the protagonist, after all, but she’s able to stand her ground. I did enjoy Gabriel Luna take on the Terminator Rev-9, but I wish he had a little bit of more screentime besides the action.\r\n\r\nTim Miller brings his talented directing chops from Deadpool and applies his action techniques to deliver a lot of entertaining sequences. The VFX team provides with some impeccable CGI, but there are a couple of shots concerning a few speed bursts that should have received better treatment.\r\n\r\nAll in all, Terminator: Dark Fate is the best Terminator installment since Judgment Day, but it still doesn’t even reach the latter’s heels. It boasts a fantastic cast, with Linda Hamilton and Arnold Schwarzenegger returning to their respective iconic roles, but Mackenzie Davis outshines both with some badass moments and great acting. Natalia Reyes, as the protagonist, is disappointingly fine. Despite the action being well-directed and the screenplay being well-written, it all comes at the cost of essentially replicating the 1984 original’s plot. Some homages are notable, but it’s so identical story-wise that it takes away any sort of surprise, severely lacking creativity. In addition to this, it makes a narrative decision in the opening sequence that removes some of T2’s emotional impact, damaging the saga’s best movie and one of the greatest sci-fi/action films of all-time. I don’t exactly recommend it, but if you’re a fan of the franchise, go see it but with moderate expectations.\r\n\r\nRating: C",
                "id": "5dc065fe7d2bc1001338b963",
                "url": "https://www.themoviedb.org/review/5dc065fe7d2bc1001338b963"
            },
            {
                "author": "JPV852",
                "content": "Pretty good (second) reboot for this long-running franchise with some decent action, respectable enough visual effects (some parts looked off, though) and I did genuinely liked the two new cast members while Linda Hamilton and Arnold Schwarzenegger were fine.\r\n\r\nThat being said, it's also pretty clear this is not a franchise that needed to have gone beyond the two movies (and I might give leniency to \"The Sara Connor Chronicles\"). The saving grace is that on the technical front, it was an entertaining popcorn flick but like Genysis (which I also liked tbh), not really sure when I would revisit. **3.5/5**",
                "id": "5e2caa54c2823a001197bd25",
                "url": "https://www.themoviedb.org/review/5e2caa54c2823a001197bd25"
            },
            {
                "author": "Matthew Brady",
                "content": "\"For John.\"\r\n\r\n'Dark Fate' was meh. I mean it's basically the Force Awakens of the franchise just more cash grab. Like...how many times can they keep alternating T1 & T2, and yet it's astounding that it never ruins the legacy of the series. \r\n\r\nDespite all that, it's the third best in the series. At least this movie knows that Terminator is not for kids! I had some engagement in the movie, even through the reason being that it follows a familiar plot line.\r\n\r\nLinda Hamilton and Arnold Schwarzenegger are both the stand outs. Hamilton playing a cranky bad-ass and Arnold playing an involved machine that has a life of his own. Mackenzie Davis was surprisingly not as annoying as I thought she will be just from the marketing alone. Her character was straight forward in terms of motivation and can take damage.\r\n\r\nTim Miller really knows how to direct action scenes effectively and in this movie he delivers some grand action set pieces. However, after seeing the movie a few days ago, only a small selection stick to memory.\r\n\r\nGabriel Luna did a decent job playing the new advance Terminator. They took the \"Robert Patrick\" approach with picking an ordinary looking guy and making him into the biggest threat of humanity. Although it was a bit hard for me to feel threaten by him as throughout the movie he seemed easily out match by pretty much everyone. \r\n\r\nI didn't really buy into Dani played by Natalia Reyes as the main \"saviour of the future\", mainly because of her stiff acting and everytime she holds a gun it's twice her size.\r\n\r\nThe visual effects at times looked pretty OK, but the rest looked really bad. It really doesn't help when there's close ups on the effects where you can see the fakeness. At times the movie was a little too dark and I don't mean in tone, just whenever it's night time.\r\n\r\nOverall rating: Not as great as T1 & T2, but nothing will without James Cameron magic touch.",
                "id": "5e2f270f1685da0011e9c7da",
                "url": "https://www.themoviedb.org/review/5e2f270f1685da0011e9c7da"
            }
        ],
        "total_pages": 1,
        "total_results": 4
    },
    {
        "id": 330457,
        "page": 1,
        "results": [
            {
                "author": "deRedtube",
                "content": "The kingdom of Arendelle needs to be evacuated when the forces of nature threaten to destroy it. Elsa, Anna, Olaf and Kristoff set off to find some answers. But Elsa has been distracted. She has been hearing an unfamiliar voice calling out to her in a strange tune. Led by her, the group follows the melody to find themselves at the edge of an Enchanted Forest with untold mysteries and dangers.\r\n\r\nRather than retracing the steps of its record-breaking predecessor, ‘Frozen 2’ tries some new thematic tricks. This time around, the surprisingly mature plot focuses on transformation and growing up. The film’s setup leading up to the climax appears to be promising, but its third act doesn’t quite live up to expectations. The conflict resolution lacks a sense of impact and feels rushed. This is particularly baffling since the first half tends to meander, focusing on songs than on purposefully furthering the plot. Additionally, the tracks are far too many and certainly not as catchy as the first film. Which isn’t to say they are bad – the compositions are layered, but it is yet to be seen if they have enough sing-along power to become as popular as ‘Let It Go’. Still, the picturizations of the music is incredibly captivating.\r\n\r\nThis extends to the rest of the film’s animation too, and some vibrant colors combine with photo-realistic visuals to create quite a spectacle. Minor details are noticeable as they enhance the essence of each character. While each of the group gets their moments, Elsa and Anna continue to be the focal points. The uncontainable chemistry of Idina Menzel and Kristen Bell, respectively, picks up where they left off without missing a beat. Olaf provides ample humor, either in visual slapstick or by Josh Gad’s endearing yet tongue-in-cheek, almost self-aware delivery. An interesting new character played by Sterling K. Brown is an immediate standout. However, a subplot involving Kristoff and Anna feels shoed in to give Jonathan Groff something to do besides singing probably the most amusing song in the soundtrack.\r\n\r\nIt’s a tall order to expect this sequel to capture the lightning-in-a-bottle magic of the original, but Frozen 2’s stunning eye-candy and humor will be enjoyable enough for its younger core audience.",
                "id": "5dd831ab3faba00015f96deb",
                "url": "https://www.themoviedb.org/review/5dd831ab3faba00015f96deb"
            },
            {
                "author": "SWITCH.",
                "content": "While ‘Frozen 2’ isn’t as strong a film as I had hoped it would be, I wouldn’t go so far as to call it a disappointment. It’s still incredibly entertaining and I found myself engaged throughout. These films do have an undeniable charm, and outside of the now-completed ‘How to Train Your Dragon’ trilogy, ‘Moana’ and Laika’s ‘Missing Link’, these are the only major American animated films attempting the use the form to create a cinematic experience. It is a pity that the story never finds its feet; a combination of this level of craft and a real ripper of a yarn would have made this a slam-dunk. As it stands though, the magic of the ‘Frozen’ franchise is still there - dimmed, but there nonetheless.\r\n- Daniel Lammin\r\n\r\nRead Daniel's full article...\r\nhttps://www.maketheswitch.com.au/article/review-frozen-2-elsa-and-anna-return-with-the-magic-mostly-intact",
                "id": "5ddb52473faba00013ff93b2",
                "url": "https://www.themoviedb.org/review/5ddb52473faba00013ff93b2"
            },
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nAs you should know by now, I enjoyed Frozen more than I expected. Therefore, I was genuinely excited about its six-year sequel. It’s one of the few movies in 2019 to which I went in 99% blind. I didn’t watch a single trailer, I barely saw any images or small clips, and I didn’t know anything about where the story was going. So, with my expectations moderately high, how did it perform? Very, very well. I’m going to write it straight away: I enjoy this sequel more than the original. For one simple reason: it possesses a more emotionally complex narrative, one which I think the target audience (basically kids) won’t even fully understand.\r\n\r\nIt’s really hard to create an animated flick with a story that works for both adults and children. The best of the best are the ones that are able to almost tell two different narratives: one simpler for kids with basic life lessons, and another for adults with more profound themes. Frozen II doesn’t reach this last level, but its layered screenplay allows for an exploration of Elsa’s powers that I genuinely didn’t expect. However, there’s an evident downside to the extreme focus on Elsa’s journey… The other characters are put aside with irrelevant subplots that only stretch the runtime a bit too much, and unfortunately, reach a certain point where out-of-character actions occur.\r\n\r\nThere’s even a period of time where a particular character simply vanishes from the story because Jennifer Lee and Chris Buck couldn’t figure out what to do with it during the last act. Despite the subplots not being impactful or not being able to further develop its characters, I can’t deny some sequences are entertaining and funny as hell. Olaf is the absolute MVP of the film, and just like in the original, he doesn’t exactly have an arc. Nevertheless, he has one of the most hilarious sequences of the year. I cried from so much laughter. His song and a couple of scenes where Josh Gad goes all out are some of the funniest of the whole movie.\r\n\r\nThe voice cast is once again perfect. Anna, Kristoff, and Sven are sort of along for the ride, with the trio only doing something useful in the last 15-20 minutes. Elsa is the real star of the show. From the opening shot to the last, it’s all about her, and her powers’ origin. It might get too convoluted for kids, but despite a few minor missteps, it’s an extremely well-developed screenplay. With a remarkable build-up and some truly amazing songs, Elsa goes through several action moments where she showcases all that her magic can do. And it’s visually mind-blowing. Like in the first film, the animation quality is extraordinary.\r\n\r\nThey really put 200% effort into Elsa’s magic sequences. From her running against a tide of waves to fighting against the four elements (water, fire, earth, and air), there are imaginative and incredibly entertaining scenes, which give the movie a level of entertainment superior to its predecessor. Put this together with the wonderful, powerful score, and you get a pretty epic film, scale-wise. I mean, Into the Unknown is not going to reach Let It Go’s level of worldwide craziness, but it’s a phenomenal song. It’s even better hearing it while watching the actual scene play out. Both this one and Show Yourself have a build-up worthy of sending chills down your spine.\r\n\r\nAll Is Found is also a memorable lullaby that a lot of parents are going to sing for their kids. When I Am Older is Olaf’s hilarious musical moment that left me laughing throughout its entire run. I love Frozen II’s score, more than the original’s. That’s something I genuinely wasn’t expecting at all. Looking back, I now think the first installment doesn’t even have enough significant songs. This sequel has tons of songs that are either extremely important for the characters or funny parodies. All are very captivating, catchy, and emotionally resonant. My advice: please, don’t listen to the soundtrack before watching the movie. Not only the titles and lyrics offer plot spoilers, but they ruin that “first experience” feeling. I got chills during a couple of them precisely because I watched besides only hearing them.\r\n\r\nAll in all, Frozen II compensates the six-year wait with a follow-up worthy of standing up to its original, which in my opinion, surpasses it. With an emotionally complex narrative, Elsa’s powers are explored and developed in a captivating, creative, fun, and entertaining way. Disney really put their best animators on this because the quality of animation has never been as visually impressive as this. It really feels like a magical film. Elsa’s magic demonstration plus the powerful, chill-inducing original score are two aspects that together provide some truly epic moments. However, Olaf is the MVP with a lot more screentime than in the original, and with a couple of the most hilarious scenes of the year. It’s a shame that the focus on Elsa’s arc pushed every other character aside, making them feel useless and with no exciting or impactful subplot. Runtime feels a bit stretched due to their side adventures, and exposition is pretty heavy throughout the entire duration. In the end, it’s still a contender for Best Animated Feature Film of 2019.\r\n\r\nRating: B+",
                "id": "5ddcebbea80673001212bb00",
                "url": "https://www.themoviedb.org/review/5ddcebbea80673001212bb00"
            }
        ],
        "total_pages": 1,
        "total_results": 3
    },
    {
        "id": 535292,
        "page": 1,
        "results": [
            {
                "author": "deRedtube",
                "content": "Andre Davis (Chadwick Boseman) is the NYPD detective tasked with the case of two criminals who kill several police officers during a drug heist. The deaths enrage an entire precinct, and the captain (J.K. Simmons) now has a bunch of trigger-happy cops thirsting for revenge. He decides to pair Andre with a DEA agent (Sienna Miller). But the incident also uncovers a conspiracy, and Andre doesn’t know whom to trust. He has just one night to solve the case and catch the killers before they escape the city of Manhattan.\r\n\r\nChadwick Boseman’s rendition of Andre Davis is intense, and the actor has a commanding on-screen presence as well. He continues to display a lot of range in his acting repertoire to prove, yet again, why he deserves to be a leading man. J.K. Simmons is perfectly cast as Captain McKenna, who makes you really care about why the police deaths matter so much to him and the rest of the cops. Sienna Miller is also impressive in a restrained performance as the DEA agent Frankie Burns. On the other side of the law, Taylor Kitsch and Stephan James make a strong pair. Kitsch plays Raymond Jackson, a sharpshooter who knows how to dispatch whoever is in his sights, and James plays Michael Trujillo, the brains of the operation, who needs to figure how to escape without getting arrested.\r\n\r\nAlthough the plot is neither new nor inventive in any way, it has an interesting setup with perspectives from both sides of the law. Director Brian Kirk shoots the film, particularly the action, well enough to keep the pace engaging throughout. The screenplay has the potential to explore different motivations, but the film barely scratches the surface of its subject matter. If you’re familiar with the crime thriller genre, the chances are you’ll predict the outcome because we’ve seen this story play out many times before. Despite that, you’ll still enjoy ‘21 Bridges’, because the action combined with its competent cast and their performances make it highly watchable.",
                "id": "5dd8300728723c001253dab7",
                "url": "https://www.themoviedb.org/review/5dd8300728723c001253dab7"
            }
        ],
        "total_pages": 1,
        "total_results": 1
    },
    {
        "id": 522162,
        "page": 1,
        "results": [
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\r\n\r\nWith all due respect to Roland Emmerich and to his fantastic Independence Day, his movies never quite reach their potential, ending up in constant disappointments. It doesn't matter if he has excellent casts or amazing VFX teams, his films' screenplays are almost always stuffed with narrative issues. Midway is simply another installment in his saga of letdowns. Without knowing the director, anyone who looks at this movie will feel instantly captivated. From the unbelievably talented cast to the impressive visuals, it has two attention-grabber ingredients, which can result in a remarkable film… only if the two pillars of any cinematic production are decent enough: story and characters.\r\n\r\nThese are the main issue with Emmerich's movies. His characters are not compelling or intriguing enough, and his screenplays lack creativity and excitement (whether these are written by him or someone else). When I noticed that Midway had such an acclaimed cast and that it was about the Battle of Midway, I immediately got excited. War epics are a genre that I sincerely appreciate. However, when I checked who was \"running the show\", I instantly lowered my expectations. Honestly, it's exactly what I expected it to be: visually gripping, but emotionally hollow.\r\n\r\nI don't want to understate it. The CGI work in this film is jaw-dropping. The actual war is riveting with astonishing aerial sequences and powerful sound design. Even at a regular screening with the usual 7.1 Dolby surround speakers, the floor was rumbling with the explosions and the planes. This is why I think audiences will definitely enjoy this movie. Maybe not a vast majority, but surely most people will leave their theaters feeling it was good entertainment. It has a long runtime, and it's hard to get through the exposition-heavy story, but in the end, I bet the general public will appreciate the war action enough to give the whole thing a thumbs up.\r\n\r\nNevertheless, it's still a very superficial flick. While it's very respectful to everyone who fought in the war (including the Japanese) and to the historic event on itself, it lacks emotional attachment to its characters. Dunkirk was praised by both critics and audiences all around the world, but its main criticism connects to what I just wrote. Christopher Nolan's film also didn't have any compelling characters. However, there's a big difference between these two movies. Both their marketing and their ultimate goal are distinct. Dunkirk was all about showing the actual war. It never marketed itself as a character-study or that it would even have a significant focus on some of the heroes that fought there. Nolan repeated several times: it's about the war and the war only.\r\n\r\nIt's genuinely one of the best, if not the best, *pure* war film I've ever seen. When it comes to depicting the claustrophobic, unbreathable, restless, bloody, loud event that a devastating war is, Dunkirk is so realistic it can even become uncomfortable with just sitting in your chair (at least, I did in IMAX). On the other hand, Midway's marketing was about paying homage to \"people who fought in the Battle of Midway\". Hence the stellar cast compared to Nolan's just competent actors (with obvious exceptions like Mark Rylance or Tom Hardy). It spends most of its screentime trying to develop the actual people that helped win that battle, not with the action itself. Therefore, these characters need engaging scripts and emotionally resonant arcs.\r\n\r\nWes Tooke delivers a screenplay packed with so much exposition that a lot of it looks clearly unrealistic. Characters discuss specific topics that don't make any sense of being in a conversation at a particular time and place. Throughout the runtime, there are dialogue sequences with the sole purpose of explicitly telling the audience what we need to know to understand the story, which ends up turning the narrative confusing, convoluted, and lacking faster pacing. It's tough to get through the non-action periods, and I can't even imagine how dull it would be without such an impeccable cast. Ed Skrein remarkably portrays Dick Best, the only character who's genuinely compelling and carries a complete, well-developed arc.\r\n\r\nUnfortunately, I didn't feel invested in any other character. Only the best movies of every year can have a numerous and talented cast while giving each and every actor an exciting role. Midway has too many characters for the story it wants to tell. In addition to this, it has to stretch its runtime because you can't get Woody Harrelson or Dennis Quaid playing secondary roles and not giving them more than just a couple of lines. As time goes by, Emmerich's storytelling structure gets needlessly more and more complicated to follow. It's yet another film added to the \"wasted potential\" list…\r\n\r\nPotential due to how truly magnificent the action sequences can be. It's undeniable that these are entertaining, gripping, and exciting. The dive bombers' scenes are packed with so much tension that I was getting more and more frustrated every time they missed their target, and a bomb went into the sea. I wanted them to succeed so bad, and this feeling can only be triggered by something extraordinary. Midway's war is as close to epic as it could be, but as with every other cinematic production, if its story and its characters are not up to par with the action, there are no outstanding VFX that can save a lousy screenplay.\r\n\r\nAll in all, Midway is a respectful homage to the people who fought in the Battle of Midway, but it fails to deliver an engaging story with compelling characters. With more characters that what it needed, the runtime is stretched beyond its limit due to the numerous acclaimed actors who would never be in a movie if they didn't have more than a couple of lines. Roland Emmerich has to thank his VFX team for presenting the closest war action we could ever get of the famous battle. Truly epic visuals with tense and riveting aerial sequences, plus a powerful sound design, get your teeth biting the nails. Unfortunately, except for Ed Skrein's character, I didn't feel invested enough to appreciate the non-action moments due to the confusing, convoluted, and exposition-heavy narrative. It's a shame that a visually impressive film possesses such an emotionally dull story. However, I still recommend it for anyone who enjoys war epics and \"based on a true story\" adaptations.\r\n\r\nPS: it doesn’t hurt to research a bit about the Battle of Midway. I didn’t and I’m sort of regretting that now. Don’t make the same mistake. Going in with basic knowledge of what, how, and why it happened will only help you enjoy this movie more.\r\n\r\nRating: C+",
                "id": "5dc5a360ab1bc70013ff7b68",
                "url": "https://www.themoviedb.org/review/5dc5a360ab1bc70013ff7b68"
            },
            {
                "author": "Wuchak",
                "content": "***Just the facts, Jack***\r\n\r\nIntelligence officer Edwin Layton (Patrick Wilson) warns that a Japanese attack is imminent, but his advice is disregarded and the Japanese use their carrier fleet to attack Pearl Harbor on December 7, 1941. Admiral Chester Nimitz (Woody Harrelson) swiftly assumes command of the heavily weakened US Pacific Fleet. After the Doolittle air raid on Tokyo & Honshu 4.5 months later, \tevents lead up to the Battle of Midway on June 4–7, 1942. Ed Skrein plays cocky pilot Dick Best while Dennis Quaid is on hand as carrier commander William \"Bull\" Halsey. \r\n\r\n\"Midway\" (2019) tackles the Battle of Midway and events leading up to it without throwing in a dramatic fictional story, like the love triangle of “Pearl Harbor” (2001). While I loved “Pearl Harbor” and proudly stand by it, “Midway” chooses to stick to the facts and is thrilling from beginning to end. The main cast members are all real-life figures and there’s a tribute to each at the close.  \r\n\r\nThis is superior to the 1976 movie because Roland Emmerich had the CGI technology to pull off the battle scenes which take place in & above the Pacific Ocean near the atoll of Midway, which is located a little over a thousand miles west of Hawaii. The flick successfully takes the viewer right into the midst of the fight on the water, in the air and under the water. It’s exciting, horrific and revelatory.   \r\n\r\nThe film runs almost 2 hours and 18 minutes.\r\n\r\nGRADE: A-",
                "id": "5dda195628723c0014593266",
                "url": "https://www.themoviedb.org/review/5dda195628723c0014593266"
            },
            {
                "author": "SWITCH.",
                "content": "War stories are only worth retelling in film if you're doing something new and interesting with the genre. Otherwise, it's just a retread of 'Pearl Harbour' or 'Fury' or any of the dozen other thematically-empty, explosion-happy extravaganzas from the last ten years. There's a compelling, nuanced, and affecting film to be made about Midway. This is not that film.\r\n- Jake Watt\r\n\r\nRead Jake's full article...\r\nhttps://www.maketheswitch.com.au/article/review-midway-sound-and-fury-signifying-nothing",
                "id": "5e3269d5c56d2d0018521ffa",
                "url": "https://www.themoviedb.org/review/5e3269d5c56d2d0018521ffa"
            }
        ],
        "total_pages": 1,
        "total_results": 3
    },
    {
        "id": 473033,
        "page": 1,
        "results": [
            {
                "author": "Luis_989",
                "content": "Adam Sandler's best performance? No. But it's indeed his best since Punch-Drunk Love, which continues to be the pinnacle of his talent.\r\n\r\nWhile the film isn't the best talking about technique, it seems to me that its style is totally focused on making the experience an exhausting one. And Uncut Gems is an overwhelming journey full of anxiety and stress. It achieved that splendidly.\r\nThat's its greatest accomplishment: To immerse you in the entire atmosphere of the environment that Sandler's character inhabits, while we witness the cascade of bad decisions he makes.\r\n\r\nPerhaps the biggest mistake is how the directors get to over-lengthen the story, which indirectly gets to a point where Sandler's character becomes obnoxious but I think that's part of the experience, because who ever in their right mind would feel more sympathy for a person like him? I mean more than the allowed sympathy anyways.\r\n\r\nIts ending, although predictable is certainly what he built and there's no learning in it and it doesn't need to be.\r\nAfter all the story was his decline while he believed that he was going to succeed. And yes for a moment he did and for a moment he savored it, but as happens many times in life, good things aren't made to last.\r\n\r\nAnother triumph for A24.\r\n\r\n9 likes",
                "id": "5dffaa3965686e00139609c5",
                "url": "https://www.themoviedb.org/review/5dffaa3965686e00139609c5"
            },
            {
                "author": "Stephen Campbell",
                "content": "**_Watching a guy screw up for two frantic hours may not sound very compelling, but this is a fine piece of work_**\r\n\r\n>_If you hold this_\r\n\r\n>_Dazzling emerald_\r\n\r\n>_Up to the sky,_\r\n\r\n>_It will shine a billion_\r\n\r\n>_Beautiful miracles_\r\n\r\n>_Painted_\r\n\r\n>_From the tears_\r\n\r\n>_Of the most High._\r\n\r\n>_Plucked_\r\n\r\n>_From the lush gardens_\r\n\r\n>_Of a yellowish-green_\r\n\r\n>_Paradise,_\r\n\r\n>_Look inside this hypnotic gem_\r\n\r\n>_And a kaleidoscope of_\r\n\r\n>_Titillating, soul-raising_\r\n\r\n>_Sights and colors_\r\n\r\n>_Will tease and seduce_\r\n\r\n>_Your eyes_\r\n\r\n>_And mind._\r\n\r\n- Suzy Kassem; \"A Jewelry Store Named India\" (2011)\r\n\r\nWritten by Ronald Bronstein, Josh Safdie, and Benny Safdie, and directed by the Safdies, _Uncut Gems_ is essentially two hours and fifteen minutes of watching a guy screw up in increasingly spectacular and catastrophic ways, make bad decision after bad decision, and give in to his addiction to gambling more and more. It's a film where you know from the first ten minutes that sooner or later, he won't be able to worm his way out of one of his mistakes, and at that point, his seemingly unshakable optimism and belief in his own delusions will prove ill-equipped to deal with the reckoning. So from the first act, you're on edge, and you remain there for the duration. It's a film that never stops moving at the chaotic breakneck speed with which it begins, a film possessed of energy nearly queasy in nature. So, two hours and fifteen minutes of rapidly-paced stress-inducing cinema about a deluded hustler screwing up? Sounds fun doesn't it? No, of course it doesn't. However, it has been made with such craft, the _mise en scène_ is so good, the dialogue so sharp, the acting so intense, that you may as well be watching a fly-on-the-wall documentary. It's a film made of pure sweat and anxiety, and it's about as stressful an experience as you can have at the movies. It's also superb, and I'd highly recommend it.\r\n\r\nThe film begins in 2010 in Welo Mine, Ethiopia, with the discovery of an ultra-rare black opal of extraordinary translucence. We then cut to New York in 2012, where Howard Ratner (Adam Sandler) is a charismatic jeweller who lives his life on the principle of robbing Peter to pay Paul. A serious gambling addict, he always has at least one hustle going, and he always owes somebody something. Soon after we meet him, it's revealed that he's currently in debt to his loan-shark brother-in-law Arno (the great Eric Bogosian) to the tune of $100,000, and Arno is having such a hard time with him, that he's had to hire two Boston thugs, Phil (Keith Williams Richards) and Nico (Tommy Kominik), to try to muscle Howard into paying the money back. Meanwhile, his jewellery business is doing well, not the least reason for which is his colleague Demany (Lakeith Stanfield), who helps bring in high-profile clients. The latest example of such is Boston Celtics' basketballer Kevin Garnett (a surprisingly strong performance by Garnett himself). As Garnett is browsing the store, it's revealed that Howard has smuggled the black opal into the country for an auction the following day, where he expects it will sell for up to $1 million. However, when Garnett sees the stone, he insists he is allowed to have it as a lucky charm, just for the match he's playing that night. Howard is reluctant but agrees to part with it when Garnett offers to leave his All-Star ring as collateral (which Howard immediately pawns for money to place a bet on Garnett's game). And, predictably, things quickly go awry.\r\n\r\nAnd all of this is to say nothing of his contemptuous wife Dinah (Idina Menzel), who has grown to loathe him over the years and considers their marriage a sham; his naïve but kindly colleague and mistress Julia (Julia Fox), with whom he shares an apartment; his father-in-law Gooey (Judd Hirsch), who always seems to see the best in him; and his children, Marcel (Noa Fisher), Eddie (Jonathan Aranbayev), and Beni (Jacob Igielski), none of whom have any illusions about who their father is.\r\n\r\nHoward is a delusional and doomed figure about whom there's a hint of Cosmo Vittelli (Ben Gazzara) – the gambling addict wannabe social climber who keeps slipping on the ladder's lowest rungs in John Cassavetes's _The Killing of a Chinese Bookie_ (1976). However, whereas Vittelli is driven to a point of despair by his own work ethic, Howard is very much the product of late capitalism; a man who genuinely believes, despite past experience to the contrary, that his big score is right around the next corner. In this respect, the film is a deconstruction of the concomitant globalised alienation; a system capable of drawing into a single self-delusional orbit such varied parties as exploited Ethiopian manual labourers, small business owners in New York, under-pressure athletes, loan-sharks, and bookies – all operating with the unshakable belief that a huge win is just within their grasp. Howard, of course, is the worst example, and is essentially a fantasist who's utterly divorced from reality, a man who believes completely that if people would get out of his way and let him turn that fabled corner, all of his worries will disappear. It's the gambling addict's fallacy – no matter how much or how often you lose, the next bet will be the big winner. The problem Howard faces is that he has made promises based on that fallacy – he owes money which he can only pay if his latest scheme works out _exactly_ as intended; such is the precarious house of cards that is his life.\r\n\r\nIn this sense, the film is an especially astute study of addiction, although this theme is never foregrounded – no one accuses Howard of being a gambling addict, and he certainly doesn't seem to think of himself as one. This is not a cautionary tale about the perils of addiction. Indeed it even goes so far as to play up (if not necessarily glamorise) the gambler's high – the precarious sense of everything being on the line, consequences be damned, the sense that if one thing goes wrong, everything collapses, but if everything goes right… However, if you're paying even the slightest bit of attention, you can't help but see just how hopelessly consumed Howard is by his addiction (never once does he give the impression that he wants to stop gambling). It has wormed its way into every facet of his life, to the point where it has become his life, or certainly a hugely important part of that life. This is why delusion is such a major component in his psychological make-up – addiction and delusion form an ever-tightening feedback loop that becomes more difficult from which to escape, the more self-sustaining they become.\r\n\r\nIn terms of aesthetics, it's worth noting that two of the three writers (Bronstein and Benny Safdie) are also credited as the editors, and this is crucial insofar as the frenetic pace of the narrative isn't achieved only by the cutting, but by the script as well – this is a film written by people with at least one eye on the editing rhythms. The first scenes in New York, for example, immediately establish the chaotic energy – Howard speaking rapidly into his mobile, dialogue overlapping almost unintelligibly as multiple characters interact and talk over one another, at least three things always happening, each one of which would occupy our complete attention in a more conventional film. Here, it's almost like everything is a background to everything else, with nothing ever given a sustained sole focus. The opening scenes establish the pace as blistering, and that never really changes. It's the kind of film where there's perpetual propulsive momentum – because the characters never stop moving, neither does the story, even if the characters never actually manage to get anywhere. The score, by Oneohtrix Point Never, is also excellent. Obviously inspired by Tangerine Dream's electronic scores for Michael Mann's early films, most notably _Thief_ (1981), it's an unexpectedly crucial element of the film, adding to the overlapping cacophony of sounds and enhancing the general sense of twitchy chaos.\r\n\r\nAs for the acting, everything you've heard about Sandler is true; he's incredible. The Safdies originally pitched him the script in 2009, but he turned it down and the project went nowhere. In 2017, after the success of _Good Time_, they resurrected the film and cast Jonah Hill as Howard, but when he dropped out, they offered it to Sandler again. And he totally and completely inhabits Howard, to the extent where it no longer even seems like acting. And sure, he's playing the same kind of volatile delusional loser that he's played in a million-and-one subpar comedies. But it's the tone of the performance, the key in which he plays Howard that makes it stand out. You could make the argument that Howard is simply Sandler dialled up to 11, and you wouldn't be wrong, but the inherent tragedy of the man, his self-delusion, his seemingly unquenchable optimism and belief in himself – Sandler draws these elements out every second he's on-screen, finding pathos in virtually everything he does, in a performance that's both subtle and broad. I'm no Sandler apologist, but he really does have to be seen here to be believed. Elsewhere, Bogosian is his usual stoically intimidating self; first-time performers Williams Richards and Kominik are each as terrifying and authentic as the other; Menzel manages some of the most withering looks ever captured on film; and Fox, another impressive debutant, imbues what could have been a clichéd bimbo-type role with real emotional nuance.\r\n\r\nAs for problems, the pace of the film will certainly put some people off. There are no down-moments here, no scenes designed to let the audience breath. This is as anxiety-inducing a film as you're likely to see, and that simply won't be to everyone's taste. Partly because of this, the tone never really varies. There are some comic beats (Howard getting dumped naked into a car trunk during his daughter's school play is particularly funny), but by and large, the tone is perpetually dark, ominous, and exhausting. Which, again, won't be for everyone. And there will, of course, be people who just can't get past the presence of Adam Sandler, which I can understand. Personally though, I loved _Uncut Gems_. It's certainly not the subtlest of films, nor the most thematically complex, but as character studies go, this is exceptionally good work from everyone involved and a genuinely unique piece of cinema.",
                "id": "5e2ba36d688cd00015c80315",
                "url": "https://www.themoviedb.org/review/5e2ba36d688cd00015c80315"
            },
            {
                "author": "Matthew Brady",
                "content": "“This is how *I* win.”\r\n\r\nOne of the most stressful movie experiences I’ve had in awhile.\r\n\r\nThis whole movie runs entirely on acid and how the series of events unfold was particularly stressful. People constantly talking or yelling over each other while the brilliant sound work made the space around them feel so tight, but incredibly claustrophobic.\r\n\r\nWhile I like ‘Good Time’ a little more, but man what a rush.\r\n\r\nAdam Sandler is absolutely terrific as the greedy and sleazy Howard Ratner. If he's working with a good director, a strong supporting cast, and an interesting concept, Sandler will thrive. We follow Howard Ratner, a jewelry store owner in New York with a serious gambling problem that makes the hole his standing in deeper and deeper. Despite every terrible decision his character made...I still felt sorry for him. I think it has to do with Sandler's devilish charm that won me over into pitting such a petty crook. He isn’t a loser, he’s a winner who doesn't win. It’s one of his best performance right beside ‘Punch Drunk Love’.\r\n\r\nBenny and Josh Safdie are such vibrant directors that can inject so much style while also having a harsh look to it, which ties in with the slimy side of business. The Safdie Brothers are building a solid career for themselves. Darius Khondji outstanding cinematography is the glue that holds this high tension of a movie together.\r\n\r\nI loved the score from Daniel Lopatin, which will often drown out the dialogue as the retro rift comes blasting through. On the other hand, there’s also a slow mystical vibe that Lopatin composes that gave me a surreal feeling of levitating.\r\n\r\nKevin Garnett is surprisingly really good in this movie. A professional basketball player actually delivering a solid performance is almost unheard of. It kinda reminds me of Tyler Perry ‘Gone Girl’, in terms of your expectations from them vs what you got. I also couldn’t believe this is Julia Fox first acting debut, because she’s fantastic in the movie.\r\n\r\nOverall rating: While I’m only two movies into their filmography, Safdie Brothers are upon my favorite working directors.\r\n\r\nI hope they make another movie like 'Good Time' & 'Uncut Gems', so it can called the LSD trilogy.",
                "id": "5e2f2c14ac8e6b0015bcdb9e",
                "url": "https://www.themoviedb.org/review/5e2f2c14ac8e6b0015bcdb9e"
            }
        ],
        "total_pages": 1,
        "total_results": 3
    },
    {
        "id": 486589,
        "page": 1,
        "results": [],
        "total_pages": 0,
        "total_results": 0
    },
    {
        "id": 454626,
        "page": 1,
        "results": [],
        "total_pages": 0,
        "total_results": 0
    },
    {
        "id": 331482,
        "page": 1,
        "results": [
            {
                "author": "SWITCH.",
                "content": "I’m not discounting the new approached Greta has taken here. I personally think it’s great and, in 2019, definitely poignant but it also shows too much respect for only one on-screen woman. I can’t help but feel that, while serving one grand idea, Greta has caused a disservice to those other women in its wake.\r\n- Jess Fenton\r\n\r\nRead Jess' full article...\r\nhttps://www.maketheswitch.com.au/article/review-little-women-a-21st-century-remake-but-does-it-cause-more-harm-than-good",
                "id": "5df5d0709450fe001125e399",
                "url": "https://www.themoviedb.org/review/5df5d0709450fe001125e399"
            },
            {
                "author": "Luis_989",
                "content": "Opinions are opinions. Subjective or objective, but I find quite interesting the positive response Greta Gerwig's second feature film has received, considering the so self-complacent film she created.\r\nI personally believe that.\r\n\r\nDo not confuse that feeling with me saying this is a misdone film. There's talent in her direction but Gerwig instead of looking for a challenge having the doors as open as she has them at the moment, she sat in the conformism and made a film that feels totally built as a ''For Your Consideration '' And be afraid if she's not considered.\r\n\r\nI don't deny that Gerwig loves the novel, she shows it and certainly this version is her personal vision but despite the nice attempt, there's nothing new or fresh in her take.\r\nI have to admit and emphasize that at this point it's completely stupid and naive to ask for a radical change in a story which has already been told a lot of times in film, however, it also cannot help feeling like a cheap mean of exploiting the story considering our current times, where feminism is now a driving force in the industry.\r\nLike I said, she went for the safe bet. \r\n\r\nAnd yet despite Gerwig's attempt to increase that specific plot weight, she also avoids going to issues that wouldn't work for the story she was trying to tell, because although they're not girls with money, they have the privilege of being protected from the civil war. \r\n\r\nJo is a young woman aware of herself and her mind, which in those times wasn't something positive but obviously the external world is not a concern for her, only her personal interests. And that's ok, we get to be that way, especially when we're young, but how do you try to make woke characters, if it's only in the things that suits them?\r\nThat's where the pertinent questions should be asked about what it was decided to take in order to make this new version work according to the director's perspective.\r\n\r\nIn the end, despite the production quality, Little Women is just a conventional and ordinary repetition of a literary classic that I personally think has already been too used.\r\nBut the proposal works both to be loved and to be hated and that depends a lot on the mentality you carry with you when you go to see it.\r\nAs always the rest depends on what you get from the film.",
                "id": "5e0b9581d5dbc20018fdd1b4",
                "url": "https://www.themoviedb.org/review/5e0b9581d5dbc20018fdd1b4"
            },
            {
                "author": "Gimly",
                "content": "Guess 2019's just the year for Florence Pugh to be in critically acclaimed and letterboxd beloved movies that I just genuinely didn't care for much.\r\n\r\n_Final rating:★★ - Definitely not for me, but I sort of get the appeal._",
                "id": "5e215062bfeb8b0015ce091e",
                "url": "https://www.themoviedb.org/review/5e215062bfeb8b0015ce091e"
            },
            {
                "author": "msbreviews",
                "content": "If you enjoy reading my Spoiler-Free reviews, please follow my blog @\r\nhttps://www.msbreviews.com\r\n\r\nThe 92nd Academy Awards are presented this Sunday, and Little Women is part of the few 2019 releases that are only now (2020) being shown in my country. I really want to watch every Best Picture nominee before the ceremony not only to provide my honest predictions but also to have a Top10: Best Movies of 2019 more complete regarding the number of films watched. Well, Greta Gerwig's adaptation of the famous book isn't able to crack a spot in my Top10, but it's definitely worth an honorable mention.\r\n\r\nThere's been a lot of controversy surrounding the Best Director category, way beyond just the Oscars. The lack of a female nominee across a few award shows raised some discontent, and most considered Gerwig's work to be more than enough to warrant more nominations, especially at the Academy Awards. Now, I'm going to be as polite, respectful, and fair as I can. While I do agree that Gerwig does a great job in directing this movie, I still believe that the five male directors nominated for the respective Oscar did an even better one. Even removing Todd Phillips (Joker) out of the equation (which I entirely accept), I would definitely choose Noah Baumbach (Marriage Story) as his replacement.\r\n\r\nWith that said, do I suddenly become a misogynist? Do I always favor men when I send my own ballots to the OFTA Awards, for example? I don't think so. It's just a humble opinion. Putting that discussion aside, let's focus on the positive aspects of Little Women because there are many! Usually, romance isn't a genre I tend to love, but I really enjoyed this adaptation of Alcott's famous novel. I'll start with the cast because how can't I?\r\n\r\nWith such a stellar team of actors, I knew I was going to receive some amazing performances. Every character gets a lot of screentime, but Saoirse Ronan is definitely the lead as Jo. She's the odd sister, the one that doesn't really want to follow the \"rules\" of being a woman in the XIX century. She wants to do what she loves for a living and be independent without having to be this housewife that simply married a rich man. She wants to be remembered. Saoirse incorporates this personality like it's her own, and adds another brilliant display to her acting career.\r\n\r\nHowever, Florence Pugh gives the standout performance as Amy. Undoubtedly, Pugh is the breakthrough actress of this last year. Fantastic physical display in Fighting with my Family, one of the best performances of 2019 in Midsommar, and the most complex role of her career in Little Women. Since the story is continuously going back and forward in time, everyone has to portray two versions of the same character, but Amy is the one that changes the most. As a childish, immature, silly, young Amy, Pugh delivers some of the funniest moments of the film. Truly hilarious at some points. Then, as an adult Amy, she's more grounded, responsible, and about to follow one of the \"rules\" of society regarding women: marrying a rich man.\r\n\r\nEliza Scanlen carries an emotional arc as Beth, and the best past-present sequence is due to her. Emma Watson is Meg, the older sister who everyone looks up to since she seems to be perfect, so her arc goes through some demonstrations of how her imperfections make her a role model to her sisters. Timothée Chalamet is also one of the standouts as Laurie, a neighbor who gets close to the March family, but I won't delve into too many details regarding his story. Laura Dern (Marmee March) and Meryl Streep (Aunt March) are perfect as always. Every character arc is exceptionally developed. With a runtime slightly over two hours, it's remarkable the level of detail, complexity, and depth that the characters possess.\r\n\r\nI can't address every single one in detail since there are so many, but I tried my best to give an overview of each of the main ones. Clearly, Jo, Laurie, and Amy's arcs are the absolute best. However, Emma Watson's character story is the one that feels too superficial and too simple compared with her sisters'. It doesn't really feel like she went through any change throughout the years, and part of her story feels a bit forced. Beth's arc might also be straightforward, but since it's associated with an emotionally powerful plot point, one can understand her little screentime.\r\n\r\nThe past-present storytelling method works for the most part. There are a couple of moments beautifully and seamlessly \"stitched\" together, giving the viewer a sense of fulfillment by witnessing the start and end of a little story that happened in the past and later in the present under other circumstances. Nevertheless, some sequences either drag too much or lack emotional investment. Since the movie crosses the two-hour mark, I found myself bored during certain storylines that failed to captivate me.\r\n\r\nIn a film with so many characters, it's very common to give more focus to only a few of them. It's impossible to call someone a protagonist if half a dozen characters have the same or more screentime or plot relevance. However, this always brings the issue of not being able to fascinate the audience with every character arc. Also, some past-present transitions are so abrupt that they disrupt the overall pacing by being a bit confusing. Nevertheless, Greta Gerwig does an excellent job in balancing these timelines, and an even better one by opposing the contrasting tones of each period and still make them consistent.\r\n\r\nTechnically, Yorick Le Saux offers gorgeous cinematography, Alexandre Desplat provides a subtle yet efficient score, but the costume design steals the show by being extremely period-accurate. The colors of the whole movie tell a story on their own, as well as the set design, so be sure to look around on each wide shot because there is much to see behind the actors.\r\n\r\nIn the end, Little Women doesn't do enough to warrant a spot in my 2019's Top10, but Greta Gerwig's adaptation of the classic graphic novel deserves all of the screenplay awards it has been receiving so far. As expected, the whole cast is phenomenal, but Saoirse Ronan, Florence Pugh, and Timothée Chalamet not only deliver the best performances of the film, but their characters carry the most compelling arcs. With so many people, it's remarkable the level of detail, complexity, and depth that each character has. However, some storylines are not as captivating as others, and the pacing suffers from these less exciting stories, which bring the movie down for some moments. The past-present transitions are mostly well-handled but a few are too confusing and abrupt. The contrasting tones of each timeline are consistent throughout the runtime, and the costume design steals the \"technical spotlight\". Overall, it's a pretty good romance, so if you enjoy the genre, I can't see why you shouldn't enjoy this one.\r\n\r\nRating: B+",
                "id": "5e3327184ca67600174ecd74",
                "url": "https://www.themoviedb.org/review/5e3327184ca67600174ecd74"
            }
        ],
        "total_pages": 1,
        "total_results": 4
    },
    {
        "id": 390043,
        "page": 1,
        "results": [
            {
                "author": "garethmb",
                "content": "For professional Bodyguard Michael Bryce (Ryan Reynolds), life is good. As an elite member of his craft, he is well paid and lives a very good life keeping high-profile targets safe the world over. When things unexpectedly take a turn we find Michael two years on having hit the skids and struggling to claw his way back to prominence in the new film “The Hitman’s Bodyguard”.\r\nThings become complicated for Michael as a despotic tyrant named Dukhovich (Gary Oldman) is on trial for war crimes and countless atrocities, and is about to go free due to removing all those who would be able to testify against him with credible evidence.  That is with the exception of one Darius Kincaid (Samuel L. Jackson).  Darius is incarcerated but makes a deal to testify in exchange for his wife (Selma Hayek), being granted freedom.  Darius knows he is a marked man but takes the chance and under the watch of Interpol Agent Roussel (Elodie Yung), they set off.\r\nNaturally things do not go as planned and the two find themselves fleeing for their lives with numerous deadly assassins hot on their heels.  Unsure who she can trust, Roussel calls in Michael even though they have some seriously unresolved issues about one another that destroyed their previous relationship. Further complicating matters is the history Michael and Darius share which makes them naturally hostile to one another.\r\nNevertheless, Michael and Darius set off to reach the courtroom but the imposed deadline and face numerous dangers and hilarious situations along the way.\r\nJackson and Reynolds work very well with one another and their banter and chiding comes across as very natural.  The jokes come more often than I expected but the film is very much an action film, and the sequences are intense, funny, and gripping, especially and extended chase and fight sequence along the canals and shopping district of Amsterdam.\r\nWhile some may say that the film is just a variation on the Buddy Cop genre of old, the strong cast and the winning mix of jokes and action make the film a very pleasant surprise and one of my more enjoyable films of 2017. It was a highly-enjoyable thrill ride and one of the best films this summer.\r\nIf you are a fan of action, comedies, and the pairing of Jackson and Reynolds, do not miss this film.\r\n4 stars out of 5.",
                "id": "59966f9ec3a368073500727f",
                "url": "https://www.themoviedb.org/review/59966f9ec3a368073500727f"
            },
            {
                "author": "Gimly",
                "content": "_The Hitman's Bodyguard_ is getting absolutely flensed by the critics, including several of whom I personally value the opinion of very highly. But when it comes to _The Hitman's Bodyguard_, I gotta flat out disagree. It's not out here changing lives for the better, and it's hardly gonna ride out the year on a palanquin of Oscar nominations, but I had a seriously enjoyable time with The Hitman's Bodyguard. Jackson and Reynolds worked. The leads and their respective romantic entanglements worked. Most of all, director Patrick Hughes worked his ass of to blend comedy, action and romance and have it pay off. This isn't Hughes' best work though, if you want to see that, check out 2010's _Red Hill_.\r\n\r\n_Final rating:★★★ - I liked it. Would personally recommend you give it a go._",
                "id": "59a394ddc3a368227b009cf8",
                "url": "https://www.themoviedb.org/review/59a394ddc3a368227b009cf8"
            },
            {
                "author": "Reno",
                "content": "**Once upon a time two sworn enemies teamed up!**\r\n\r\nMaybe the critics are right, but like usual, I don't have to agree with them. This is a nice film, not a great film as a few people lauding. It is entertaining. All the stunts were good, comedies were good enough, but the basic plot itself a cliche. Yes, anybody aged 20+ would surely have seen many similar storied films. It's just in another time with another cast and crew. They had promoted it so well. So the result was incredible. But in reality JUST one time watchable film with not expecting serious laughs.\r\n\r\nInitially I thought it could be this year's 'The Nice Guys', and they are about to repeat the same magic of Crowe and Gosling duo. But it was different. Too hard hitting, just what Tarantino fans would like to have. Besides, their guy, Samuel L. Jackson is here. Both the leads were good. That does not mean they have saved the film. That's an assumption of fanboys. Luck could be another factor!\r\n\r\nIt was about a hitman in capture decides to give an important testimony in the International Criminal Court against a powerful man. So now the bad guys are after him in his every move from England to Holland. A demoted bodyguard takes the job to safely get him to his destination. Their journey begins where they are going to encounter a series of obstacles and they finally make it where a major twist comes in before the end.\r\n\r\nAs I said, this is no special, except the way they have presented on the screen makes the difference. But again, not all films are lucky in that criteria as this one. It is like one in a 20-25 films. So if your objective is timepass, then this will do just fine. There could be a sequel, probably prequel seems a nice idea. But I'm not sure whether I want it or not. I'll just be happy if they do!\r\n\r\n_7/10_",
                "id": "5a772555c3a36859cf044a1a",
                "url": "https://www.themoviedb.org/review/5a772555c3a36859cf044a1a"
            }
        ],
        "total_pages": 1,
        "total_results": 3
    }
]