[
  {
    "id": 441614,
    "page": 1,
    "results": [],
    "total_pages": 0,
    "total_results": 0
  },
  {
    "id": 337167,
    "page": 1,
    "results": [],
    "total_pages": 0,
    "total_results": 0
  },
  {
    "id": 284053,
    "page": 1,
    "results": [
      {
        "id": "59f09b979251416ac10169f7",
        "author": "Gimly",
        "content": "_Ragnarok_ is a tough one to review completely without spoiler, so I'll keep this brief:\r\n\r\n* I was bothered by a small number of things that happened in this movie.\r\n* I was in love with a large number of things that happened in this movie.\r\n* _Thor: Ragnarok_ is not the MCU's best movie.\r\n* _Thor: Ragnarok_ is the MCU's most fun movie.\r\n* Can we **please** have a worldwide ban on putting anything that happens in the third act of your movie, in said movie's trailers?\r\nThank you for your time. 4 stars.\r\n\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._",
        "url": "https://www.themoviedb.org/review/59f09b979251416ac10169f7"
      },
      {
        "id": "5a08bdccc3a368672a006056",
        "author": "Movie Queen41",
        "content": "The Best CBM movie of 2017\r\n\r\nThe film is one of the most entertaining of the MCU films so far and a HUGE improvement over Thor: The Dark World. Cate Blanchett as the villainess Hela, the Goddess of Death, is a far better villain that TDW's lame Malekith. Kat Dennings' annoying Darcy and Natalie Portman's bland Jane are not missed at all. Instead, we get Tessa Thompson's badass Valkyrie, who can hold her own in a fight and isn't just there just as a love interest for Thor (Chris Hemsworth). Jeff Goldblum is hilarious as Grandmaster, who runs the gladiator fights on the planet Sakaar. But the real pleasure of the movie is watching the love-hate brother relationship between Thor and his adoptive brother, Loki (Tom Hiddleston). The relationship between the two men was the only redeeming feature of TDW, and it's great to see it expanded in this movie. Also great is seeing Thor buddy up with Bruce Banner/ Hulk (Mark Ruffalo). The only thing I didn't like about the movie was the fate of The Warriors Three. They deserved better than that. But otherwise, it's a great comic book movie.",
        "url": "https://www.themoviedb.org/review/5a08bdccc3a368672a006056"
      }
    ],
    "total_pages": 1,
    "total_results": 2
  },
  {
    "id": 198663,
    "page": 1,
    "results": [
      {
        "id": "562a27ac9251412845001d90",
        "author": "Andres Gomez",
        "content": "Another forgettable Game of Ender/Hunger Games/Divergent clone.\r\n\r\nIn this case, to compensate that the main characters are often women, we just make the whole cast to be men.\r\n\r\nJust forget about this.",
        "url": "https://www.themoviedb.org/review/562a27ac9251412845001d90"
      },
      {
        "id": "58c95a2992514110ed00a8a6",
        "author": "CharlesTheBold",
        "content": "It was a good movie as far as it goes -- resourceful characters deprived of both freedom and their memories manage to build a society and think their way out of their bondage.  The problem is that at the end, it simply stopped.  No dramatic reason for ending where it does, no resolution of \"why did the captors do this?\" .  Even in a series a movie ought to have a decent local climax -- for example,  Kat and Peeta winning the Hunger Games.",
        "url": "https://www.themoviedb.org/review/58c95a2992514110ed00a8a6"
      },
      {
        "id": "5a3d1dbac3a368148f0acd87",
        "author": "Per Gunnar Jonsson",
        "content": "One thing that I liked about this movie from the start was that it was, in my limited experience at least, somewhat original. Yes it was an apocalypse story but I have really not seen anything quite like it before. Yes moving mazes and all that have been done but the story as a whole was new to me. That was refreshingly enjoyable in this age of more or less boring Hollywood remakes.\r\n\r\nOn the whole I quite enjoyed the movie. I would label it a “young adult” movie. Not only because the lead characters as well as almost the entire cast are teenagers but the story itself is clearly at a level directed towards a younger audience. But then, who do not wish they were young again? I quite liked the story. It clearly had its usual collection of illogical moments and plot holes but nothing really really annoying as far as I am concerned.\r\n\r\nIn my opinion all of the cast did a decent enough job of their roles. Some roles mostly consisted of standing around in the background of course but the lead characters was not bad. Teresa was more of a plot element than a lead character in this movie though that has to be said.\r\n\r\nI did indeed like the maze itself. It had a quite cool look and was well done from a cinematic point of view. The one thing that did not come out in the movie though was the reason for it all. I know that is supposed to be the mystery but it was rather frustrating nonetheless to not get any clues whatsoever. What on Earth could be the purpose of having a bunch of kids live through this experience in that way?\r\n\r\nSometimes the behavior of these kids where somewhat annoying of course. I especially disliked the plot element where that dumbass kid seemed to just want everything to stay the same forever. It is of course a classical element in stories like this but it still annoys the hell out of me every time.\r\n\r\nBottom line is still that I found this a rather enjoyable movie. I would definitely want to see the other two books made into movies as well. I have not read the books by the way so me thinking this was a new story experience is of course partly due to this fact.\r\n\r\nSHARE THIS:",
        "url": "https://www.themoviedb.org/review/5a3d1dbac3a368148f0acd87"
      }
    ],
    "total_pages": 1,
    "total_results": 3
  },
  {
    "id": 269149,
    "page": 1,
    "results": [
      {
        "id": "56e4290b92514172c7001002",
        "author": "Andres Gomez",
        "content": "One of the best movies Disney has created in the last years. Smart plot with a great background topic talking about the differences, stereotypes, prejudices and joining the tendency of giving women more important roles.\r\n\r\nIt has still several gaps to fill and enhance on the latest point but it is, IMHO, a milestone in the right direction.\r\n\r\nThe characters work pretty well and it is funny when needed and not too full of cheesy songs.",
        "url": "https://www.themoviedb.org/review/56e4290b92514172c7001002"
      },
      {
        "id": "5752fa5d925141187e0021a6",
        "author": "Reno",
        "content": "> Try everything (but differently). So Disney has done it again.\r\n\r\nThis beautiful animation came to exist because of coming together of the directors of 'Tangled' and 'Wreck-it-Ralp'. It is Disney who had once again done it, since their rival Pixer is going down in a rapid speed. As a Disney fan since my childhood, I'm very happy for their success in live-shot films and animations, especially for this one.\r\n\r\nOkay, since the revolution of 3D animation over 20 years ago after overthrowing the 2D animation, most of the big productions like Disney, Pixer and Dreamworks with few others never failed to deliver. Believe me, I was not interested in this film when I first saw the teaser and trailer. But they have done great promotions and so the film did awesomely at screens worldwide. I was totally blown away after seeing it, Disney's another unique universal charactered story. From the little children to the grown ups, everybody definitely going to enjoy it.\r\n\r\nAll kinds of animals coming together happens only in cinemas, and that too mostly in animations. But todays kids are very sharp who ask lots of questions, so they had a fine explanation for the doubts regarding putting animals in a same society. It was like the United States, where everyone came from different continents and represents different race. And so in this film every animal came from different land to live together peacefully in a city called Zootopia.\r\n\r\nSo the story begins when Judy the rabbit follows her dream to become a police officer in Zootopia. There she meets Nick the fox, who are actually arch-rival species in the wild, but it was thousands of years ago before adapting the civilisation. So trust is what not promised between them, but they're forced to work together after a small missing person case becomes their prime agenda. Solving the mystery is what brings the end to this wonderful tale.\r\n\r\nThese days animations are not just concentrated on comedies, trying to get us emotionally as well. Maybe that's how they're grabbing the adult audience, especially the families. Shakira's cameo was the highlight, and her song 'Try Everything' helped the get attention from all the corners.\r\n\r\nThe Oscars was concluded just a couple of months ago, but it already feels like the fever is gripping again for the next edition and looks like this film is leading the way for the animation category. I know it's too early, but I hope it wins it. And finally a request for the Disney, bring it on a sequel as soon as possible.\r\n\r\n8/10",
        "url": "https://www.themoviedb.org/review/5752fa5d925141187e0021a6"
      },
      {
        "id": "57a718b3c3a368255b0017d8",
        "author": "whatowatch",
        "content": "Zootopia is the latest family animation movie from Disney about a young bunny determined to be a cop at all costs  – in a land where only 'predators' are cops, she would be the first ‘prey’ cop. Seriously? Anyway, she puts on the hard work and makes it to the land where anything is possible.\r\n\r\nZootopia makes some good real life comparisons: Zootopia itself seems to look like New York, even including a hustle by a sly fox.  Racism seems to be ever present in both color and speech. But the best thing about Zootopia is Judy’s positive attitude and relentless determination to succeed.\r\n\r\nThe animation is as good as a Pixar animation – perfectly made  – and the story is well told, full of action scenes and funny moments. Kids will definitely love this one and grown up kids will enjoy the deep thought provoking tones set in this movie. \r\n\r\nThe best performance in this movie arguably comes from Police Chief Bogo whose voice is played by Idris Elba. His performance should earn him an Oscar this year! No wonder it has grossed 1 Billion dollars worldwide despite little marketing. \r\n\r\nRated 9 out of 10 only because we cannot give it a 10.",
        "url": "https://www.themoviedb.org/review/57a718b3c3a368255b0017d8"
      },
      {
        "id": "57acf08792514158770001ed",
        "author": "Austin Singleton",
        "content": "A great movie with a great message. Read my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/zootopia-review",
        "url": "https://www.themoviedb.org/review/57acf08792514158770001ed"
      },
      {
        "id": "57cc1a8fc3a3680a58003dab",
        "author": "Gimly",
        "content": "_Zootopia_ leans pretty hard on a few tropes that I absolutely detest, but even I can't deny that this animated family movie succeeds spectacularly at what it set out to do: Entertain all audiences, young & old, and deliver an important moral centre without detracting from its engaging plot. Something rarely achieved by the medium outside of Pixar. And even Pixar has had a few missteps the past years.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._",
        "url": "https://www.themoviedb.org/review/57cc1a8fc3a3680a58003dab"
      }
    ],
    "total_pages": 2,
    "total_results": 8
  },
  {
    "id": 343668,
    "page": 1,
    "results": [
      {
        "id": "5a460f6e9251411fab0931c0",
        "author": "Gimly",
        "content": "This _Kingsman_ sequel might not be an outright terrible movie, but it is a **massive** disappointment. Virtually every enjoyable aspect of the first movie has been either turned down to and unsatisfyingly low level, or blasted way the fuck up into the realm of off-putting nonsense. _The Golden Circle_ somehow manages to both underserve all of its elements, while still feeling far too long. A couple of good fights, nice suits and maybe a single laugh can be found throughout the movie, but it does not do the original one iota of justice.\r\n\r\n_Final rating:★★½ - Had a lot that appealed to me, didn’t quite work as a whole._",
        "url": "https://www.themoviedb.org/review/5a460f6e9251411fab0931c0"
      },
      {
        "id": "5a8c61b79251410ac408fac7",
        "author": "Per Gunnar Jonsson",
        "content": "This is indeed a silly, even childish at time, movie but to me it was also a really really fun movie to watch.\n\nThe movie starts by the Kingsman organisation getting screwed over royally by the psychopathic Poppy Adams which forces what remains of the organisation, all two people, to work with their counterpart in the United States. Just as the Kingsmen are parodies on the stiff upper lip British gentleman the Statesmen are parodies of the southern US gentleman (if you can actually call them that) only even more so. Maybe it is my European heritage but I personally feel the Kingsmen are fairly cool where the drawling Statesmen are more on the silly side.\n\nOnce again Eggsy is the main character although I have to say that I personally like Harry, the original Galahad, much more. He has much more charisma, elegans and smarts. Since he is portrayed on the movie posters I guess it is not much of a spoiler when I say that, to my delight, the rumors of his death were greatly exaggerated. Unfortunately Eggsy is sometimes quite cool and plays his British gentleman role quite well and sometimes he is just dumb as a doornail.\n\nPoppy Adams is okay but she is bordering on the ludicrous too much for my taste. The we have a certain English artist, a Sir no less. I do not know how much they had to pay to get him to take part in this movie but I am fairly sure I would consider it too much. He was just silly as far as I am concerned.\n\nThe movie is of course loaded with gadgets, most of them of the variety that makes noises of varying levels of loudness usually resulting in one or more bad guys biting the dust. It is almost gadget overload but I really liked. Sometimes this amount of totally unbelievable gadgets is dragging down the movie more than anything but in this one it was mostly a success. To me Harry and the gadgetry is what makes this movie.\n\nGiven that I am originally from Sweden I have mixed feelings about Eggsy’s girlfriend and the Swedish royalties. I guess those parts were okay but I could have been without them as well. At least I feel that however wrote the scene with the “royal” dinner could have read up on Swedish etiquette. Knocking on a glass with your spoon, knife or fork means you are about to give a speech, NOT that you want the plates to be changed. A professional servant, and the Swedish royalty DO have professional servants, do not need to be told when to change plates.\n\nThe actual story is, well it is original at least but I would not rate it any higher than okay. It served as a vehicle for stringing together all the stunts and jokes so it served its purpose. The worst part of the story was that I was actually finding myself agreeing with the president. This might perhaps shock some people but I am sorry, if you are dumb enough to ingest that crap, which is also highly illegal, then I have no sympathy for you.\n\nIf you get upset about stupid plot details and plot holes then be prepared to be upset. There are plenty of them in this movie. To me it did not matter too much since this is not really a thriller or drama. It is a spy parody / comedy. Having said that it did piss me off a bit that this advanced organisation did not have brains enough to deal with the piece of equipment left in the London cab at the beginning of the movie. I mean, it was just soo obvious what would happen.\n\nAnyway, on the whole this movie was great fun to watch. I hope we get another sequel. Perhaps one with a Japanese version of the Kingsmen? There ought to be plenty of cultural stereotypes to play on there.",
        "url": "https://www.themoviedb.org/review/5a8c61b79251410ac408fac7"
      }
    ],
    "total_pages": 1,
    "total_results": 2
  },
  {
    "id": 374720,
    "page": 1,
    "results": [
      {
        "id": "5975c00f92514106a802387a",
        "author": "Screen-Space",
        "content": "\"Surely the filmmaker’s insistence upon imposing his favourite device upon all his narratives is edging towards Shyamalan-like overkill...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/7/22/dunkirk.html",
        "url": "https://www.themoviedb.org/review/5975c00f92514106a802387a"
      },
      {
        "id": "59824ad8c3a3680d3201d930",
        "author": "CourtneyM17",
        "content": "I was a little disappointed with this movie. I expected much more. Cinematically it was brilliant and it was an event/action driven movie when left me feeling a little disconnected. We don't know anything about these characters that we see and I personally didn't feel any emotions for the movie, even though I wanted to. I found myself quite bored halfway through the movie, the whole time I kept expecting more.",
        "url": "https://www.themoviedb.org/review/59824ad8c3a3680d3201d930"
      },
      {
        "id": "5984ff1fc3a36875040120b5",
        "author": "Pierre_D",
        "content": "Tense film draws you to a doomed group.\r\n\r\nThose how are veteran war historians will quibble at some parts of Dunkirk, notably the separation of English and French troops in evacuation and the ships used to evacuate them. Dunkirk uses a few conceits to keep you involved. The first, which adds a notable amount of tension to the film, is a ticking clock in the background moving you to the final day. We see intercut scenes from different periods, prior, during and enacting the rout.\r\n\r\nActing is excellent throughout, and versimilitude is achieved with models of aircraft, uniforms, landing stages and so on. Injections of friendship and subsequent loss direct our affection to the sufferers. Harry Styles is more than competent as a young troop and Kenneth Branagh brings integrity and verve to his role as a tired and firm leader. If one oversight might have been addressed, it is the lack of focus on the German side of things in this affair. Our few glimpses are of German fighters and so on, with very explanation of the goings-on at the front.\r\n\r\nOverall an excellent war movie meant to be among your top ten, if not top five (It will be hard to dislodge All Quiet on the Western Front, Apocalypse Now, Paths of Glory, Saving Private Ryan and Tora Tora Tora!, among others). Recommend highly a good 8/10.",
        "url": "https://www.themoviedb.org/review/5984ff1fc3a36875040120b5"
      },
      {
        "id": "59b8094f9251417e650011f9",
        "author": "defjeff",
        "content": "Dunkirk is a beautiful and unconventional World War 2 epic that is undoubtedly captivating, but it takes risks that may alienate some viewers. \r\n\r\nWhen people talk about a film they think it's about the setting, but it's actually about the characters. Saving Private Ryan isn't about World War 2. It tells a story about a squad of soldiers tasked with finding a young Private Ryan and getting him back safely to his family. Saying Dunkirk is a film about the Battle of Dunkirk however, is not inaccurate. The setting and characters are one. The choppy waters of the English Channel are equally as important, if not more so than the people who fought and died in them. As much as this makes for an interesting way to make a mainstream war film, it's also the reason why I wouldn't care to sit through it again. In some ways, it feels like watching a documentary with the narration turned off. \r\n\r\nI walked away impressed, and at the same time emotionally and intellectually unfulfilled.",
        "url": "https://www.themoviedb.org/review/59b8094f9251417e650011f9"
      },
      {
        "id": "5a45fd130e0a264f8507a60a",
        "author": "Gimly",
        "content": "_Dunkirk_ was my best mate's favourite film of 2017. I find it difficult to understand exactly what drew him to this film so strongly. I find it difficult to say anything passionate about _Dunkirk_ at all. I think I arguably felt some tension in the earlier moments, and some of the shots were beautiful... I think? I honestly can't remember. _Dunkirk_ washed over me in the least impactful way possible, and then, like the tide, it was gone.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._",
        "url": "https://www.themoviedb.org/review/5a45fd130e0a264f8507a60a"
      }
    ],
    "total_pages": 2,
    "total_results": 6
  },
  {
    "id": 284054,
    "page": 1,
    "results": [
      {
        "id": "5a844e0fc3a36862e100c22f",
        "author": "Gimly",
        "content": "The reviews for _Black Panther_ are all essentially saying the same thing: This is a great movie because it's so different from anything we've seen before, not just in the MCU but in the superhero genre overall, the villain is fantastic and _Black Panther_ is just a new and totally innovative film. Allow me to disagree (almost) entirely. _Black Panther_ is a great film, not because it breaks the mould, but because Marvel Studios has a successful pattern and _Black Panther_ adheres to it completely. Obviously the importance of a lead who is not just black but actually African is not to be understated, we have the least white cast of any superhero movie to date and they absolutely killed it, all very important socio-political stuff, to be sure. But the bones of _Black Panther_, the plot, the script, the events, the turns, all of that, it's a carbon copy of what's worked 17 times before. It works again, don't get me wrong, _Black Panther_ truly was an experience, both important and fantastic, but to say it re-invented the wheel here, is, to me, an outright lie.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._",
        "url": "https://www.themoviedb.org/review/5a844e0fc3a36862e100c22f"
      },
      {
        "id": "5a87b8550e0a26535a047632",
        "author": "hankster3000",
        "content": "Overrated and overhyped. Definitely avoid. Watch on redbox if you must.",
        "url": "https://www.themoviedb.org/review/5a87b8550e0a26535a047632"
      },
      {
        "id": "5a8894ba0e0a2653db05d34f",
        "author": "Movie Queen41",
        "content": "This is definitely one of Marvel's best because the story is compelling and the characters are well developed. Black Panther and his friends and family must defend themselves and their homeland of Wakanda from the clutches of Klau (Andy Serkis) and Killmonger (Michael B. Jordan). Not only is the lead actor great as T'Challa/Black Panther, but the supporting cast does a fine job as well, especially the female actors. T'Challa is surrounded by smart, strong women. Marvel seems to break its villain curse with Klau and especially Killmonger. Killmonger is very well developed and even sympathetic at times, despite his villainy. He sort of reminded me of Tom Hiddleston's Loki. The action scenes and special effects are outstanding. Highly recommended if you enjoy comic book movies.",
        "url": "https://www.themoviedb.org/review/5a8894ba0e0a2653db05d34f"
      },
      {
        "id": "5a8dfdcf0e0a263e6e006d75",
        "author": "Crenor",
        "content": "Really good movie. Good story, lots of fun. This is what DC is missing.",
        "url": "https://www.themoviedb.org/review/5a8dfdcf0e0a263e6e006d75"
      },
      {
        "id": "5a93b14b0e0a2616c602de5e",
        "author": "Per Gunnar Jonsson",
        "content": "It was with some hesitation that I went to see this movie. I was afraid that it would be burdened with too much political and social preaching. Especially knowing how much the movie is praised amongst certain factions in our society today. Sure enough there were indeed some of that nonsense but luckily it was much less than I feared.\r\n\r\nI actually found the movie fairly entertaining. It is far from great, certainly very far from the insane hype surrounding it, but pretty okay. It is more or less a standard issue super hero movie on a big budget. Of course this means a fairly mediocre underlying story beefed up with lots of action and special effects.\r\n\r\nThe story itself is a traditional revenge story with some black power stuff. Nothing to write home about but it works as a vehicle for the action and special effects which is what makes this movie. There are the usual nonsense and plot holes in it of course. Like Shuri claiming that Vibranium (silly name but never mind) is instable at high speeds yet they have no problem making flying ships and other fast moving stuff with it.\r\n\r\nThe characters are a wee bit disappointing as far as the main characters are concerned. I felt that the main protagonist has little in terms of charisma. Killmonger, the main bad guy, was downright disappointing. To me he looked like the stereotype of a dumb thug and mostly he behaved like one. Bloody hell could they not have found an actor that looked less…well…stupid!\r\n\r\nPersonally the character I liked best was actually Klaue which was pretty cool, insane but cool. The female warriors, which were both kick-ass and smart, and Shuri is also fairly high up on my approval list.\r\n\r\nSpecial effects! This is of course where this movie shines. Overall I think the special effects were good. The design of the various gadgets, ships etc were very nice. The rampaging rhinos in the final fight really made me laugh. I should have seen that coming. I definitely liked all the sonic effects. Obviously this movie would have been more or less null if the special effects would not have been a success.\r\n\r\nOn the whole Black Panther is a quite enjoyable special effects and action movie. Nothing more, nothing less. Some social preaching nonsense but less than I feared, hum ho story, lots of action and lots of special effects.",
        "url": "https://www.themoviedb.org/review/5a93b14b0e0a2616c602de5e"
      }
    ],
    "total_pages": 1,
    "total_results": 5
  },
  {
    "id": 216015,
    "page": 1,
    "results": [
      {
        "id": "56caebd89251415bcc000d41",
        "author": "Andres Gomez",
        "content": "Honestly, it has been a long time since I've watched such a bad movie.\r\n\r\nThe script is just ... stupid and the dialogues even worse. The characters are not believable. I mean, when you watch Twilight, you just swallow the whole thing because it is fantasy and ... OK, it is just a stupid vampires story but, this is just toooooooo bad.\r\n\r\nI've not read the book but I suspect the fail is not just in the movie but that it is adapting something that is already bad from the beginning.\r\n\r\nThe worst is that I kind of liked Dornan in his role in Fallen but this movie has made me realize what a short range of performing resources he has. Dakota Johnson is not too bad, though. The acting is OK, it is just that you hate such an stupid character.\r\n\r\nOne more to my very narrow list of movies in which I have seriously thought stop watching by the middle of it. I wasted the second hour too, though.",
        "url": "https://www.themoviedb.org/review/56caebd89251415bcc000d41"
      }
    ],
    "total_pages": 1,
    "total_results": 1
  },
  {
    "id": 214756,
    "page": 1,
    "results": [
      {
        "id": "567c2f54c3a3684bc9004101",
        "author": "Reno",
        "content": "> The return wasn't as exciting as the previous one.\r\n\r\nNo surprise why this film failed to excite me, but a few people thinks its a passable sequel. The original movie was atypical, so the success followed it. In my perspective better that should have left as a one-off movie. But as a low budget product, they knew it was going grab back twice, thrice they spent because of the star value and indeed the first film's influence.\r\n\r\nThere is no story, simply based on the usual Hollywood road adventure like the flicks 'Fanboys', 'Dumb and Dumber To', 'Not Suitable for Children' et cetera, except the character Ted which makes this theme a special. A couple of good jokes and that's it, the rest were ineffective, sometime keep repeating the same ones. The 2 hours in a too plain concept, is way too long to sit and watch/focus.\r\n\r\nThe cameos were weak, or maybe worthless/meaningless, especially Liam Neeson's. The best things were the production quality, acting and like I mentioned before, the character Ted. For the one time watch, I think kind of manageable, but definitely not suitable for repeat viewing or to recommend it to the others. But overall, a little disappointed with the outcome. They have got one more chance to end this franchise on a high note as a decent trilogy if the next film gets a better storyline.\r\n\r\n6/10",
        "url": "https://www.themoviedb.org/review/567c2f54c3a3684bc9004101"
      }
    ],
    "total_pages": 1,
    "total_results": 1
  },
  {
    "id": 346364,
    "page": 1,
    "results": [
      {
        "id": "59afaa2cc3a3682e6401064f",
        "author": "Screen-Space",
        "content": "\"Skarsgård goes to hell and back to craft a truly malevolent creation, utterly believable as the black soul of King’s cursed small town...\"\r\n\r\nRead the full review here: http://screen-space.squarespace.com/reviews/2017/9/6/it.html",
        "url": "https://www.themoviedb.org/review/59afaa2cc3a3682e6401064f"
      },
      {
        "id": "59bfb66c9251414745014240",
        "author": "Nay Myo Myat Ko",
        "content": "**This movie went right to the trash.** I cannot believe what Warner Bros has done for this piece of trash.\r\nYes, there have been rave reviews for this movie, but we recommend that you do not mind them, as we should not be teaching children on how to safely get sodomized by a monster.\r\n\r\nThese directors' brains are also in the trash. Now let's put the MPAA R rating right into the trash where it is supposed to go. Final warning: **Don't let your kids watch trash.**",
        "url": "https://www.themoviedb.org/review/59bfb66c9251414745014240"
      },
      {
        "id": "59c098eac3a36804db00aeb6",
        "author": "Gimly",
        "content": "More _Fucked-Up-Coming-of-Age_ than _Monster-Movie-Slasher-Horror_. Which is what it should be, but perhaps not what it's marketed to be. Stephen King's _It_ is one of my all time favourite books, and I don't know that it will ever get a faithful adaptation (totally understandable seeing as the thing is 1200 pages and contains a multi-book spanning mythology of Space Gods and Turtle vomit), but this does a pretty good job of interpreting the feeling of the novel, even if it's not a great adaptation the events as a whole.\r\n\r\nThe kids are all great, Skarsgård makes for a good Pennywise, Pennywise improves as the piece moves forward, and the town is completely believable as \"Derry\" in the '80s. It may not be all it's purported to be, but is a very impressive film on its own merits.\r\n\r\n_Final rating:★★★½ - I really liked it. Would strongly recommend you give it your time._",
        "url": "https://www.themoviedb.org/review/59c098eac3a36804db00aeb6"
      },
      {
        "id": "59c711d19251415b5404ecef",
        "author": "Rythwik",
        "content": "If you are gonna watch this movie go to the theatres and watch it...It's way more scarier than Annabelle: Creation and you will have lots of jump scares too.",
        "url": "https://www.themoviedb.org/review/59c711d19251415b5404ecef"
      },
      {
        "id": "59cfdca4925141141e00215a",
        "author": "Frank Ochieng",
        "content": "Something certainly rings true in the horror thriller **It** that capitalizes on that common known fear that clowns are creepy annoyances to those that have an intense phobia towards them. In the case of **It’s** dastardly powder-faced joyboy or shall we say corrosive killjoy Pennywise the Dancing Clown, he definitely takes the cake in terms of his treacherous tendencies to quiet the unsuspecting kiddies in devious fashion. Here is a tip, parents, do not invite the poisonous Pennywise to your kids’ birthday party any time soon to blow up balloons and sing songs. This is just a friendly little warning. There is more to elaborate on regarding the sicko circus funnypants freak later.\r\n\r\nDirector Andy Muschietti (‘Mama’) delves into this surprisingly delicious twisted and terrorizing tale of a killer clown that gets his jollies off snuffing the lives out of rural-based youngsters in this calculating frightfest that pushes all the right buttons of panic and perversion. Skilfully edgy and traumatically tasty, **It** is a refreshing throwback to old-fashioned gory-minded gems where the boundaries of old-fashioned scare tactics were designed not only by the actual act of homicidal happenings but the mere suggestive nature of the heinous hedonism taking place. Polished and gripping in its shadowy and shifty overtones, **It** is convincingly probing as an absorbing psychological character study with an off-kilter sense of defiance in its naughty commentary on youthful innocence being compromised.\r\n\r\nBased on the novel from famed hair-raising author Stephen King, **It** delivers the solid, sordid goods of a wild and wicked imagination following the acidic exploits of a menacing clown in the aforementioned Pennywise (played with penetrating  and devilish aplomb by Bill Skarsgard from ‘Atomic Blonde’) whose murderous methods of slaughtering the young has been a staple signature in his madness for centuries now. The surviving tykes in the quaint town of Derry, Maine must now safeguard themselves from the makeup-wearing whackjob and figure out a way to terminate the baggy-panted beast before he continues to strike again and victimize another doomed child.\r\n\r\nThe backstory behind Pennywise’s existence is that he is some shape-shifting demon that emerges from the sewers only to target the unlucky rugrat in his immediate path while conniving, and conducting his blood-thirsty ways. However, there are a group of children that refuse to play dead for the demented clown and the quest to create an ill-advised showdown with the deplorable Pennywise would prove to be a very violent and mentally scarring experience in the process.\r\n\r\nThe story centres around young Bill (Jaeden Lieberher, ‘Allegiant’) and his early encounter with the sadness of unknowingly witnessing Pennywise’s wrath as it was inferred that the clown had to do with the demise of his precious little brother, George (Jackson Robert Scott), who never returned after enthusiastically wanting to work on a fun project in the basement. This haunting revelation sticks with poor Bill until this very day.\r\n\r\nNowadays, Bill must cope with the typical obstacles at school avoiding bullies and dealing with the pitfalls of peer pressure and needing to belong to a group of trusty associates. Thus, Bill is able to cement close relationships with the town’s other free-spirited youngsters. Still, there is that hovering myth about the mysterious sewers and, yes, the evil-minded Pennywise is at the forefront of fearful concern for Bill and the bunch. In fact, the gang will succumb to their collection of fears, paranoia and hesitation as the suburban legend of the creep-seeking clown clouds each of the kids’ tainted psyches.\r\n\r\nThe ensemble of young actors in **It**  all register accordingly with their characters’ childhood shock in trying to overcome the overwhelming and petrifying mindset that has invaded their sensibilities. Lieberher has an authentic raw turn as the lead lad invested in the bizarre boundaries of matching wits with the demonic chalk-skinned trickster and his committed craziness. The other supporting cast of exposed kiddies on this adventurous train wreck of terror includes Sophia Lillis (’37’), Finn Wolfhard (from television’s ‘Stranger Things’), Jeremy Ray Taylor (‘Alvin And The Chipmunks: The Road Chip’), Wyatt Oleff (‘Guardians Of The Galaxy”), Chosen Jacobs, Jack Dylan Grazer (‘Tales Of Halloween’) and Nicholas Hamilton (‘Captain Fantastic’).\r\n\r\nThere is no doubt that Skarsgard’s clown of corrosion in Pennywise steals the show with his nefarious nature blistering shamelessly in seedy-minded elation. Clearly, Skarsgard chews the tarnished scenery with his abominable costumed cretin tip toeing on the unassuming sidelines while striking gory goosebump moments for his pubescent prey on screen and the twitchy audience off screen.\r\n\r\nSure, **It** suffers from the conventional trappings of cheesy false alarm jolts and the obligatory lurking in the dark sequences are arbitrarily tossed in as an aftermath for the legitimate lunacy of our star-making crazed and corruptible clown to perform his showboating insanity. Besides, what horror showcase has not welcomed the invitation of the overused and abused jump-scare techniques highlighted by a jittery soundtrack? Still, Muschietti and screenwriters Chase Palmer, Cary Joji Funkunga and Gary Dauberman manage to supply the infectious and insidious **It** with well-executed scary shenanigans, well-paced anxiety, wavering vulnerability and decent acting on behalf of the performers that aptly brought to life the eerie visions and vitality of King’s complex, creative mind.\r\n\r\nTruly **It** is one of the best harrowing and in-depth horror/psychological thrillers to emerge in 2017. Also this titillating tale of cautionary kiddie chaos may be one of King’s formidable movie adaptions since the effective tension-filled, off-the-wall brilliance of 1990’s _Misery_.    \r\n\r\n**It** (2017)\r\n\r\nWarner Bros. Pictures and New Line Cinema\r\n\r\n1 hour 35 minutes\r\n\r\nCAST: Bill Skarsgard, Jaeden Lieberher, Sophia Lillis, Finn Wolfhard, Jeremy Ray Taylor, Wyatt Oleff, Chosen Jacobs, Nicholas Hamilton and Jack Dylan Grazer\r\n\r\nDIRECTOR: Andy Muschietti\r\n\r\nWRITERS: Chase Palmer, Cary Joji Funkunaga, Gary Dauberman\r\n\r\nMPAA Rating: R\r\n\r\nGENRE: Horror/Mystery & Suspense\r\n\r\nCritic’s Rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** 2017",
        "url": "https://www.themoviedb.org/review/59cfdca4925141141e00215a"
      }
    ],
    "total_pages": 2,
    "total_results": 7
  },
  {
    "id": 335777,
    "page": 1,
    "results": [
      {
        "id": "5a7705e992514105a3044502",
        "author": "Reno",
        "content": "**Returning home and fighting back for it.**\r\n\r\nFrankly, I did not think there will a sequel, but this one came out and I say I'm not fully disappointed. It is an acceptable film with a good message told with full of cliches. The story continued from where the previous one had ended. Right away a new adventure begins. Surly and his friends, after losing their stock of food, now forced to return to their natural home, the park. But the place is getting turned into an amusement park by an evil mayor. So they plan to fight back and how they succeed are the revealed in the remaining part.\r\n\r\nAs I said, not bad. At least the children would enjoy it better. The new characters are good, but that did not bring more fun. The comedies were average. With this year's average result from all the animated feature that had released, this film does not look so bad at all. Only if the story had been much better, it would have achieved a better result. The production and all the voice-over work were good. I don't know there will be another sequel, but I don't wish, except if they come up with some good story to tell for all ages. It's just once watchable!\r\n\r\n_6/10_",
        "url": "https://www.themoviedb.org/review/5a7705e992514105a3044502"
      }
    ],
    "total_pages": 1,
    "total_results": 1
  },
  {
    "id": 99861,
    "page": 1,
    "results": [
      {
        "id": "56351986c3a3681b59017d48",
        "author": "Hotsake",
        "content": "There is a lot going on in this movie but it all just seemed kind of pointless and dull to me. Every now and then there would be a good scene or piece of dialogue but for the most part I felt myself getting bored and reaching for my phone to play Cribbage. I guess what I didn't like most is that it all felt like a big filler episode instead of an action packed character driven story arc.",
        "url": "https://www.themoviedb.org/review/56351986c3a3681b59017d48"
      },
      {
        "id": "5804e364c3a3686a3400000e",
        "author": "Andres Gomez",
        "content": "Action, good Fx and a \"not-completely-absurd\" story. The actors perform well and you can identify them very well with their characters ... but it is all old and without imagination.\r\n\r\nI suppose nobody was expecting anything else, though ...",
        "url": "https://www.themoviedb.org/review/5804e364c3a3686a3400000e"
      },
      {
        "id": "5a66d16ec3a3680cfb006191",
        "author": "Per Gunnar Jonsson",
        "content": "This is another one of those movies that you watch primarily for the special effects with you favourite super heroes slugging it out. It is a classical Hollywood product where the story is mostly there just as a vehicle for allowing the special effects team to do their business. As such it is a success.\r\n\r\nThe movie starts of with a display of action and the afore mentioned special effects with an attack by the Avengers on a bad guy stronghold. Not surprisingly the events sows the seeds for things to come.\r\n\r\nThe movie starts off with quite an interesting story idea with the activation of Ultron. However, once he materializes as a physical entity, it became a bit of seen that, been there and done that. Ultron just turns into yet another “standard” comic book villain a’ la Megatron running around trying to look intimidating while implementing his diabolical scheme. Okay, there was a bit of originality here and there but with the good start I kind of expected a wee bit more.\r\n\r\nHaving said that, the movie does indeed fulfil its purpose of showing off a bunch of super heroes slugging it out in a flurry of special effects and, although the story idea was perhaps not used as intelligently as I had hoped, it is not bad (for this kind of movie of course) and hangs together pretty okay. Sure, it is somewhat contrived and the means by which Ultron tries to exterminate humanity is overly complicated but it is still a decent story.\r\n\r\nOverall the movie was entertaining and provided the necessary special effects and super hero fix for those who are inclined to enjoy those kind of movies. I certainly am and, not surprisingly, the kids liked it as well.",
        "url": "https://www.themoviedb.org/review/5a66d16ec3a3680cfb006191"
      }
    ],
    "total_pages": 1,
    "total_results": 3
  },
  {
    "id": 258489,
    "page": 1,
    "results": [
      {
        "id": "580e47439251416e0d001ad3",
        "author": "Reno",
        "content": "**Yep, this is a different Tarzan, an updated one.**\r\n\r\nRecently the Indian jungle boy, the live-action Mowgli film was made and so its time for Africa's. This is not a Disney film and that's one of the disappointments for the Tarzan fans. Because this film is for the grown-ups only. It is rated PG13, but still I don't think the children would enjoy it like they did for the recent 'The Jungle Book' film. So it is like a DC film, I mean, DC makes superhero films for the grown-ups, unlike Marvel's. The bottom line is, don't expect it to be like a Disney film. Like the director said before the release, this is not the Tarzan from your father, grandfather's era, but an updated one with strong graphic violence.\r\n\r\nSo the story skips all the Tarzan's earlier life like from his childhood to adulthood parts. The film commences with Tarzan being settled in the UK. It's the second half of the 19th century, where the European colonies in the Africa are expanding for its rich natural resources. So in the Congo savanna, the natives welcome Tarzan for his short visit, but the things get ugly when his wife, Jane was kidnapped. Now he must fight back for her safe return and also avert other threats in the region from the foreign power.\r\n\r\nThere are many CGI character films were made at the recent time, it is a trend, but not all of them are impressive. This film looked average when it comes to vfx. The story was acceptable, the performances were decent, the casting too not bad, but Samuel L. Jackson was completely useless. He's one of the greatest sidekick Hollywood ever produced, but I don't know why he's in this project, his role was very silly.\r\n\r\nIn other hand, Alexander Skarsgard was good in the lead character and so Margot Robbie as Jane. The action sequences were not good as I expected. The film had a good runtime, but in some parts, it was slow or maybe you can say nothing interesting thing happens. I liked the idea, to update the theme, but they should have given more focus on the story. I hope if they plan another film, it should be a prequel. Because I feel there's lots to learn about the past than going forward. This is a one time watchable film, there's no surprises, just plain and partially entertaining.\r\n\r\n_6/10_",
        "url": "https://www.themoviedb.org/review/580e47439251416e0d001ad3"
      },
      {
        "id": "586638089251412b8702aed7",
        "author": "Per Gunnar Jonsson",
        "content": "This was the most underwhelming Tarzan movie that I have ever seen. A typical product of some Hollywood producer trying to make a \"modern\" take of Tarzan not really knowing or caring for the Tarzan that Edgar Rice Burroughs created. \r\n\r\nIn particular it was the palest and most underwhelming Tarzan character yet. He never radiated the strength nor the intelligence that Edgar Rice Burroughs attributed to his character. He spent most of the movie going around with a bland look on his face.\r\n\r\nThe story itself is pretty much an out of the box standard Hollywood story about slavery and abuse of the black African population. Not truly bad but nothing to write home about either.\r\n\r\nThere is a lot of CGI in the movie and although quite a few reviewers seem to consider it bad I personally though it was pretty okay. One of the few decent bits of the movie.\r\n\r\nI truly do not understand that they had the nerve to call this movie The Legend of Tarzan since it really is pretty far from the legend of Tarzan that Edgar Rice Burroughs created. This movie would perhaps have been okay as a one hour episode in a Tarzan TV-show but as a high budget feature movie it simply does not cut it. I was quite disappointed.",
        "url": "https://www.themoviedb.org/review/586638089251412b8702aed7"
      }
    ],
    "total_pages": 1,
    "total_results": 2
  },
  {
    "id": 321612,
    "page": 1,
    "results": [
      {
        "id": "58d04679c3a3682dcd0002c6",
        "author": "Salt-and-Limes",
        "content": "**Spoilers**\r\n\r\nThe live action remake of \"Beauty and the Beast\" was good, but it failed to capture the magic of the cartoon version. There were somethings that they got right, and others that dragged on.\r\n\r\nI thought \"Be Our Guest\" was done beautifully. The 3d made it even more enchanting. The main characters' backstories also added some depth to them. However, there were some scenes that I felt added nothing to the story. Such as the search for Belle by Gaston and her father. The \"No one is like Gaston\" scene didn't have the bravado or arrogance of the original.\r\n\r\nI also felt that Luke Evans was miscast. He wasn't the handsomest guy in town, nor was he the strongest. Which is why it was hard for me to accept him as the character. Emma Watson was serviceable. Her voice was fine, but it wasn't strong enough to carry Belle's songs. Dan Stevens was the best part of the film. I felt that he should have had more songs, because he has a beautiful baritone. Although his beast costume should have been more frightening. \r\n\r\nOverall, it's a fun film to watch. Though, I wouldn't call it a classic.",
        "url": "https://www.themoviedb.org/review/58d04679c3a3682dcd0002c6"
      },
      {
        "id": "58e3b31892514127f6020406",
        "author": "Gimly",
        "content": "Disney's done a great job with Gaston and The Beast, the two aspects that I always thought would be the most important, and the most difficult, to nail.\r\n\r\n_Final rating:★★★ - I personally recommend you give it a go._",
        "url": "https://www.themoviedb.org/review/58e3b31892514127f6020406"
      },
      {
        "id": "594309d5c3a3686c0d01406e",
        "author": "Reno",
        "content": "**Only beauty would conquer the beast!**\r\n\r\nThis is not the first time screen adaptation, that means every one of us have seen either version of the films according to what generation we belong. Mine was the animated one and then there was a modern-day version called 'Beastly'. Not to forget there's a recent French version made on the big scale that I yet to watch. So it's not about the story at all. It is about the quality of film, performances, and particularly how the modern technology used to narrate the story.\r\n\r\nLike the recent Disney's live-actions 'Cinderella', 'The BFG', 'The Jungle Book' and many more, this is another excellently adapted film from the book. Though visually it tried to be true to the original, and that's absolutely great thinking. Because in this modern world, we all try something new out of the original contents for sometimes to mess it up.\r\n\r\nExcellent casting, the beauty was the best pick among all. The graphics were awesome. The CGI beast was flawless, yet that usual dark and cloudy atmosphere helped it to be so perfect. Since it is listed under Musical, I was worried about the songs. I truly don't like modern Musicals. But this film was not completely filled with songs. Yes, there were like half a dozen, but good ones. Retained the songs from the 1991 film, and in addition three new were composed.\r\n\r\nI did not think the Disney would get away with consecutive successes. Great achievement, and their attempts were very precautionary on their every step. Now this is Disney's second highest grossed film ever and first in live-action. The film was for all ages unlike old Disney films. That's the best thing about the modern Disney films that they have adopted. Definitely recommended for at least once watch it.\r\n\r\n_8/10_",
        "url": "https://www.themoviedb.org/review/594309d5c3a3686c0d01406e"
      },
      {
        "id": "5958a657c3a36828e701d4dc",
        "author": "Marypsa",
        "content": "JUST INCREDIBLE\r\n\r\n> I fell in love with that movie!The actors performed fantastically and the effects were so well-maid.It is a classic movie.The best Beauty and the Beast version!!The alive castle was so magical,the effects so realistic and the characters so sympathetic...It was just PERFECT!",
        "url": "https://www.themoviedb.org/review/5958a657c3a36828e701d4dc"
      },
      {
        "id": "5a50fd690e0a26027500c693",
        "author": "dezmozegreato",
        "content": "What a fantastic movie with great graphics. I was amazed at how well the beast was rendered, you never had to think about the fact that it was CGI. The story kept my entire family interested and scared to leave for popcorn.  My only concern was the gay references, I don’t think there was any added value other than shock, and **I don’t like shock in my Disney movies**.  Moving forward, the story was easy to follow and it followed the typical Disney Princess theme perfectly. The singing was delightful and the cast did a great job making the moment real.  I think this movie will stand the test of time just as the original.",
        "url": "https://www.themoviedb.org/review/5a50fd690e0a26027500c693"
      }
    ],
    "total_pages": 1,
    "total_results": 5
  },
  {
    "id": 315837,
    "page": 1,
    "results": [
      {
        "id": "58e044e8c3a3683d3e0110b2",
        "author": "Salt-and-Limes",
        "content": "I am writing this review as someone who hasn't seen the original anime. I have also been very critical of the whitewashing of this film. With that I aside, I went to see it with willingness to give it the benefit of the doubt. \"Ghost in the Shell\" is well...a beautiful shell. \r\n\r\nThe visuals were absolutely breath taking. The action scenes flowed so beautifully with special effects. But that's all the movie had to offer. Take away the spectacles and you have a basic run-of-the-mill action movie. \r\n\r\nThe acting was fine. But honestly, the leads didn't have anything to actually sink their teeth into. Scarjo, and everyone else, was serviceable. \r\n\r\nIf you're looking for some mindless, yet stunning entertainment, then go see it.",
        "url": "https://www.themoviedb.org/review/58e044e8c3a3683d3e0110b2"
      },
      {
        "id": "58e78fe5c3a368730204ce99",
        "author": "Wanderless",
        "content": "I've watched Ghost in the Shell at the cinema 3 days ago, knowing\r\nbeforehand about the controversies that have surrounded this movie for\r\nthe last 6 months or so. Science fiction movies are probably my\r\nfavorite genre and I also enjoyed most of Scarlett's movies for the\r\npast 8-9 years so those two factors were a plus for me going in. \r\n\r\nRegarding the whitewashing business, I think its been blown way, WAY\r\nout of proportion by social justice warriors with nothing better to do\r\nthan drag media attention over whatever they're feeling insecure about\r\nthis month/year. For those of you who might be on the fence about\r\nwatching a Caucasian actress in the role that (supposedly) should've\r\nbeen reserved to an Asian actress, please consider this a NON-MATTER\r\nand watch it anyway. The character she is portraying is SUPPOSED to\r\nlook Caucasian/white. It was the same in the source material and even\r\nthe creator of that anime said so in interviews.\r\n\r\nNow, is the movie any good? In my opinion, yes. Yes it was. It wasn't\r\namazing but at the very least entertaining. There is a good amount of\r\npeople who score this a 1/10 because they are butt hurt that the story\r\nwas changed a lot. Please ignore them and see for yourself even if\r\nyou're a fan of the anime and are able to keep an open mind. I think\r\nmaybe I was able to judge it more objectively because I had zero\r\nknowledge about the story in the anime going in, but, if nothing else,\r\nthe movie actually made me want to watch those old ones to compare.\r\n\r\nThe acting - 7.5/10 - Since Scarlett Johansson is the only big name\r\nthat the movie is being marketed alongside, I'd say she did a good job.\r\nAt no point in the movie could I say she didn't belong there. She\r\nplayed the part of cyborg who had difficulty belonging in a human world\r\nvery well. The cast is diverse enough in my opinion, though some of\r\nthem get pretty little screen time.\r\n\r\nThe visuals - 9/10 - If there is one point most critics/viewers are in\r\nalignment concerning this movie, that point is definitely the visuals.\r\nThe movie both looks and feels spectacular, with the futuristic city\r\nlooking like a close-future mix of Blade Runner and TRON. The\r\ncombination of CGI and practical effects looks organic, the movie's\r\npowerful themes of excessive self-augmentation and technology almost\r\nrunning amok represented very well visually.\r\n\r\nSoundtrack - 8/10 - Sometimes pretty subdued, sometimes\r\nalmost-but-not-quite in your face, I found the soundtrack to vary\r\nbetween decent and very good in some moments. It didn't MAKE the movie\r\nbut it enhanced a good deal in my opinion.\r\n\r\nStory - 7/10 - Here is where the good points of the movie kinda start\r\nto run dry. A lot of other people would probably rate it a lot lower,\r\nwith 5 or 4's if they're at least trying to be objective. Yes, the\r\nstory is fairly predictable, and the fact that the movie is only around\r\n100 minutes long doesn't do it any favors either. Here is probably\r\nwhere most of the legitimate hate towards this movie stems from. The\r\ncreators adapted a story that had a lot more depth and philosophical\r\ninsight and turned it into a somewhat generic cyborg coming of age\r\nstory mixed with an evil corporation doing questionable things. The\r\nvillain is also very cookie-cutter and has almost zero depth. HOWEVER,\r\nI do think that concerning this film's particular themes and narrative,\r\na weak villain doesn't hurt it so much since its more about\r\nlosing/gaining your humanity through technology than any bad guy trying\r\nto shoot you.\r\n\r\nWriting/Dialogue - 6/10 - By far the movie's weakest aspect. In fact, I\r\nbelieve if some more meaningful dialogue and character interactions\r\nwere written into this film, it could've easily been 1 or 2 points\r\nhigher on anyone's scoring system. As it is, the dialogue is shallow\r\nand fairly run-of-the-mill for about half the movie's length. Some bits\r\nof good interactions are sprinkled here and there, and thankfully\r\nthat's enough to preserve the soul of the movie's central theme of\r\nhuman souls surviving in machine bodies, BUT not enough to give Ghost\r\nin the Shell the depth it should've inherited from the source material.\r\n\r\nOverall - I gave this movie 3.5/5 stars here, mostly because I\r\ncouldn't give it a 7.5/10 which felt more appropriate to me. My advice\r\nwould be to not listen to the whitewashing nonsense, because that's\r\nexactly what it is, nonsense. Also don't listen to the haters who rate\r\nthis movie a 1/10 or call it shit because those people should not be\r\nreviewing anything to begin with. It is a decent movie, with great\r\nvisuals and a theme that might get you thinking for a couple of days\r\nafter seeing it. The acting is decent, with an above average\r\nperformance from Scarlett and a good soundtrack that might hit the\r\nright spot on occasion. The only bad aspects, like I mentioned, are the\r\nfilm's rather short running time and weak dialogue/writing which hold\r\nit back from being truly great.",
        "url": "https://www.themoviedb.org/review/58e78fe5c3a368730204ce99"
      },
      {
        "id": "59169693925141580d02a643",
        "author": "Gimly",
        "content": "I know I wasn't supposed to love it but I accidentally did.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._",
        "url": "https://www.themoviedb.org/review/59169693925141580d02a643"
      },
      {
        "id": "591de0e59251414a57022805",
        "author": "Pierre_D",
        "content": "I boned up on this movie by watching the 1995 version and Stand Alone Complex for a bit, loved the repartée from Major Kusanagi and her crew and hoped it would translate to the big screen. The movie succeeds in displaying the setting and overall feel of the area. Everything is a grainy, low-tech with abundant neon and cyber-solidified humans. Sadly, the script is a bit of a mess. Kusanagi becomes Major Mira Killian (you'll see why toward the end the film) and Scarlett Johhansson, generally a quite credible actress, is sort of wasted here.\r\n\r\nWe do not get a lot of character development for her or her crewmates. There aren't a lot of quirky, funny moments as there are in the animated versions. Worse still, a lot of the teaser from the movie are just absent here, and one feels cheated. Overall this is a fine bit of popcorn absorption but fails to live up the series's standards and fails to give any of the actors much to work with. See it on a rainy day, if nothing else.\r\n\r\n3.5/5",
        "url": "https://www.themoviedb.org/review/591de0e59251414a57022805"
      },
      {
        "id": "5979fc6992514107cc015b95",
        "author": "tmdb81799156",
        "content": "I was unable to make it to the theaters for this one due to traveling for work those first two weeks.  And then it was gone; couldn't find it in any theaters. I'm sure glad I didn't waste my money for that and only spent $1.62 to rent it from RedBox.\r\nThe trailer didn't show much, which is good.  I hate trailers that give away everything about a movie.  \r\nSo, a hot girl is always good...   \r\nAnd it had the teaser nudity that isn't real but is a suit - I'll let you be the judge of that.\r\nThe rest is the same old overused nonsense from all other science fiction movies:\r\nA lot of fighting, shooting, explosions and destruction - way too much of that... but just about all sci-fi and superhero movies these days only contain that.\r\nThe first hour was incredibly boring.  After about 70 minutes, it got just slightly interesting and then all the fighting/shooting/destruction began.  There is nothing interesting about that - we've all see that hundreds of times. It's ridiculous.\r\nWhy can't any of these shooters hit anything?  We still have that.  It isn't interesting to watch.  Thousands of rounds flying and everyone missing their target.  With all this high tech stuff, why don't they have more advanced weapons?\r\nI have to say, I was in Arizona earlier this year and fired a handgun for the very first time.  It was a 6-shooter, a Colt \"Peacemaker\", you know the pistol of the \"West\".  You don't \"AIM\" those, you lift them to just above waist high, look at your target & not the gun, and pull the trigger. After just a few shots, it starts to become very natural. Any sane person can hit a target the size of a person at least somewhere on their body, even if they are moving.  24 rounds: I had 24 hits & 0 misses at various distances. But the people in these movies can't hit anything even when they do aim and with much better weapons.  \r\nAnd then you have Major, her manufactured body can stretch & tear, wires breaking, and it can still function?  Uh, NO, it wouldn't.  That's not how mechanics and electronics work.\r\nThe City: a ridiculous \"Blade Runner\"/\"Fifth Element\" type of city but with fish floating around.  No, not interesting at all. Just very silly.\r\nOh, one petty but very annoying thing: They can build an entire body and install a human brain in it and get everything to work but they can only give her a ragged, jagged wig or haircut?  That's very weird.  Her crooked bangs were a distraction in every scene that included her facing the viewer.\r\n\r\nIn Summary: This movie has a lot of awesome CGI with a ridiculous plot and horrible acting.  Great CGI alone doesn't make a great, or even a good, movie.  This catastrophe is a perfect example of that.",
        "url": "https://www.themoviedb.org/review/5979fc6992514107cc015b95"
      }
    ],
    "total_pages": 2,
    "total_results": 7
  },
  {
    "id": 433310,
    "page": 1,
    "results": [],
    "total_pages": 0,
    "total_results": 0
  },
  {
    "id": 431530,
    "page": 1,
    "results": [
      {
        "id": "5a0b4e4a92514130cd023819",
        "author": "drtvnut89",
        "content": "I might be a man but let me tell you this was one of the funniest movies I have seen this year I laughed out loud more than once and got the Christmas spirit the rest of the time the 3 beautiful women were just a joy to watch and the whole celebration of family and hilarious comedy mixed is such a Christmas treat if  your looking for some Christmas fun and full of lol moments I totally can recommend this one",
        "url": "https://www.themoviedb.org/review/5a0b4e4a92514130cd023819"
      },
      {
        "id": "5a83a3fc9251410b010025fc",
        "author": "Gimly",
        "content": "I'm not much for American comedies, and while the first _Bad Moms_ was a cut above the usual sort of thing on offering from that sector, I didn't love it, and _A Bad Moms Christmas_ is little more than a seasonal themed, watered down version of the first one, complete with the half-baked version of the main characters relearning their \"lessons\" from the original. I've suffered far worse than _A Bad Moms Christmas_, to be sure, but I think it would be better if they had just left it at one movie.\r\n\r\n_Final rating:★★ - Had some things that appeal to me, but a poor finished product._",
        "url": "https://www.themoviedb.org/review/5a83a3fc9251410b010025fc"
      }
    ],
    "total_pages": 1,
    "total_results": 2
  },
  {
    "id": 341013,
    "page": 1,
    "results": [
      {
        "id": "5979eaacc3a36867fd016327",
        "author": "Gimly",
        "content": "I have seen it said of _Atomic Blonde_ that it is hollow piece wrapped in an attractive shell. I would respond by saying that \"attractive\" hardly does the shell justice, it's absolutely fucking gorgeous. Otherwise though that sounds about right.\r\n\r\nNo, in all seriousness, the plot itself is more than fine. Even the absolute worst aspects from any individual part of _Atomic Blonde_, no matter how much you pick them apart, more than pass the litmus test for minimum acceptable standard. It truly is a case of style over substance, and that is something that I can understand the complaint for. But it's style **over** substance, not style **instead of** substance. At no point did I feel that the story was cobbled together as an excuse to get to the next setpiece. The story was what it was (a pretty genuine throwback to the espionage thrillers of the late and post-Cold War era) and the aesthetic, the music, the design, was simply how that story was chosen to be delivered. And a brilliant choice at that.\r\n\r\nWalking in, I was already certain that I was going to like the film, because even if it was just an extended version of the trailer, then it appealed enough to my personal tastes that I was in for a good time. Walking out, I knew that taking everything beyond those factors into account, I didn’t just like _Atomic Blonde_, I loved it.\r\n\r\n_Final rating:★★★★ - Very strong appeal. A personal favourite._",
        "url": "https://www.themoviedb.org/review/5979eaacc3a36867fd016327"
      },
      {
        "id": "5a703b79925141374500bbab",
        "author": "Per Gunnar Jonsson",
        "content": "This is a good solid cold war spy story with plenty of action. I have to say that I liked this movie a lot.\r\n\r\nI expected a fairly shallow over the top action flick with a sexy but not very bright kick-ass chick as the main protagonist. To my surprise I got something quite a bit more than that. Sure the movie is quite “Hollywoodish”, it is supposed to be a action movie after all, but it is surprisingly well done and Charlize Theron is great as the sexy, not at all stupid and very much kick-ass chick.\r\n\r\nAs a bit of a twist the story is told in the form of a debriefing at the MI6 headquarter. This type of storytelling can be a bit miss or hit since, unless the writer is good at it, it has a tendency to spoil the movie and the events already when the movie starts. I would say that in this one they got it right.\r\n\r\nThe movie is frequently quite dark and gritty which of course is fitting with the former East Germany setting. To my great delight they did not stoop to the usual dark, almost black and white, boring type of footage that you too frequently get. Instead the dark and gritty scenes are filmed in a “darkish” blue hue and the scenes actually have a lot of color in them.\r\n\r\nThe story is a fairly standard spy-is-given-a-mission-behind-the-wall-and-it-all-goes-to-hell one. As a story goes it is really not much to write home about and it has the usual plot holes and illogical twists. What makes this movie good is how it is implemented.\r\n\r\nAs I have already mentioned Charlize Theron is great in her role. She is sharp tongued, hot and kicks ass. Unlike many protagonists in movies like this one she not only administers pain but she receives it as well. Actually the movie starts with scenes of her showing off bruises all over her body (yes all of it).\r\n\r\nTo fill out the picture we get some brutal, and I mean brutal, KGB agents, the traitorous colleague, the defector and a few other characters. Together they embark on a roller coaster ride of spy work, chases, (brutal) ass kicking etc. All of it very well done as far as I am concerned. It is not the silly fx loaded blow-everything-up kind of action but instead up-personal-beat-them-up action.\r\n\r\nI have to say that I quite liked the end of the movie as well. The twist at the end was maybe not the biggest surprise of the year but I definitely liked it. I really do not like movies that fizzles out with a bunch of loose ends and objectives not achieved. This movie is, to my great enjoyment, not one of those.\r\n\r\nTo me this movie was really good. Certainly better than I expected.",
        "url": "https://www.themoviedb.org/review/5a703b79925141374500bbab"
      }
    ],
    "total_pages": 1,
    "total_results": 2
  },
  {
    "id": 339404,
    "page": 1,
    "results": [
      {
        "id": "59c7523ac3a36814300569b3",
        "author": "Gimly",
        "content": "Alexandra Daddario is an absolutely champion. She always gives 100% and I respect her for that immensely. The same goes for her in _The Layover_, but this straight up is not a good film.\r\n\r\nThe leads are just not on the same level (in terms of both the actors and the characters), virtually none of the jokes land, and almost everything in _The Layover_ we have seen (and groaned at) a dozen times before. The payoff for the central conflict is actually oddly satisfying in a way that, I at least personally, haven't seen before. But everything leading up to it, and the short tag following it, were totally not striking a chord with me.\r\n\r\n_Final rating:★½: - Boring/disappointing. Avoid where possible._",
        "url": "https://www.themoviedb.org/review/59c7523ac3a36814300569b3"
      }
    ],
    "total_pages": 1,
    "total_results": 1
  }
]